[Killed] BlockStatement
src/hooks/useModifySettings.ts:102:68
 }
 
 // Bug #5628: the only three inputs connector validation actually reads.
-function connectorFingerprint(payload: ModifySettingsBase): string {
-	return JSON.stringify({
-		workTrackingSystemConnectionId: payload.workTrackingSystemConnectionId,
-		dataRetrievalValue: payload.dataRetrievalValue,
-		workItemTypes: payload.workItemTypes,
-	});
-}
+function connectorFingerprint(payload: ModifySettingsBase): string {}
 
 const POST_SAVE_VALIDATION_FAILED =
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 re-probes when a later save changes the query
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/hooks/useModifySettings.ts:103:24
 
 // Bug #5628: the only three inputs connector validation actually reads.
 function connectorFingerprint(payload: ModifySettingsBase): string {
-	return JSON.stringify({
-		workTrackingSystemConnectionId: payload.workTrackingSystemConnectionId,
-		dataRetrievalValue: payload.dataRetrievalValue,
-		workItemTypes: payload.workItemTypes,
-	});
+	return JSON.stringify({});
 }
 
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 re-probes when a later save changes the query
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useModifySettings.ts:177:33
 	// Bug #5628: auto-save never blocks the write, so validation reports on what was persisted.
 	const maybeValidateAfterSave = useCallback(
 		(payload: TSettings, isLatest: () => boolean) => {
-			if (modifyDefaultSettings || !isLatest()) return;
+			if (modifyDefaultSettings || isLatest()) return;
 			// A queued payload means a newer save is coming — validate that one instead.
 			if (pendingPayloadRef.current) return;
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error warns the coach when the settings the auto-save just persisted do not validate
statusReason: expected null to deeply equal Any<String>

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:177:8
 	// Bug #5628: auto-save never blocks the write, so validation reports on what was persisted.
 	const maybeValidateAfterSave = useCallback(
 		(payload: TSettings, isLatest: () => boolean) => {
-			if (modifyDefaultSettings || !isLatest()) return;
+			if (false) return;
 			// A queued payload means a newer save is coming — validate that one instead.
 			if (pendingPayloadRef.current) return;
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 never probes on the default-settings pages, which have no connector
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:179:8
 		(payload: TSettings, isLatest: () => boolean) => {
 			if (modifyDefaultSettings || !isLatest()) return;
 			// A queued payload means a newer save is coming — validate that one instead.
-			if (pendingPayloadRef.current) return;
+			if (false) return;
 
 			const fingerprint = connectorFingerprint(payload);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 probes the payload that supersedes the one queued behind an in-flight save
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:179:8
 		(payload: TSettings, isLatest: () => boolean) => {
 			if (modifyDefaultSettings || !isLatest()) return;
 			// A queued payload means a newer save is coming — validate that one instead.
-			if (pendingPayloadRef.current) return;
+			if (true) return;
 
 			const fingerprint = connectorFingerprint(payload);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error warns the coach when the settings the auto-save just persisted do not validate
statusReason: expected null to deeply equal Any<String>

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:182:8
 			if (pendingPayloadRef.current) return;
 
 			const fingerprint = connectorFingerprint(payload);
-			if (fingerprint === lastValidatedFingerprintRef.current) return;
+			if (false) return;
 			lastValidatedFingerprintRef.current = fingerprint;
 
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 does not re-probe when a later save leaves the connector-relevant fields untouched
statusReason: expected "vi.fn()" to be called 1 times, but got 3 times

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:182:8
 			if (pendingPayloadRef.current) return;
 
 			const fingerprint = connectorFingerprint(payload);
-			if (fingerprint === lastValidatedFingerprintRef.current) return;
+			if (true) return;
 			lastValidatedFingerprintRef.current = fingerprint;
 
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error warns the coach when the settings the auto-save just persisted do not validate
statusReason: expected null to deeply equal Any<String>

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useModifySettings.ts:188:19
 			validateSettingsRef
 				.current(payload)
 				.then(
-					(isValid) => {
-						if (!isLatest()) return;
-						setValidationError(isValid ? null : POST_SAVE_VALIDATION_FAILED);
-						setValidationTechnicalDetails(null);
-					},
+					(isValid) => {},
 					(error: unknown) => {
 						if (!(error instanceof ApiError)) {
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error warns the coach when the settings the auto-save just persisted do not validate
statusReason: expected null to deeply equal Any<String>

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:189:11
 				.current(payload)
 				.then(
 					(isValid) => {
-						if (!isLatest()) return;
+						if (true) return;
 						setValidationError(isValid ? null : POST_SAVE_VALIDATION_FAILED);
 						setValidationTechnicalDetails(null);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error warns the coach when the settings the auto-save just persisted do not validate
statusReason: expected null to deeply equal Any<String>

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useModifySettings.ts:189:11
 				.current(payload)
 				.then(
 					(isValid) => {
-						if (!isLatest()) return;
+						if (isLatest()) return;
 						setValidationError(isValid ? null : POST_SAVE_VALIDATION_FAILED);
 						setValidationTechnicalDetails(null);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error warns the coach when the settings the auto-save just persisted do not validate
statusReason: expected null to deeply equal Any<String>

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useModifySettings.ts:193:26
 						setValidationError(isValid ? null : POST_SAVE_VALIDATION_FAILED);
 						setValidationTechnicalDetails(null);
 					},
-					(error: unknown) => {
-						if (!(error instanceof ApiError)) {
-							console.error("Error validating settings after save", error);
-							return;
-						}
-						if (!isLatest()) return;
-						setValidationError(error.message);
-						setValidationTechnicalDetails(error.technicalDetails ?? null);
-					},
+					(error: unknown) => {},
 				)
 				.catch(() => undefined);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error carries the connector's own verdict through to the alert
statusReason: expected null to be 'No work items found for Work Item Typ…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useModifySettings.ts:194:11
 						setValidationTechnicalDetails(null);
 					},
 					(error: unknown) => {
-						if (!(error instanceof ApiError)) {
+						if (error instanceof ApiError) {
 							console.error("Error validating settings after save", error);
 							return;
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error carries the connector's own verdict through to the alert
statusReason: expected null to be 'No work items found for Work Item Typ…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:194:11
 						setValidationTechnicalDetails(null);
 					},
 					(error: unknown) => {
-						if (!(error instanceof ApiError)) {
+						if (true) {
 							console.error("Error validating settings after save", error);
 							return;
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error carries the connector's own verdict through to the alert
statusReason: expected null to be 'No work items found for Work Item Typ…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] StringLiteral
src/hooks/useModifySettings.ts:195:22
 					},
 					(error: unknown) => {
 						if (!(error instanceof ApiError)) {
-							console.error("Error validating settings after save", error);
+							console.error("", error);
 							return;
 						}

[Killed] ConditionalExpression
src/hooks/useModifySettings.ts:198:11
 							console.error("Error validating settings after save", error);
 							return;
 						}
-						if (!isLatest()) return;
+						if (true) return;
 						setValidationError(error.message);
 						setValidationTechnicalDetails(error.technicalDetails ?? null);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error carries the connector's own verdict through to the alert
statusReason: expected null to be 'No work items found for Work Item Typ…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useModifySettings.ts:198:11
 							console.error("Error validating settings after save", error);
 							return;
 						}
-						if (!isLatest()) return;
+						if (isLatest()) return;
 						setValidationError(error.message);
 						setValidationTechnicalDetails(error.technicalDetails ?? null);
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error carries the connector's own verdict through to the alert
statusReason: expected null to be 'No work items found for Work Item Typ…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/hooks/useModifySettings.ts:200:37
 						}
 						if (!isLatest()) return;
 						setValidationError(error.message);
-						setValidationTechnicalDetails(error.technicalDetails ?? null);
+						setValidationTechnicalDetails(error.technicalDetails && null);
 					},
 				)
killedBy: @BUG-5628 @in-memory auto-save validates connector settings @BUG-5628 @error carries the connector's own verdict through to the alert
statusReason: expected null to be 'Probe sysparm_query=... returned 0 re…' // Object.is equality
