[Killed] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:42:56
 	const featureTerm = getTerm(TERMINOLOGY_KEYS.FEATURE);
 	const teamTerm = getTerm(TERMINOLOGY_KEYS.TEAM);
 
-	const fetchOptionalFeatures = useCallback(async () => {
-		const optionalFeatureData = await optionalFeatureService.getAllFeatures();
-		if (optionalFeatureData) {
-			setOptionalFeatures(optionalFeatureData);
-		}
-	}, [optionalFeatureService]);
+	const fetchOptionalFeatures = useCallback(async () => {}, [optionalFeatureService]);
 
 	const fetchLicenseStatus = useCallback(async () => {
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: Unable to find an element with the text: Feature 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1yjvs5a"
    >

[Killed] ConditionalExpression
pages/Settings/System/SystemSettingsTab.tsx:44:7
 
 	const fetchOptionalFeatures = useCallback(async () => {
 		const optionalFeatureData = await optionalFeatureService.getAllFeatures();
-		if (optionalFeatureData) {
+		if (false) {
 			setOptionalFeatures(optionalFeatureData);
 		}
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: Unable to find an element with the text: Feature 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1yjvs5a"
    >

[Killed] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:44:28
 
 	const fetchOptionalFeatures = useCallback(async () => {
 		const optionalFeatureData = await optionalFeatureService.getAllFeatures();
-		if (optionalFeatureData) {
-			setOptionalFeatures(optionalFeatureData);
-		}
+		if (optionalFeatureData) {}
 	}, [optionalFeatureService]);
 
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: Unable to find an element with the text: Feature 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1yjvs5a"
    >

[Survived] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:49:53
 		}
 	}, [optionalFeatureService]);
 
-	const fetchLicenseStatus = useCallback(async () => {
-		try {
-			const licenseData = await licensingService.getLicenseStatus();
-			setLicenseStatus(licenseData);
-		} catch (error) {
-			console.error("Failed to fetch license status:", error);
-			setLicenseStatus(null);
-		}
-	}, [licensingService]);
+	const fetchLicenseStatus = useCallback(async () => {}, [licensingService]);
 
 	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {

[Survived] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:50:7
 	}, [optionalFeatureService]);
 
 	const fetchLicenseStatus = useCallback(async () => {
-		try {
-			const licenseData = await licensingService.getLicenseStatus();
-			setLicenseStatus(licenseData);
-		} catch (error) {
+		try {} catch (error) {
 			console.error("Failed to fetch license status:", error);
 			setLicenseStatus(null);

[NoCoverage] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:53:19
 		try {
 			const licenseData = await licensingService.getLicenseStatus();
 			setLicenseStatus(licenseData);
-		} catch (error) {
-			console.error("Failed to fetch license status:", error);
-			setLicenseStatus(null);
-		}
+		} catch (error) {}
 	}, [licensingService]);
 

[Killed] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:59:78
 		}
 	}, [licensingService]);
 
-	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {
-		const updatedFeatures = optionalFeatures.map((feature) =>
-			feature.id === toggledFeature.id
-				? { ...feature, enabled: !feature.enabled }
-				: feature,
-		);
-		setOptionalFeatures(updatedFeatures);
-
-		try {
-			await optionalFeatureService.updateFeature({
-				...toggledFeature,
-				enabled: !toggledFeature.enabled,
-			});
-		} catch {
-			await fetchOptionalFeatures();
-		}
-	};
+	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {};
 
 	useEffect(() => {
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ArrowFunction
pages/Settings/System/SystemSettingsTab.tsx:60:48
 	}, [licensingService]);
 
 	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {
-		const updatedFeatures = optionalFeatures.map((feature) =>
-			feature.id === toggledFeature.id
-				? { ...feature, enabled: !feature.enabled }
-				: feature,
+		const updatedFeatures = optionalFeatures.map(() => undefined,
 		);
 		setOptionalFeatures(updatedFeatures);
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: Cannot read properties of undefined (reading 'isPremium')

[Killed] EqualityOperator
pages/Settings/System/SystemSettingsTab.tsx:61:4
 
 	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {
 		const updatedFeatures = optionalFeatures.map((feature) =>
-			feature.id === toggledFeature.id
+			feature.id !== toggledFeature.id
 				? { ...feature, enabled: !feature.enabled }
 				: feature,
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"
  type="checkbox"
/>

[Killed] ConditionalExpression
pages/Settings/System/SystemSettingsTab.tsx:61:4
 
 	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {
 		const updatedFeatures = optionalFeatures.map((feature) =>
-			feature.id === toggledFeature.id
+			false
 				? { ...feature, enabled: !feature.enabled }
 				: feature,
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"
  type="checkbox"
/>

[Killed] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:62:30
 	const onToggleOptionalFeature = async (toggledFeature: IOptionalFeature) => {
 		const updatedFeatures = optionalFeatures.map((feature) =>
 			feature.id === toggledFeature.id
-				? { ...feature, enabled: !feature.enabled }
+				? { ...feature, enabled: feature.enabled }
 				: feature,
 		);
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"
  type="checkbox"
/>

[Killed] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:67:7
 		);
 		setOptionalFeatures(updatedFeatures);
 
-		try {
-			await optionalFeatureService.updateFeature({
-				...toggledFeature,
-				enabled: !toggledFeature.enabled,
-			});
-		} catch {
+		try {} catch {
 			await fetchOptionalFeatures();
 		}
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:70:14
 		try {
 			await optionalFeatureService.updateFeature({
 				...toggledFeature,
-				enabled: !toggledFeature.enabled,
+				enabled: toggledFeature.enabled,
 			});
 		} catch {
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[NoCoverage] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:72:11
 				...toggledFeature,
 				enabled: !toggledFeature.enabled,
 			});
-		} catch {
-			await fetchOptionalFeatures();
-		}
+		} catch {}
 	};
 

[Killed] BlockStatement
pages/Settings/System/SystemSettingsTab.tsx:77:18
 		}
 	};
 
-	useEffect(() => {
-		fetchOptionalFeatures();
-		fetchLicenseStatus();
-	}, [fetchOptionalFeatures, fetchLicenseStatus]);
+	useEffect(() => {}, [fetchOptionalFeatures, fetchLicenseStatus]);
 
 	return (
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: Unable to find an element with the text: Feature 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1yjvs5a"
    >

[Survived] ArrayDeclaration
pages/Settings/System/SystemSettingsTab.tsx:80:5
 	useEffect(() => {
 		fetchOptionalFeatures();
 		fetchLicenseStatus();
-	}, [fetchOptionalFeatures, fetchLicenseStatus]);
+	}, []);
 
 	return (

[Survived] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:86:24
 		<Box sx={{ mb: 4 }}>
 			<InputGroup
 				title="Blackout Periods & Recurring Rules"
-				initiallyExpanded={true}
+				initiallyExpanded={false}
 			>
 				<BlackoutSettings

[Killed] OptionalChaining
pages/Settings/System/SystemSettingsTab.tsx:89:17
 				initiallyExpanded={true}
 			>
 				<BlackoutSettings
-					isPremium={licenseStatus?.canUsePremiumFeatures ?? false}
+					isPremium={licenseStatus.canUsePremiumFeatures ?? false}
 				/>
 			</InputGroup>
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: Cannot read properties of null (reading 'canUsePremiumFeatures')

[Survived] LogicalOperator
pages/Settings/System/SystemSettingsTab.tsx:89:17
 				initiallyExpanded={true}
 			>
 				<BlackoutSettings
-					isPremium={licenseStatus?.canUsePremiumFeatures ?? false}
+					isPremium={licenseStatus?.canUsePremiumFeatures && false}
 				/>
 			</InputGroup>

[Killed] ConditionalExpression
pages/Settings/System/SystemSettingsTab.tsx:93:5
 				/>
 			</InputGroup>
 
-			{optionalFeatures.length > 0 && (
+			{true && (
 				<InputGroup title="Optional Features" initiallyExpanded={true}>
 					<TableContainer>
killedBy: SystemSettingsTab Component should not render the Optional Features section when no features are available
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h6
  class="MuiTypography-root MuiTypography-h6 css-1tep5f5-MuiTypography-root"
>
  Optional Features
</h6> instead

[Killed] EqualityOperator
pages/Settings/System/SystemSettingsTab.tsx:93:5
 				/>
 			</InputGroup>
 
-			{optionalFeatures.length > 0 && (
+			{optionalFeatures.length >= 0 && (
 				<InputGroup title="Optional Features" initiallyExpanded={true}>
 					<TableContainer>
killedBy: SystemSettingsTab Component should not render the Optional Features section when no features are available
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h6
  class="MuiTypography-root MuiTypography-h6 css-1tep5f5-MuiTypography-root"
>
  Optional Features
</h6> instead

[Killed] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:94:62
 			</InputGroup>
 
 			{optionalFeatures.length > 0 && (
-				<InputGroup title="Optional Features" initiallyExpanded={true}>
+				<InputGroup title="Optional Features" initiallyExpanded={false}>
 					<TableContainer>
 						<Table data-testid="optional-features-table">
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: expect(element).toBeVisible()

Received element is not visible:
  <div
  class="MuiBox-root css-70qvj9"
/>

Ignored nodes: comments, script, style

[Survived] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:109:12
 									<LicenseTooltip
 										key={feature.id}
 										canUseFeature={
-											!feature.isPremium ||
+											feature.isPremium ||
 											(licenseStatus?.canUsePremiumFeatures ?? false)
 										}

[Survived] ConditionalExpression
pages/Settings/System/SystemSettingsTab.tsx:109:12
 									<LicenseTooltip
 										key={feature.id}
 										canUseFeature={
-											!feature.isPremium ||
-											(licenseStatus?.canUsePremiumFeatures ?? false)
+											false
 										}
 										premiumExtraInfo=""

[Survived] LogicalOperator
pages/Settings/System/SystemSettingsTab.tsx:110:13
 										key={feature.id}
 										canUseFeature={
 											!feature.isPremium ||
-											(licenseStatus?.canUsePremiumFeatures ?? false)
+											(licenseStatus?.canUsePremiumFeatures && false)
 										}
 										premiumExtraInfo=""

[NoCoverage] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:110:53
 										key={feature.id}
 										canUseFeature={
 											!feature.isPremium ||
-											(licenseStatus?.canUsePremiumFeatures ?? false)
+											(licenseStatus?.canUsePremiumFeatures ?? true)
 										}
 										premiumExtraInfo=""

[Survived] StringLiteral
pages/Settings/System/SystemSettingsTab.tsx:117:25
 									>
 										<TableRow
 											key={feature.id}
-											data-testid={`feature-row-${feature.key}`}
+											data-testid={``}
 										>
 											<TableCell>

[Killed] ConditionalExpression
pages/Settings/System/SystemSettingsTab.tsx:122:15
 											<TableCell>
 												<Box sx={{ display: "flex", alignItems: "center" }}>
 													{feature.name}
-													{feature.isPreview && (
-														<Tooltip title="This feature is in preview and may change or be removed in future versions">
-															<Chip
-																icon={<BiotechIcon />}
-																label="Preview"
-																size="small"
-																color="warning"
-																sx={{ ml: 1 }}
-																data-testid={`${feature.key}-preview-indicator`}
-															/>
-														</Tooltip>
-													)}
+													{false}
 												</Box>
 											</TableCell>
killedBy: SystemSettingsTab Component should display preview indicator for preview features
statusReason: Unable to find an element by: [data-testid="feature1-preview-indicator"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1yjvs5a"
    >

[Killed] LogicalOperator
pages/Settings/System/SystemSettingsTab.tsx:122:15
 											<TableCell>
 												<Box sx={{ display: "flex", alignItems: "center" }}>
 													{feature.name}
-													{feature.isPreview && (
-														<Tooltip title="This feature is in preview and may change or be removed in future versions">
-															<Chip
-																icon={<BiotechIcon />}
-																label="Preview"
-																size="small"
-																color="warning"
-																sx={{ ml: 1 }}
-																data-testid={`${feature.key}-preview-indicator`}
-															/>
-														</Tooltip>
-													)}
+													{feature.isPreview || <Tooltip title="This feature is in preview and may change or be removed in future versions">
+															<Chip icon={<BiotechIcon />} label="Preview" size="small" color="warning" sx={{
+    ml: 1
+  }} data-testid={`${feature.key}-preview-indicator`} />
+														</Tooltip>}
 												</Box>
 											</TableCell>
killedBy: SystemSettingsTab Component should display preview indicator for preview features
statusReason: Unable to find an element by: [data-testid="feature1-preview-indicator"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1yjvs5a"
    >

[Survived] ObjectLiteral
pages/Settings/System/SystemSettingsTab.tsx:129:21
 																label="Preview"
 																size="small"
 																color="warning"
-																sx={{ ml: 1 }}
+																sx={{}}
 																data-testid={`${feature.key}-preview-indicator`}
 															/>

[Killed] ConditionalExpression
pages/Settings/System/SystemSettingsTab.tsx:142:15
 													checked={feature.enabled}
 													data-testid={`${feature.key}-toggle`}
 													disabled={
-														feature.isPremium &&
-														!(licenseStatus?.canUsePremiumFeatures ?? false)
+														false
 													}
 													onChange={() => onToggleOptionalFeature(feature)}
killedBy: SystemSettingsTab Component should disable the toggle if the feature is premium and the user has no premium license
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <input
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"
  type="checkbox"
/>

[Survived] LogicalOperator
pages/Settings/System/SystemSettingsTab.tsx:142:15
 													checked={feature.enabled}
 													data-testid={`${feature.key}-toggle`}
 													disabled={
-														feature.isPremium &&
-														!(licenseStatus?.canUsePremiumFeatures ?? false)
+														feature.isPremium || !(licenseStatus?.canUsePremiumFeatures ?? false)
 													}
 													onChange={() => onToggleOptionalFeature(feature)}

[Killed] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:143:15
 													data-testid={`${feature.key}-toggle`}
 													disabled={
 														feature.isPremium &&
-														!(licenseStatus?.canUsePremiumFeatures ?? false)
+														licenseStatus?.canUsePremiumFeatures ?? false
 													}
 													onChange={() => onToggleOptionalFeature(feature)}
killedBy: SystemSettingsTab Component should disable the toggle if the feature is premium and the user has no premium license
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <input
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"
  type="checkbox"
/>

[Survived] OptionalChaining
pages/Settings/System/SystemSettingsTab.tsx:143:17
 													data-testid={`${feature.key}-toggle`}
 													disabled={
 														feature.isPremium &&
-														!(licenseStatus?.canUsePremiumFeatures ?? false)
+														!(licenseStatus.canUsePremiumFeatures ?? false)
 													}
 													onChange={() => onToggleOptionalFeature(feature)}

[Killed] ArrowFunction
pages/Settings/System/SystemSettingsTab.tsx:145:24
 														feature.isPremium &&
 														!(licenseStatus?.canUsePremiumFeatures ?? false)
 													}
-													onChange={() => onToggleOptionalFeature(feature)}
+													onChange={() => undefined}
 													color="primary"
 												/>
killedBy: SystemSettingsTab Component should toggle the enabled state of a feature
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Survived] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:158:66
 				</InputGroup>
 			)}
 
-			<InputGroup title={`${featureTerm} Order`} initiallyExpanded={true}>
+			<InputGroup title={`${featureTerm} Order`} initiallyExpanded={false}>
 				<FeatureOrderingSettings
 					isPremium={licenseStatus?.canUsePremiumFeatures ?? false}

[Survived] StringLiteral
pages/Settings/System/SystemSettingsTab.tsx:158:23
 				</InputGroup>
 			)}
 
-			<InputGroup title={`${featureTerm} Order`} initiallyExpanded={true}>
+			<InputGroup title={``} initiallyExpanded={true}>
 				<FeatureOrderingSettings
 					isPremium={licenseStatus?.canUsePremiumFeatures ?? false}

[Killed] OptionalChaining
pages/Settings/System/SystemSettingsTab.tsx:160:17
 
 			<InputGroup title={`${featureTerm} Order`} initiallyExpanded={true}>
 				<FeatureOrderingSettings
-					isPremium={licenseStatus?.canUsePremiumFeatures ?? false}
+					isPremium={licenseStatus.canUsePremiumFeatures ?? false}
 				/>
 			</InputGroup>
killedBy: SystemSettingsTab Component should fetch and display optional features
statusReason: Cannot read properties of null (reading 'canUsePremiumFeatures')

[Survived] LogicalOperator
pages/Settings/System/SystemSettingsTab.tsx:160:17
 
 			<InputGroup title={`${featureTerm} Order`} initiallyExpanded={true}>
 				<FeatureOrderingSettings
-					isPremium={licenseStatus?.canUsePremiumFeatures ?? false}
+					isPremium={licenseStatus?.canUsePremiumFeatures && false}
 				/>
 			</InputGroup>

[Survived] BooleanLiteral
pages/Settings/System/SystemSettingsTab.tsx:164:69
 				/>
 			</InputGroup>
 
-			<InputGroup title="Terminology Configuration" initiallyExpanded={true}>
+			<InputGroup title="Terminology Configuration" initiallyExpanded={false}>
 				<TerminologyConfiguration />
 			</InputGroup>

[Survived] StringLiteral
pages/Settings/System/SystemSettingsTab.tsx:168:23
 				<TerminologyConfiguration />
 			</InputGroup>
 
-			<InputGroup title={`${teamTerm} Refresh`}>
+			<InputGroup title={``}>
 				<RefreshSettingUpdater title={teamTerm} settingName="Team" />
 			</InputGroup>
