[Killed] ArrowFunction
pages/Settings/Encryption/EncryptionPanel.tsx:127:29
 							useFlexGap
 							sx={{ flexWrap: "wrap" }}
 						>
-							{keyState.keyIds.map((keyId) => (
-								<Chip
-									key={keyId}
-									label={keyId}
-									size="small"
-									data-testid={`encryption-key-${keyId}`}
-								/>
-							))}
+							{keyState.keyIds.map(() => undefined)}
 						</Stack>
 					</TableCell>
killedBy: EncryptionPanel lists the keys the instance holds, by name
statusReason: Unable to find an element by: [data-testid="encryption-key-k-2026-08-16-01"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiCard-root css-9a06j8-MuiPaper-root-MuiCard-root"
    >
