[Killed] BooleanLiteral
components/Common/FeatureListDataGrid/columns.tsx:118:12
 	headerName: "Warnings",
 	type: "boolean",
 	width: 90,
-	sortable: true,
+	sortable: false,
 	// The sort has to see everything the icon shows, or a row whose only warning is about a dependency
 	// sorts as though it were clean and the column quietly stops being a way to find them.
killedBy: createWarningsColumn sorts on everything the icons show stays sortable, which is the whole reason the predicate above exists
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
components/Common/FeatureListDataGrid/columns.tsx:121:15
 	sortable: true,
 	// The sort has to see everything the icon shows, or a row whose only warning is about a dependency
 	// sorts as though it were clean and the column quietly stops being a way to find them.
-	valueGetter: (_, row) =>
-		(row.stateCategory === "Done" && row.getRemainingWorkForFeature() > 0) ||
-		row.isUsingDefaultFeatureSize ||
-		(row.dependsOn ?? []).some(isWorthWarningAbout),
+	valueGetter: () => undefined,
 	renderCell: ({ row }) => (
 		<WarningsIndicator
killedBy: createWarningsColumn sorts on everything the icons show sorts a row with nothing wrong as clear
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/columns.tsx:122:3
 	// The sort has to see everything the icon shows, or a row whose only warning is about a dependency
 	// sorts as though it were clean and the column quietly stops being a way to find them.
 	valueGetter: (_, row) =>
-		(row.stateCategory === "Done" && row.getRemainingWorkForFeature() > 0) ||
-		row.isUsingDefaultFeatureSize ||
-		(row.dependsOn ?? []).some(isWorthWarningAbout),
+		true,
 	renderCell: ({ row }) => (
 		<WarningsIndicator
killedBy: createWarningsColumn sorts on everything the icons show sorts a row with nothing wrong as clear
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/Common/FeatureListDataGrid/columns.tsx:122:36
 	// The sort has to see everything the icon shows, or a row whose only warning is about a dependency
 	// sorts as though it were clean and the column quietly stops being a way to find them.
 	valueGetter: (_, row) =>
-		(row.stateCategory === "Done" && row.getRemainingWorkForFeature() > 0) ||
+		(row.stateCategory === "Done" && row.getRemainingWorkForFeature() <= 0) ||
 		row.isUsingDefaultFeatureSize ||
 		(row.dependsOn ?? []).some(isWorthWarningAbout),
killedBy: createWarningsColumn sorts on everything the icons show sorts a Feature marked done with work still on it as warned
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
components/Common/FeatureListDataGrid/columns.tsx:124:3
 	valueGetter: (_, row) =>
 		(row.stateCategory === "Done" && row.getRemainingWorkForFeature() > 0) ||
 		row.isUsingDefaultFeatureSize ||
-		(row.dependsOn ?? []).some(isWorthWarningAbout),
+		(row.dependsOn ?? []).every(isWorthWarningAbout),
 	renderCell: ({ row }) => (
 		<WarningsIndicator
killedBy: createWarningsColumn sorts on everything the icons show sorts a row with nothing wrong as clear
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
components/Common/FeatureListDataGrid/columns.tsx:124:4
 	valueGetter: (_, row) =>
 		(row.stateCategory === "Done" && row.getRemainingWorkForFeature() > 0) ||
 		row.isUsingDefaultFeatureSize ||
-		(row.dependsOn ?? []).some(isWorthWarningAbout),
+		(row.dependsOn && []).some(isWorthWarningAbout),
 	renderCell: ({ row }) => (
 		<WarningsIndicator
killedBy: createWarningsColumn sorts on everything the icons show sorts a dependency that is OutsideThisPortfolio as warned
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
components/Common/FeatureListDataGrid/columns.tsx:151:25
 // Most Features wait on nothing, so the cell stays blank in that case, the same way a missing position
 // is left blank. Each one it does wait on gets its own line: a reader scanning the column is looking
 // for which Features are involved, and a run-on line makes them read it twice.
-const renderDependsOn = (row: IFeature, terms: DependencyTerms) => (
-	<Box sx={{ py: 0.5 }}>
-		{(row.dependsOn ?? []).map((dependency, index) => (
-			<Typography
-				// A withheld entry carries no id of its own to be listed under - that is what withholding it
-				// means - so it is the one case keyed by where it sits.
-				key={
-					dependency.isWithheld ? `withheld-${index}` : dependency.referenceId
-				}
-				variant="body2"
-				component="div"
-				data-testid={`depends-on-${row.referenceId}`}
-				sx={isSetAside(dependency) ? { color: "text.disabled" } : undefined}
-			>
-				{renderSetAsideOrNot(dependency, terms)}
-			</Typography>
-		))}
-	</Box>
-);
+const renderDependsOn = () => undefined;
 
 // Nothing warns about a dependency somebody chose to set aside, so this entry is the only place a reader
killedBy: createDependsOnColumn names each Feature this one waits on, id first
statusReason: Unable to find an element with the text: FTR-9: Warehouse sync. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
components/Common/FeatureListDataGrid/columns.tsx:153:5
 // for which Features are involved, and a run-on line makes them read it twice.
 const renderDependsOn = (row: IFeature, terms: DependencyTerms) => (
 	<Box sx={{ py: 0.5 }}>
-		{(row.dependsOn ?? []).map((dependency, index) => (
+		{(row.dependsOn && []).map((dependency, index) => (
 			<Typography
 				// A withheld entry carries no id of its own to be listed under - that is what withholding it
killedBy: createDependsOnColumn names each Feature this one waits on, id first
statusReason: Unable to find an element with the text: FTR-9: Warehouse sync. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-mz9qt7"
    />

[Killed] ArrowFunction
components/Common/FeatureListDataGrid/columns.tsx:153:30
 // for which Features are involved, and a run-on line makes them read it twice.
 const renderDependsOn = (row: IFeature, terms: DependencyTerms) => (
 	<Box sx={{ py: 0.5 }}>
-		{(row.dependsOn ?? []).map((dependency, index) => (
-			<Typography
-				// A withheld entry carries no id of its own to be listed under - that is what withholding it
-				// means - so it is the one case keyed by where it sits.
-				key={
-					dependency.isWithheld ? `withheld-${index}` : dependency.referenceId
-				}
-				variant="body2"
-				component="div"
-				data-testid={`depends-on-${row.referenceId}`}
-				sx={isSetAside(dependency) ? { color: "text.disabled" } : undefined}
-			>
-				{renderSetAsideOrNot(dependency, terms)}
-			</Typography>
-		))}
+		{(row.dependsOn ?? []).map(() => undefined)}
 	</Box>
 );
killedBy: createDependsOnColumn names each Feature this one waits on, id first
statusReason: Unable to find an element with the text: FTR-9: Warehouse sync. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-mz9qt7"
    />

[Survived] StringLiteral
components/Common/FeatureListDataGrid/columns.tsx:163:43
 				variant="body2"
 				component="div"
 				data-testid={`depends-on-${row.referenceId}`}
-				sx={isSetAside(dependency) ? { color: "text.disabled" } : undefined}
+				sx={isSetAside(dependency) ? { color: "" } : undefined}
 			>
 				{renderSetAsideOrNot(dependency, terms)}

[Killed] BlockStatement
components/Common/FeatureListDataGrid/columns.tsx:177:6
 const renderSetAsideOrNot = (
 	dependency: IFeatureDependency,
 	terms: DependencyTerms,
-) => {
-	if (!isSetAside(dependency)) {
-		return renderDependency(dependency);
-	}
-
-	const waitedOn = dependency.isWithheld
-		? withheldName(terms)
-		: dependency.name;
-
-	return (
-		<Tooltip title={reasonSentence("IgnoredByPortfolio", waitedOn, terms)}>
-			<span data-testid="dependency-set-aside">
-				{renderDependency(dependency)}
-			</span>
-		</Tooltip>
-	);
-};
+) => {};
 
 const renderDependency = (dependency: IFeatureDependency) => {
killedBy: createDependsOnColumn names each Feature this one waits on, id first
statusReason: Unable to find an element with the text: FTR-9: Warehouse sync. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-mz9qt7"
    >

[Killed] BooleanLiteral
components/Common/FeatureListDataGrid/columns.tsx:178:6
 	dependency: IFeatureDependency,
 	terms: DependencyTerms,
 ) => {
-	if (!isSetAside(dependency)) {
+	if (isSetAside(dependency)) {
 		return renderDependency(dependency);
 	}
killedBy: createDependsOnColumn says on the entry itself that a dependency has been set aside
statusReason: Unable to find an element by: [data-testid="dependency-set-aside"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-mz9qt7"
    >

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/columns.tsx:178:6
 	dependency: IFeatureDependency,
 	terms: DependencyTerms,
 ) => {
-	if (!isSetAside(dependency)) {
+	if (true) {
 		return renderDependency(dependency);
 	}
killedBy: createDependsOnColumn says on the entry itself that a dependency has been set aside
statusReason: Unable to find an element by: [data-testid="dependency-set-aside"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-mz9qt7"
    >
