[Killed] ArrayDeclaration
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:31:17
 const WarningsIndicator: React.FC<WarningsIndicatorProps> = ({
 	isDoneWithRemainingWork,
 	isUsingDefaultFeatureSize,
-	dependencies = [],
+	dependencies = ["Stryker was here"],
 }) => {
 	// Having a dependency is not a warning; only one with something wrong with it is.
killedBy: WarningsIndicator should render check icon when no warnings apply
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature depends on undefined, which sits below it in the order."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] MethodExpression
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:34:25
 	dependencies = [],
 }) => {
 	// Having a dependency is not a warning; only one with something wrong with it is.
-	const worthReporting = dependencies.filter(isWorthWarningAbout);
+	const worthReporting = dependencies;
 	const { getTerm } = useTerminology();
 	const workItemsTerm = getTerm(TERMINOLOGY_KEYS.WORK_ITEMS);
killedBy: WarningsIndicator dependency warnings still shows the all-clear when a dependency has nothing wrong with it
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature depends on Warehouse sync, which sits below it in the order."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:41:3
 	const portfolioTerm = getTerm(TERMINOLOGY_KEYS.PORTFOLIO);
 
 	if (
-		!isDoneWithRemainingWork &&
-		!isUsingDefaultFeatureSize &&
-		worthReporting.length === 0
+		false
 	) {
 		return (
killedBy: WarningsIndicator should render check icon when no warnings apply
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:41:3
 	const portfolioTerm = getTerm(TERMINOLOGY_KEYS.PORTFOLIO);
 
 	if (
-		!isDoneWithRemainingWork &&
-		!isUsingDefaultFeatureSize &&
+		!isDoneWithRemainingWork || !isUsingDefaultFeatureSize &&
 		worthReporting.length === 0
 	) {
killedBy: WarningsIndicator should render warning icon when isDoneWithRemainingWork is true
statusReason: Unable to find an element by: [data-testid="warning-done-with-remaining-work"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="No warnings"
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] BooleanLiteral
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:42:3
 
 	if (
 		!isDoneWithRemainingWork &&
-		!isUsingDefaultFeatureSize &&
+		isUsingDefaultFeatureSize &&
 		worthReporting.length === 0
 	) {
killedBy: WarningsIndicator should render check icon when no warnings apply
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:43:3
 	if (
 		!isDoneWithRemainingWork &&
 		!isUsingDefaultFeatureSize &&
-		worthReporting.length === 0
+		worthReporting.length !== 0
 	) {
 		return (
killedBy: WarningsIndicator should render check icon when no warnings apply
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:43:3
 	if (
 		!isDoneWithRemainingWork &&
 		!isUsingDefaultFeatureSize &&
-		worthReporting.length === 0
+		true
 	) {
 		return (
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="No warnings"
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] StringLiteral
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:122:11
 // reaches this component, because it is not worth warning anybody about.
 const KIND_OF_REASON: Record<NotHonouredReason, DependencyWarningKind> = {
 	OutsideThisPortfolio: "outside-portfolio",
-	InALoop: "in-a-loop",
+	InALoop: "",
 	BlockerCannotBeForecast: "cannot-be-forecast",
 	IgnoredByPortfolio: "set-aside",
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] StringLiteral
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:123:27
 const KIND_OF_REASON: Record<NotHonouredReason, DependencyWarningKind> = {
 	OutsideThisPortfolio: "outside-portfolio",
 	InALoop: "in-a-loop",
-	BlockerCannotBeForecast: "cannot-be-forecast",
+	BlockerCannotBeForecast: "",
 	IgnoredByPortfolio: "set-aside",
 };
killedBy: WarningsIndicator dependency warnings says the wait cannot be given a date
statusReason: Unable to find an element by: [data-testid="warning-dependency-cannot-be-forecast"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="Warehouse sync has no measured delivery to forecast from, so the wait cannot be given a date. That dependency is not included in the forecast."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-M

[Killed] BlockStatement
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:129:75
 
 // A dependency Lighthouse cannot act on is reported as such; where it sits in the order is only worth
 // mentioning about one it can act on, so the reason wins where a dependency has both.
-const kindOf = (dependency: IFeatureDependency): DependencyWarningKind => {
-	if (dependency.notHonouredReason) {
-		return KIND_OF_REASON[dependency.notHonouredReason];
-	}
-
-	return "positioned-below";
-};
+const kindOf = (dependency: IFeatureDependency): DependencyWarningKind => {};
 
 // The words themselves live beside the dialog's, so a row and the list opened from it say the same
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:130:6
 // A dependency Lighthouse cannot act on is reported as such; where it sits in the order is only worth
 // mentioning about one it can act on, so the reason wins where a dependency has both.
 const kindOf = (dependency: IFeatureDependency): DependencyWarningKind => {
-	if (dependency.notHonouredReason) {
+	if (true) {
 		return KIND_OF_REASON[dependency.notHonouredReason];
 	}
killedBy: WarningsIndicator dependency warnings says a Feature waited on sits lower down in the order
statusReason: Unable to find an element by: [data-testid="warning-dependency-positioned-below"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature depends on Warehouse sync, which sits below it in the order."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:130:6
 // A dependency Lighthouse cannot act on is reported as such; where it sits in the order is only worth
 // mentioning about one it can act on, so the reason wins where a dependency has both.
 const kindOf = (dependency: IFeatureDependency): DependencyWarningKind => {
-	if (dependency.notHonouredReason) {
+	if (false) {
 		return KIND_OF_REASON[dependency.notHonouredReason];
 	}
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] BlockStatement
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:142:14
 const sentenceFor = (
 	dependency: IFeatureDependency,
 	terms: DependencyTerms,
-): string => {
-	const waitedOn = dependency.isWithheld
-		? withheldName(terms)
-		: dependency.name;
-
-	if (dependency.notHonouredReason) {
-		return reasonSentence(dependency.notHonouredReason, waitedOn, terms);
-	}
-
-	return positionedBelowSentence(waitedOn, terms);
-};
+): string => {};
 
 export default WarningsIndicator;
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: 
Expected the element to have attribute:
  aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
Received:
  null

[Killed] BlockStatement
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:147:36
 		? withheldName(terms)
 		: dependency.name;
 
-	if (dependency.notHonouredReason) {
-		return reasonSentence(dependency.notHonouredReason, waitedOn, terms);
-	}
+	if (dependency.notHonouredReason) {}
 
 	return positionedBelowSentence(waitedOn, terms);
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: 
Expected the element to have attribute:
  aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
Received:
  aria-label="This Feature depends on Warehouse sync, which sits below it in the order."

[Killed] ConditionalExpression
components/Common/FeatureListDataGrid/WarningsIndicator.tsx:147:6
 		? withheldName(terms)
 		: dependency.name;
 
-	if (dependency.notHonouredReason) {
+	if (false) {
 		return reasonSentence(dependency.notHonouredReason, waitedOn, terms);
 	}
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: 
Expected the element to have attribute:
  aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
Received:
  aria-label="This Feature depends on Warehouse sync, which sits below it in the order."
