[Survived] ObjectLiteral
src/models/Encryption/EncryptionKeyState.ts:30:50
 	keySuppliedThrough: string | null;
 }
 
-export const EncryptionKeyStateSchema = z.object({
-	custody: z.enum(KEY_CUSTODY_VALUES),
-	canMint: z.boolean(),
-	activeKeyId: z.string(),
-	keyIds: z.array(z.string()),
-	keyStorePath: z.string(),
-	legacyDefaultPresent: z.boolean(),
-	secretsUnderPublishedKey: z.number(),
-	readableSecretsNotOnTheActiveKey: z.number(),
-	allowsStartWithUnreadableSecrets: z.boolean(),
-	keySuppliedThrough: z.string().nullable(),
-});
+export const EncryptionKeyStateSchema = z.object({});
 
 // A self-hoster reading this screen is asking whether the key is theirs to keep, not what the

[Killed] ObjectLiteral
src/models/Encryption/EncryptionKeyState.ts:45:64
 
 // A self-hoster reading this screen is asking whether the key is theirs to keep, not what the
 // server calls the case internally. The same four phrasings are what the startup log prints.
-export const KEY_CUSTODY_WORDING: Record<KeyCustody, string> = {
-	NoDurableStore: "the key published with the product",
-	GeneratedForThisInstance: "generated for this instance",
-	SuppliedByConfiguration: "supplied by configuration",
-	SuppliedByExternalSecret: "supplied by a mounted secret file",
-};
+export const KEY_CUSTODY_WORDING: Record<KeyCustody, string> = {};
 
killedBy: EncryptionPanel should describe custody NoDurableStore in words rather than as an enum name
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  the key published with the product
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
src/models/Encryption/EncryptionKeyState.ts:47:28
 // server calls the case internally. The same four phrasings are what the startup log prints.
 export const KEY_CUSTODY_WORDING: Record<KeyCustody, string> = {
 	NoDurableStore: "the key published with the product",
-	GeneratedForThisInstance: "generated for this instance",
+	GeneratedForThisInstance: "",
 	SuppliedByConfiguration: "supplied by configuration",
 	SuppliedByExternalSecret: "supplied by a mounted secret file",
killedBy: EncryptionPanel should describe custody GeneratedForThisInstance in words rather than as an enum name
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  generated for this instance
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
src/models/Encryption/EncryptionKeyState.ts:49:28
 	NoDurableStore: "the key published with the product",
 	GeneratedForThisInstance: "generated for this instance",
 	SuppliedByConfiguration: "supplied by configuration",
-	SuppliedByExternalSecret: "supplied by a mounted secret file",
+	SuppliedByExternalSecret: "",
 };
 
killedBy: EncryptionPanel should describe custody SuppliedByExternalSecret in words rather than as an enum name
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  supplied by a mounted secret file
Received:


Ignored nodes: comments, script, style
