[Survived] ArrayDeclaration
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:25:31
 const DependenciesComponent: React.FC<DependenciesComponentProps> = ({
 	projectSettings,
 	onProjectSettingsChange,
-	additionalFieldDefinitions = [],
+	additionalFieldDefinitions = ["Stryker was here"],
 }) => {
 	const { getTerm } = useTerminology();

[Killed] BooleanLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:33:62
 	const portfolioTerm = getTerm(TERMINOLOGY_KEYS.PORTFOLIO);
 
 	return (
-		<InputGroup title="Dependency Settings" initiallyExpanded={false}>
+		<InputGroup title="Dependency Settings" initiallyExpanded={true}>
 			<Grid size={{ xs: 12 }}>
 				<FormSelectField
killedBy: DependenciesComponent keeps the group closed until it is asked for
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-expanded="false"
  aria-haspopup="listbox"
  class="MuiSelect-select MuiSelect-outlined MuiInputBase-input MuiOutlinedInput-input css-jbz0k-MuiNativeSelect-root-MuiSelect-select-MuiInputBase-input-MuiOutlinedInput-input"
  role="combobox"
  tabindex="0"

[Killed] LogicalOperator
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:38:7
 				<FormSelectField
 					label="Dependency Field"
 					value={
-						projectSettings?.dependencyOverrideAdditionalFieldDefinitionId ?? ""
+						projectSettings?.dependencyOverrideAdditionalFieldDefinitionId && ""
 					}
 					onChange={(value) => {
killedBy: DependenciesComponent lets the field be un-named again
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] OptionalChaining
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:38:7
 				<FormSelectField
 					label="Dependency Field"
 					value={
-						projectSettings?.dependencyOverrideAdditionalFieldDefinitionId ?? ""
+						projectSettings.dependencyOverrideAdditionalFieldDefinitionId ?? ""
 					}
 					onChange={(value) => {
killedBy: DependenciesComponent renders before there are any settings to show
statusReason: Cannot read properties of null (reading 'dependencyOverrideAdditionalFieldDefinitionId')

[Killed] BlockStatement
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:40:27
 					value={
 						projectSettings?.dependencyOverrideAdditionalFieldDefinitionId ?? ""
 					}
-					onChange={(value) => {
-						onProjectSettingsChange(
-							"dependencyOverrideAdditionalFieldDefinitionId",
-							value,
-						);
-					}}
+					onChange={(value) => {}}
 					options={additionalFieldDefinitions.map((field) => ({
 						id: field.id,
killedBy: DependenciesComponent reports which field was named
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:42:8
 					}
 					onChange={(value) => {
 						onProjectSettingsChange(
-							"dependencyOverrideAdditionalFieldDefinitionId",
+							"",
 							value,
 						);
killedBy: DependenciesComponent reports which field was named
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "dependencyOverrideAdditionalFieldDefinitionId",

[Killed] ArrowFunction
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:46:46
 							value,
 						);
 					}}
-					options={additionalFieldDefinitions.map((field) => ({
-						id: field.id,
-						label: field.displayName,
-					}))}
+					options={additionalFieldDefinitions.map(() => undefined)}
 				/>
 				<Typography variant="caption" color="text.secondary">
killedBy: DependenciesComponent offers the fields this connection defines, and nothing else
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:52:7
 					}))}
 				/>
 				<Typography variant="caption" color="text.secondary">
-					{`Read what each ${featureTerm} waits on from this field, separated by commas or semicolons, instead of from the links in your work tracking system.`}
+					{``}
 				</Typography>
 			</Grid>
killedBy: DependenciesComponent says what the field is expected to contain, beside the field
statusReason: 
Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Survived] ObjectLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:55:16
 					{`Read what each ${featureTerm} waits on from this field, separated by commas or semicolons, instead of from the links in your work tracking system.`}
 				</Typography>
 			</Grid>
-			<Grid size={{ xs: 12 }}>
+			<Grid size={{}}>
 				<FormControlLabel
 					control={

[Killed] LogicalOperator
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:59:17
 				<FormControlLabel
 					control={
 						<Switch
-							checked={projectSettings?.ignoreDependencies ?? false}
+							checked={projectSettings?.ignoreDependencies && false}
 							onChange={(event) =>
 								onProjectSettingsChange(
killedBy: DependenciesComponent shows the switch as on for a Portfolio that has set its dependencies aside
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  aria-label="Ignore Dependencies"
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"
  type="checkbox"

[Killed] BooleanLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:59:56
 				<FormControlLabel
 					control={
 						<Switch
-							checked={projectSettings?.ignoreDependencies ?? false}
+							checked={projectSettings?.ignoreDependencies ?? true}
 							onChange={(event) =>
 								onProjectSettingsChange(
killedBy: DependenciesComponent renders before there are any settings to show
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  aria-label="Ignore Dependencies"
  checked=""
  class="PrivateSwitchBase-input MuiSwitch-input css-12xagqm-MuiSwitchBase-root"
  role="switch"

[Killed] ArrowFunction
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:60:18
 					control={
 						<Switch
 							checked={projectSettings?.ignoreDependencies ?? false}
-							onChange={(event) =>
-								onProjectSettingsChange(
-									"ignoreDependencies",
-									event.target.checked,
-								)
+							onChange={() => undefined
 							}
 							slotProps={{ input: { "aria-label": "Ignore Dependencies" } }}
killedBy: DependenciesComponent reports when the dependencies are set aside, and when they are picked back up
statusReason: expected "vi.fn()" to be called with arguments: [ 'ignoreDependencies', true ]

Number of calls: 0

[Killed] StringLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:66:44
 									event.target.checked,
 								)
 							}
-							slotProps={{ input: { "aria-label": "Ignore Dependencies" } }}
+							slotProps={{ input: { "aria-label": "" } }}
 						/>
 					}
killedBy: DependenciesComponent starts with the dependencies being acted on
statusReason: Unable to find a label with the text of: Ignore Dependencies

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] StringLiteral
Common/ProjectSettings/Advanced/DependenciesComponent.tsx:69:13
 							slotProps={{ input: { "aria-label": "Ignore Dependencies" } }}
 						/>
 					}
-					label={`Ignore Dependencies (${featuresTerm} still show what they wait on, but this ${portfolioTerm} does not act on any of it)`}
+					label={``}
 				/>
 			</Grid>
killedBy: DependenciesComponent says the dependencies stay visible when they are set aside
statusReason: 
Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div
