[Killed] ArrowFunction
src/models/FeatureDependency.ts:36:14
 		.string()
 		.nullable()
 		.optional()
-		.transform((url) => url ?? null),
+		.transform(() => undefined),
 	source: z.enum(["TrackerLink", "PortfolioField"]),
 	notHonouredReason: z
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: expected { referenceId: 'FTR-9', …(5) } to deeply equal { referenceId: 'FTR-9', …(6) }

[Killed] LogicalOperator
src/models/FeatureDependency.ts:36:23
 		.string()
 		.nullable()
 		.optional()
-		.transform((url) => url ?? null),
+		.transform((url) => url && null),
 	source: z.enum(["TrackerLink", "PortfolioField"]),
 	notHonouredReason: z
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: expected { referenceId: 'FTR-9', …(5) } to deeply equal { referenceId: 'FTR-9', …(6) }

[Killed] StringLiteral
src/models/FeatureDependency.ts:37:18
 		.nullable()
 		.optional()
 		.transform((url) => url ?? null),
-	source: z.enum(["TrackerLink", "PortfolioField"]),
+	source: z.enum(["", "PortfolioField"]),
 	notHonouredReason: z
 		.enum(NOT_HONOURED_REASONS)
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: [
  {
    "code": "invalid_value",
    "values": [
      "",
      "PortfolioField"
    ],
    "path": [

[Killed] ArrowFunction
src/models/FeatureDependency.ts:42:14
 		.enum(NOT_HONOURED_REASONS)
 		.nullable()
 		.optional()
-		.transform((reason) => reason ?? null),
+		.transform(() => undefined),
 	blockerPositionedBelow: z.boolean().optional().default(false),
 	isWithheld: z.boolean().optional().default(false),
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: expected { referenceId: 'FTR-9', …(5) } to deeply equal { referenceId: 'FTR-9', …(6) }

[Killed] LogicalOperator
src/models/FeatureDependency.ts:42:26
 		.enum(NOT_HONOURED_REASONS)
 		.nullable()
 		.optional()
-		.transform((reason) => reason ?? null),
+		.transform((reason) => reason && null),
 	blockerPositionedBelow: z.boolean().optional().default(false),
 	isWithheld: z.boolean().optional().default(false),
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: expected { referenceId: 'FTR-9', …(5) } to deeply equal { referenceId: 'FTR-9', …(6) }

[Killed] BooleanLiteral
src/models/FeatureDependency.ts:43:57
 		.nullable()
 		.optional()
 		.transform((reason) => reason ?? null),
-	blockerPositionedBelow: z.boolean().optional().default(false),
+	blockerPositionedBelow: z.boolean().optional().default(true),
 	isWithheld: z.boolean().optional().default(false),
 });
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: expected { referenceId: 'FTR-9', …(6) } to deeply equal { referenceId: 'FTR-9', …(6) }

[Killed] BooleanLiteral
src/models/FeatureDependency.ts:44:45
 		.optional()
 		.transform((reason) => reason ?? null),
 	blockerPositionedBelow: z.boolean().optional().default(false),
-	isWithheld: z.boolean().optional().default(false),
+	isWithheld: z.boolean().optional().default(true),
 });
 
killedBy: FeatureDependencySchema reads a payload carrying only the required fields as an ordinary dependency
statusReason: expected { referenceId: 'FTR-9', …(6) } to deeply equal { referenceId: 'FTR-9', …(6) }

[Killed] ArrowFunction
src/models/FeatureDependency.ts:49:38
 
 // Nothing is wrong with a dependency when Lighthouse can act on it and it does not sit below the
 // Feature waiting on it. Asked here so the row and the warnings column cannot disagree about it.
-export const hasNothingWrongWithIt = (
-	dependency: IFeatureDependency,
-): boolean =>
-	dependency.notHonouredReason === null && !dependency.blockerPositionedBelow;
+export const hasNothingWrongWithIt = () => undefined;
 
 // A Portfolio that has set its dependencies aside made a choice; it did not break a link. Warning about
killedBy: hasNothingWrongWithIt holds only for a dependency with no reason against it and nothing odd about the order
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/models/FeatureDependency.ts:52:2
 export const hasNothingWrongWithIt = (
 	dependency: IFeatureDependency,
 ): boolean =>
-	dependency.notHonouredReason === null && !dependency.blockerPositionedBelow;
+	false;
 
 // A Portfolio that has set its dependencies aside made a choice; it did not break a link. Warning about
killedBy: WarningsIndicator dependency warnings still shows the all-clear when a dependency has nothing wrong with it
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Feature depends on Warehouse sync, which sits below it in the order."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] ConditionalExpression
src/models/FeatureDependency.ts:52:2
 export const hasNothingWrongWithIt = (
 	dependency: IFeatureDependency,
 ): boolean =>
-	dependency.notHonouredReason === null && !dependency.blockerPositionedBelow;
+	true;
 
 // A Portfolio that has set its dependencies aside made a choice; it did not break a link. Warning about
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="No warnings"
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] ArrowFunction
src/models/FeatureDependency.ts:57:27
 // A Portfolio that has set its dependencies aside made a choice; it did not break a link. Warning about
 // every Feature in it would teach the reader to stop looking at a column built to be worth looking at,
 // so this is the one reason that says nothing on the row and says it on the entry instead.
-export const isSetAside = (dependency: IFeatureDependency): boolean =>
-	dependency.notHonouredReason === "IgnoredByPortfolio";
+export const isSetAside = () => undefined;
 
 export const isWorthWarningAbout = (dependency: IFeatureDependency): boolean =>
killedBy: isSetAside holds for the one reason that is a choice rather than a fault
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/models/FeatureDependency.ts:58:2
 // every Feature in it would teach the reader to stop looking at a column built to be worth looking at,
 // so this is the one reason that says nothing on the row and says it on the entry instead.
 export const isSetAside = (dependency: IFeatureDependency): boolean =>
-	dependency.notHonouredReason === "IgnoredByPortfolio";
+	false;
 
 export const isWorthWarningAbout = (dependency: IFeatureDependency): boolean =>
killedBy: WarningsIndicator dependency warnings says nothing at all about a dependency the Portfolio set aside
statusReason: Unable to find an element by: [data-testid="no-warnings"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="This Portfolio is set to ignore its dependencies, so the wait on Warehouse sync is not acted on. Nothing has been deleted."
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] EqualityOperator
src/models/FeatureDependency.ts:58:2
 // every Feature in it would teach the reader to stop looking at a column built to be worth looking at,
 // so this is the one reason that says nothing on the row and says it on the entry instead.
 export const isSetAside = (dependency: IFeatureDependency): boolean =>
-	dependency.notHonouredReason === "IgnoredByPortfolio";
+	dependency.notHonouredReason !== "IgnoredByPortfolio";
 
 export const isWorthWarningAbout = (dependency: IFeatureDependency): boolean =>
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="No warnings"
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] ArrowFunction
src/models/FeatureDependency.ts:60:36
 export const isSetAside = (dependency: IFeatureDependency): boolean =>
 	dependency.notHonouredReason === "IgnoredByPortfolio";
 
-export const isWorthWarningAbout = (dependency: IFeatureDependency): boolean =>
-	!isSetAside(dependency) && !hasNothingWrongWithIt(dependency);
+export const isWorthWarningAbout = () => undefined;
 
killedBy: isWorthWarningAbout says nothing about a dependency that is fine, or one somebody set aside
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/models/FeatureDependency.ts:61:2
 	dependency.notHonouredReason === "IgnoredByPortfolio";
 
 export const isWorthWarningAbout = (dependency: IFeatureDependency): boolean =>
-	!isSetAside(dependency) && !hasNothingWrongWithIt(dependency);
+	false;
 
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="No warnings"
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"

[Killed] BooleanLiteral
src/models/FeatureDependency.ts:61:2
 	dependency.notHonouredReason === "IgnoredByPortfolio";
 
 export const isWorthWarningAbout = (dependency: IFeatureDependency): boolean =>
-	!isSetAside(dependency) && !hasNothingWrongWithIt(dependency);
+	isSetAside(dependency) && !hasNothingWrongWithIt(dependency);
 
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: Unable to find an element by: [data-testid="warning-dependency-in-a-loop"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-label="No warnings"
      class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeSmall css-lk7kvc-MuiButtonBase-root-MuiIconButton-root"
