[Killed] ArrowFunction
src/utils/dependencies/dependencySentences.ts:19:29
 
 const LEFT_OUT = "That dependency is not included in the forecast.";
 
-export const withheldName = (terms: DependencyTerms): string =>
-	`a ${terms.featureTerm} you do not have access to`;
+export const withheldName = () => undefined;
 
 // Asked only about a dependency that has a reason against it, so there is no "nothing to say" case
killedBy: WarningsIndicator dependency warnings says something is waited on without naming it when it is withheld
statusReason: expected 'This Feature depends on undefined, wh…' to contain 'a Feature you do not have access to'

[Killed] BlockStatement
src/utils/dependencies/dependencySentences.ts:28:14
 	reason: NotHonouredReason,
 	waitedOn: string,
 	terms: DependencyTerms,
-): string => {
-	if (reason === "OutsideThisPortfolio") {
-		return `This ${terms.featureTerm} depends on ${waitedOn}, which is in no ${terms.portfolioTerm} they share. ${LEFT_OUT}`;
-	}
-
-	if (reason === "InALoop") {
-		return `This ${terms.featureTerm} and ${waitedOn} are waiting on each other. ${LEFT_OUT}`;
-	}
-
-	if (reason === "IgnoredByPortfolio") {
-		return `This ${terms.portfolioTerm} is set to ignore its dependencies, so the wait on ${waitedOn} is not acted on. Nothing has been deleted.`;
-	}
-
-	return `${waitedOn} has no measured delivery to forecast from, so the wait cannot be given a date. ${LEFT_OUT}`;
-};
+): string => {};
 
 /** The one thing worth saying about a dependency that is no reason to leave it out of the forecast. */
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: 
Expected the element to have attribute:
  aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
Received:
  null

[Killed] BlockStatement
src/utils/dependencies/dependencySentences.ts:29:41
 	waitedOn: string,
 	terms: DependencyTerms,
 ): string => {
-	if (reason === "OutsideThisPortfolio") {
-		return `This ${terms.featureTerm} depends on ${waitedOn}, which is in no ${terms.portfolioTerm} they share. ${LEFT_OUT}`;
-	}
+	if (reason === "OutsideThisPortfolio") {}
 
 	if (reason === "InALoop") {
killedBy: reasonSentence says something different for every reason there is
statusReason: expected 3 to be 4 // Object.is equality

[Killed] EqualityOperator
src/utils/dependencies/dependencySentences.ts:29:6
 	waitedOn: string,
 	terms: DependencyTerms,
 ): string => {
-	if (reason === "OutsideThisPortfolio") {
+	if (reason !== "OutsideThisPortfolio") {
 		return `This ${terms.featureTerm} depends on ${waitedOn}, which is in no ${terms.portfolioTerm} they share. ${LEFT_OUT}`;
 	}
killedBy: WarningsIndicator dependency warnings says the same thing on hover as it says to a screen reader
statusReason: 
Expected the element to have attribute:
  aria-label="This Feature and Warehouse sync are waiting on each other. That dependency is not included in the forecast."
Received:
  aria-label="This Feature depends on Warehouse sync, which is in no Portfolio they share. That dependency is not included in the forecast."

[Killed] ConditionalExpression
src/utils/dependencies/dependencySentences.ts:33:6
 		return `This ${terms.featureTerm} depends on ${waitedOn}, which is in no ${terms.portfolioTerm} they share. ${LEFT_OUT}`;
 	}
 
-	if (reason === "InALoop") {
+	if (false) {
 		return `This ${terms.featureTerm} and ${waitedOn} are waiting on each other. ${LEFT_OUT}`;
 	}
killedBy: reasonSentence says something different for every reason there is
statusReason: expected 3 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/utils/dependencies/dependencySentences.ts:33:6
 		return `This ${terms.featureTerm} depends on ${waitedOn}, which is in no ${terms.portfolioTerm} they share. ${LEFT_OUT}`;
 	}
 
-	if (reason === "InALoop") {
+	if (true) {
 		return `This ${terms.featureTerm} and ${waitedOn} are waiting on each other. ${LEFT_OUT}`;
 	}
killedBy: reasonSentence says something different for every reason there is
statusReason: expected 2 to be 4 // Object.is equality

[Killed] StringLiteral
src/utils/dependencies/dependencySentences.ts:34:10
 	}
 
 	if (reason === "InALoop") {
-		return `This ${terms.featureTerm} and ${waitedOn} are waiting on each other. ${LEFT_OUT}`;
+		return ``;
 	}
 
killedBy: reasonSentence says two Features waiting on each other are left out of the forecast
statusReason: expected '' to be 'This Feature and Warehouse sync are w…' // Object.is equality

[Killed] EqualityOperator
src/utils/dependencies/dependencySentences.ts:37:6
 		return `This ${terms.featureTerm} and ${waitedOn} are waiting on each other. ${LEFT_OUT}`;
 	}
 
-	if (reason === "IgnoredByPortfolio") {
+	if (reason !== "IgnoredByPortfolio") {
 		return `This ${terms.portfolioTerm} is set to ignore its dependencies, so the wait on ${waitedOn} is not acted on. Nothing has been deleted.`;
 	}
killedBy: reasonSentence says a Feature with nothing measured behind it cannot be given a date
statusReason: expected 'This Portfolio is set to ignore its d…' to be 'Warehouse sync has no measured delive…' // Object.is equality

[Killed] ConditionalExpression
src/utils/dependencies/dependencySentences.ts:37:6
 		return `This ${terms.featureTerm} and ${waitedOn} are waiting on each other. ${LEFT_OUT}`;
 	}
 
-	if (reason === "IgnoredByPortfolio") {
+	if (false) {
 		return `This ${terms.portfolioTerm} is set to ignore its dependencies, so the wait on ${waitedOn} is not acted on. Nothing has been deleted.`;
 	}
killedBy: reasonSentence says something different for every reason there is
statusReason: expected 3 to be 4 // Object.is equality

[Killed] StringLiteral
src/utils/dependencies/dependencySentences.ts:38:10
 	}
 
 	if (reason === "IgnoredByPortfolio") {
-		return `This ${terms.portfolioTerm} is set to ignore its dependencies, so the wait on ${waitedOn} is not acted on. Nothing has been deleted.`;
+		return ``;
 	}
 
killedBy: reasonSentence says a dependency set aside is not acted on and has not been deleted
statusReason: expected '' to be 'This Portfolio is set to ignore its d…' // Object.is equality

[Killed] ArrowFunction
src/utils/dependencies/dependencySentences.ts:45:40
 };
 
 /** The one thing worth saying about a dependency that is no reason to leave it out of the forecast. */
-export const positionedBelowSentence = (
-	waitedOn: string,
-	terms: DependencyTerms,
-): string =>
-	`This ${terms.featureTerm} depends on ${waitedOn}, which sits below it in the order.`;
+export const positionedBelowSentence = () => undefined;
 
killedBy: positionedBelowSentence says where the Feature waited on sits, and nothing about leaving it out
statusReason: expected undefined to be 'This Feature depends on Warehouse syn…' // Object.is equality

[Killed] StringLiteral
src/utils/dependencies/dependencySentences.ts:49:2
 	waitedOn: string,
 	terms: DependencyTerms,
 ): string =>
-	`This ${terms.featureTerm} depends on ${waitedOn}, which sits below it in the order.`;
+	``;
 
killedBy: positionedBelowSentence says where the Feature waited on sits, and nothing about leaving it out
statusReason: expected '' to be 'This Feature depends on Warehouse syn…' // Object.is equality
