[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:85:37
 export const MANUAL_SELECTION_TAB_KEY = "manual";
 export const RULE_BASED_SELECTION_TAB_KEY = "rules";
 
-export const emptySelectionValues = (): DeliverySelectionValues => ({
-	selectedFeatureIds: [],
-	rules: [],
-	mode: "and",
-	sourceReference: null,
-	publishForecastToSource: false,
-});
+export const emptySelectionValues = () => undefined;
 
 const valuesFromDelivery = (delivery: IDelivery): DeliverySelectionValues => ({
killedBy: a selection nobody has made yet starts with nothing chosen, no rules, rules that would all have to match, and nothing followed
statusReason: expected undefined to deeply equal { selectedFeatureIds: [], …(4) }

[Killed] ArrayDeclaration
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:86:22
 export const RULE_BASED_SELECTION_TAB_KEY = "rules";
 
 export const emptySelectionValues = (): DeliverySelectionValues => ({
-	selectedFeatureIds: [],
+	selectedFeatureIds: ["Stryker was here"],
 	rules: [],
 	mode: "and",
killedBy: a selection nobody has made yet starts with nothing chosen, no rules, rules that would all have to match, and nothing followed
statusReason: expected { …(5) } to deeply equal { selectedFeatureIds: [], …(4) }

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:90:27
 	rules: [],
 	mode: "and",
 	sourceReference: null,
-	publishForecastToSource: false,
+	publishForecastToSource: true,
 });
 
killedBy: a selection nobody has made yet starts with nothing chosen, no rules, rules that would all have to match, and nothing followed
statusReason: expected { selectedFeatureIds: [], …(4) } to deeply equal { selectedFeatureIds: [], …(4) }

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:93:28
 	publishForecastToSource: false,
 });
 
-const valuesFromDelivery = (delivery: IDelivery): DeliverySelectionValues => ({
-	selectedFeatureIds: delivery.features ?? [],
-	rules:
-		delivery.rules?.map((rule) => ({
-			fieldKey: rule.fieldKey,
-			operator: rule.operator,
-			value: rule.value,
-		})) ?? [],
-	mode: delivery.mode === "or" ? "or" : "and",
-	sourceReference: delivery.sourceReference ?? null,
-	publishForecastToSource: delivery.publishForecastToSource ?? false,
-});
+const valuesFromDelivery = () => undefined;
 
 /**
killedBy: DeliveryCreateModal editing a Launch that follows a Release shows what it follows and saves it back untouched when 'the Release is still on the offered l…'
statusReason: Cannot read properties of undefined (reading 'selectedFeatureIds')

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:94:22
 });
 
 const valuesFromDelivery = (delivery: IDelivery): DeliverySelectionValues => ({
-	selectedFeatureIds: delivery.features ?? [],
+	selectedFeatureIds: delivery.features && [],
 	rules:
 		delivery.rules?.map((rule) => ({
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ArrayDeclaration
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:94:43
 });
 
 const valuesFromDelivery = (delivery: IDelivery): DeliverySelectionValues => ({
-	selectedFeatureIds: delivery.features ?? [],
+	selectedFeatureIds: delivery.features ?? ["Stryker was here"],
 	rules:
 		delivery.rules?.map((rule) => ({
killedBy: reopening the form on a stored delivery reads a delivery stored before rules existed as one with nothing chosen and no rules
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] OptionalChaining
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:96:3
 const valuesFromDelivery = (delivery: IDelivery): DeliverySelectionValues => ({
 	selectedFeatureIds: delivery.features ?? [],
 	rules:
-		delivery.rules?.map((rule) => ({
+		delivery.rules.map((rule) => ({
 			fieldKey: rule.fieldKey,
 			operator: rule.operator,
killedBy: reopening the form on a stored delivery reads a delivery stored before rules existed as one with nothing chosen and no rules
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:96:3
 const valuesFromDelivery = (delivery: IDelivery): DeliverySelectionValues => ({
 	selectedFeatureIds: delivery.features ?? [],
 	rules:
-		delivery.rules?.map((rule) => ({
-			fieldKey: rule.fieldKey,
-			operator: rule.operator,
-			value: rule.value,
-		})) ?? [],
+		delivery.rules?.map(rule => ({
+  fieldKey: rule.fieldKey,
+  operator: rule.operator,
+  value: rule.value
+})) && [],
 	mode: delivery.mode === "or" ? "or" : "and",
 	sourceReference: delivery.sourceReference ?? null,
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: expected [] to deeply equal [ { fieldKey: 'fixVersion', …(2) } ]

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:101:8
 			operator: rule.operator,
 			value: rule.value,
 		})) ?? [],
-	mode: delivery.mode === "or" ? "or" : "and",
+	mode: true ? "or" : "and",
 	sourceReference: delivery.sourceReference ?? null,
 	publishForecastToSource: delivery.publishForecastToSource ?? false,
killedBy: reopening the form on a stored delivery treats any stored combination other than 'or' as all-must-match
statusReason: expected 'or' to be 'and' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:101:8
 			operator: rule.operator,
 			value: rule.value,
 		})) ?? [],
-	mode: delivery.mode === "or" ? "or" : "and",
+	mode: false ? "or" : "and",
 	sourceReference: delivery.sourceReference ?? null,
 	publishForecastToSource: delivery.publishForecastToSource ?? false,
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: expected 'and' to be 'or' // Object.is equality

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:102:19
 			value: rule.value,
 		})) ?? [],
 	mode: delivery.mode === "or" ? "or" : "and",
-	sourceReference: delivery.sourceReference ?? null,
+	sourceReference: delivery.sourceReference && null,
 	publishForecastToSource: delivery.publishForecastToSource ?? false,
 });
killedBy: DeliveryCreateModal editing a Launch that follows a Release shows what it follows and saves it back untouched when 'the Release is still on the offered l…'
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 42, …(10) } ]

Number of calls: 0

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:103:63
 		})) ?? [],
 	mode: delivery.mode === "or" ? "or" : "and",
 	sourceReference: delivery.sourceReference ?? null,
-	publishForecastToSource: delivery.publishForecastToSource ?? false,
+	publishForecastToSource: delivery.publishForecastToSource ?? true,
 });
 
killedBy: DeliveryCreateModal editing a Launch that follows a Release shows what it follows and saves it back untouched when 'the Release is still on the offered l…'
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 42, …(10) } ]

Received:

  1st vi.fn() call:

@@ -2,14 +2,12 @@
    {

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:103:27
 		})) ?? [],
 	mode: delivery.mode === "or" ? "or" : "and",
 	sourceReference: delivery.sourceReference ?? null,
-	publishForecastToSource: delivery.publishForecastToSource ?? false,
+	publishForecastToSource: delivery.publishForecastToSource && false,
 });
 
killedBy: DeliveryCreateModal editing a Launch that follows a Release shows what it follows and saves it back untouched when 'the Release is still on the offered l…'
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 42, …(10) } ]

Received:

  1st vi.fn() call:

@@ -2,14 +2,12 @@
    {

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:111:27
  * sends the number, so comparing a stored delivery against the enum member alone matches nothing
  * that ever came off the wire, and every bound delivery would read as a hand-picked one.
  */
-export const isStoredAs = (
-	delivery: IDelivery,
-	mode: DeliverySelectionMode,
-): boolean =>
-	delivery.selectionMode === mode ||
-	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
+export const isStoredAs = () => undefined;
 
 export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
killedBy: DeliveryCreateModal editing a Launch that follows a Release shows what it follows and saves it back untouched when 'the Release is still on the offered l…'
statusReason: expected null to be 'Release 44 (Project X)' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:115:2
 	delivery: IDelivery,
 	mode: DeliverySelectionMode,
 ): boolean =>
-	delivery.selectionMode === mode ||
-	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
+	false;
 
 export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
killedBy: DeliveryCreateModal editing a Launch that follows a Release shows what it follows and saves it back untouched when 'the Release is still on the offered l…'
statusReason: expected null to be 'Release 44 (Project X)' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:115:2
 	delivery: IDelivery,
 	mode: DeliverySelectionMode,
 ): boolean =>
-	delivery.selectionMode === mode ||
+	false ||
 	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
 
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: expected 'manual' to be 'rules' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:116:2
 	mode: DeliverySelectionMode,
 ): boolean =>
 	delivery.selectionMode === mode ||
-	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
+	false;
 
 export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
killedBy: which tab a delivery that follows a source reopens on recognises it from 'the name the server sends'
statusReason: expected 'manual' to be 'source:jira-release' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:116:2
 	mode: DeliverySelectionMode,
 ): boolean =>
 	delivery.selectionMode === mode ||
-	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
+	delivery.selectionMode as unknown as string !== DeliverySelectionMode[mode];
 
 export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
killedBy: which tab a stored delivery reopens on opens manual for one with neither
statusReason: expected 'rules' to be 'manual' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:118:33
 	delivery.selectionMode === mode ||
 	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
 
-export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
-	!rule.fieldKey.trim() || !rule.operator.trim() || !rule.value.trim();
+export const isIncompleteRule = () => undefined;
 
 /** What is wrong with the rules as typed, before anyone asks the backend to match them. */
killedBy: a rule the reader has only half typed counts as complete when the field, the operator and the value all carry something
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:119:27
 	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
 
 export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
-	!rule.fieldKey.trim() || !rule.operator.trim() || !rule.value.trim();
+	!rule.fieldKey.trim() || rule.operator.trim() || !rule.value.trim();
 
 /** What is wrong with the rules as typed, before anyone asks the backend to match them. */
killedBy: a rule the reader has only half typed counts as complete when the field, the operator and the value all carry something
statusReason: expected 'equals' to be false // Object.is equality

[Killed] MethodExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:119:53
 	(delivery.selectionMode as unknown as string) === DeliverySelectionMode[mode];
 
 export const isIncompleteRule = (rule: IWorkItemRuleCondition): boolean =>
-	!rule.fieldKey.trim() || !rule.operator.trim() || !rule.value.trim();
+	!rule.fieldKey.trim() || !rule.operator.trim() || !rule.value;
 
 /** What is wrong with the rules as typed, before anyone asks the backend to match them. */
killedBy: a rule the reader has only half typed counts as incomplete when any one of the three holds nothing but spaces
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:124:21
 /** What is wrong with the rules as typed, before anyone asks the backend to match them. */
 export const ruleInputError = (
 	rules: IWorkItemRuleCondition[],
-): string | null => {
-	if (rules.length === 0) {
-		return "At least one rule must be defined";
-	}
-
-	if (rules.some(isIncompleteRule)) {
-		return "All rule fields must be completed";
-	}
-
-	return null;
-};
+): string | null => {};
 
 const manualBlockingError = (
killedBy: what is wrong with the rules before the backend is asked to match them asks for a rule when there is not one yet
statusReason: expected undefined to be 'At least one rule must be defined' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:125:6
 export const ruleInputError = (
 	rules: IWorkItemRuleCondition[],
 ): string | null => {
-	if (rules.length === 0) {
+	if (false) {
 		return "At least one rule must be defined";
 	}
killedBy: what is wrong with the rules before the backend is asked to match them asks for a rule when there is not one yet
statusReason: expected null to be 'At least one rule must be defined' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:125:26
 export const ruleInputError = (
 	rules: IWorkItemRuleCondition[],
 ): string | null => {
-	if (rules.length === 0) {
-		return "At least one rule must be defined";
-	}
+	if (rules.length === 0) {}
 
 	if (rules.some(isIncompleteRule)) {
killedBy: what is wrong with the rules before the backend is asked to match them asks for a rule when there is not one yet
statusReason: expected null to be 'At least one rule must be defined' // Object.is equality

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:126:10
 	rules: IWorkItemRuleCondition[],
 ): string | null => {
 	if (rules.length === 0) {
-		return "At least one rule must be defined";
+		return "";
 	}
 
killedBy: what is wrong with the rules before the backend is asked to match them asks for a rule when there is not one yet
statusReason: expected '' to be 'At least one rule must be defined' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:129:36
 		return "At least one rule must be defined";
 	}
 
-	if (rules.some(isIncompleteRule)) {
-		return "All rule fields must be completed";
-	}
+	if (rules.some(isIncompleteRule)) {}
 
 	return null;
killedBy: what is wrong with the rules before the backend is asked to match them asks for the gaps to be filled when one rule of several is half typed
statusReason: expected null to be 'All rule fields must be completed' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:129:6
 		return "At least one rule must be defined";
 	}
 
-	if (rules.some(isIncompleteRule)) {
+	if (false) {
 		return "All rule fields must be completed";
 	}
killedBy: what is wrong with the rules before the backend is asked to match them asks for the gaps to be filled when one rule of several is half typed
statusReason: expected null to be 'All rule fields must be completed' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:136:29
 	return null;
 };
 
-const manualBlockingError = (
-	state: DeliverySelectionState,
-	terms: DeliverySelectionTerms,
-): string | null =>
-	state.selectedFeatureIds.length === 0
-		? `At least one ${terms.featureTerm.toLowerCase()} must be selected`
-		: null;
+const manualBlockingError = () => undefined;
 
 const ruleBasedBlockingError = (
killedBy: the manual tab blocks saving until something is chosen, in the tenant's own word for it
statusReason: expected undefined to be 'At least one deliverable must be sele…' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:140:2
 	state: DeliverySelectionState,
 	terms: DeliverySelectionTerms,
 ): string | null =>
-	state.selectedFeatureIds.length === 0
+	true
 		? `At least one ${terms.featureTerm.toLowerCase()} must be selected`
 		: null;
killedBy: the manual tab stops blocking once something is chosen
statusReason: expected 'At least one deliverable must be sele…' to be null

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:140:2
 	state: DeliverySelectionState,
 	terms: DeliverySelectionTerms,
 ): string | null =>
-	state.selectedFeatureIds.length === 0
+	state.selectedFeatureIds.length !== 0
 		? `At least one ${terms.featureTerm.toLowerCase()} must be selected`
 		: null;
killedBy: the manual tab blocks saving until something is chosen, in the tenant's own word for it
statusReason: expected null to be 'At least one deliverable must be sele…' // Object.is equality

[Killed] MethodExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:141:21
 	terms: DeliverySelectionTerms,
 ): string | null =>
 	state.selectedFeatureIds.length === 0
-		? `At least one ${terms.featureTerm.toLowerCase()} must be selected`
+		? `At least one ${terms.featureTerm.toUpperCase()} must be selected`
 		: null;
 
killedBy: the manual tab blocks saving until something is chosen, in the tenant's own word for it
statusReason: expected 'At least one DELIVERABLE must be sele…' to be 'At least one deliverable must be sele…' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:146:21
 
 const ruleBasedBlockingError = (
 	state: DeliverySelectionState,
-): string | null => {
-	if (!state.rulesValidated) {
-		return "Rules must be validated before saving";
-	}
-
-	if (state.matchedFeaturesLength === 0) {
-		return "No features match the rules";
-	}
-
-	return null;
-};
+): string | null => {};
 
 const manualTab: DeliverySelectionTab = {
killedBy: the rule-based tab blocks saving until the rules have been matched
statusReason: expected undefined to be 'Rules must be validated before saving' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:147:29
 const ruleBasedBlockingError = (
 	state: DeliverySelectionState,
 ): string | null => {
-	if (!state.rulesValidated) {
-		return "Rules must be validated before saving";
-	}
+	if (!state.rulesValidated) {}
 
 	if (state.matchedFeaturesLength === 0) {
killedBy: the rule-based tab blocks saving until the rules have been matched
statusReason: expected 'No features match the rules' to be 'Rules must be validated before saving' // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:147:6
 const ruleBasedBlockingError = (
 	state: DeliverySelectionState,
 ): string | null => {
-	if (!state.rulesValidated) {
+	if (state.rulesValidated) {
 		return "Rules must be validated before saving";
 	}
killedBy: the rule-based tab blocks saving until the rules have been matched
statusReason: expected 'No features match the rules' to be 'Rules must be validated before saving' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:151:41
 		return "Rules must be validated before saving";
 	}
 
-	if (state.matchedFeaturesLength === 0) {
-		return "No features match the rules";
-	}
+	if (state.matchedFeaturesLength === 0) {}
 
 	return null;
killedBy: the rule-based tab blocks saving when the rules were matched and matched nothing
statusReason: expected null to be 'No features match the rules' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:151:6
 		return "Rules must be validated before saving";
 	}
 
-	if (state.matchedFeaturesLength === 0) {
+	if (true) {
 		return "No features match the rules";
 	}
killedBy: the rule-based tab stops blocking once the rules have matched something
statusReason: expected 'No features match the rules' to be null

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:152:10
 	}
 
 	if (state.matchedFeaturesLength === 0) {
-		return "No features match the rules";
+		return "";
 	}
 
killedBy: the rule-based tab blocks saving when the rules were matched and matched nothing
statusReason: expected '' to be 'No features match the rules' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:164:33
 	mode: DeliverySelectionMode.Manual,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: manualBlockingError,
-	fieldErrors: (state, terms) => {
-		const features = manualBlockingError(state, terms);
-		return features === null ? {} : { features };
-	},
+	fieldErrors: (state, terms) => {},
 	toPayload: (state) => ({ featureIds: state.selectedFeatureIds }),
 };
killedBy: the manual tab puts that same complaint on the field it is about, and takes it away again
statusReason: expected undefined to deeply equal { Object (features) }

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:166:10
 	firstBlockingError: manualBlockingError,
 	fieldErrors: (state, terms) => {
 		const features = manualBlockingError(state, terms);
-		return features === null ? {} : { features };
+		return false ? {} : { features };
 	},
 	toPayload: (state) => ({ featureIds: state.selectedFeatureIds }),
killedBy: the manual tab puts that same complaint on the field it is about, and takes it away again
statusReason: expected { features: null } to deeply equal {}

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:166:10
 	firstBlockingError: manualBlockingError,
 	fieldErrors: (state, terms) => {
 		const features = manualBlockingError(state, terms);
-		return features === null ? {} : { features };
+		return features !== null ? {} : { features };
 	},
 	toPayload: (state) => ({ featureIds: state.selectedFeatureIds }),
killedBy: the manual tab puts that same complaint on the field it is about, and takes it away again
statusReason: expected {} to deeply equal { Object (features) }

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:168:13
 		const features = manualBlockingError(state, terms);
 		return features === null ? {} : { features };
 	},
-	toPayload: (state) => ({ featureIds: state.selectedFeatureIds }),
+	toPayload: () => undefined,
 };
 
killedBy: the manual tab writes down what was chosen and nothing else
statusReason: expected undefined to deeply equal { featureIds: [ 3, 4 ] }

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:168:25
 		const features = manualBlockingError(state, terms);
 		return features === null ? {} : { features };
 	},
-	toPayload: (state) => ({ featureIds: state.selectedFeatureIds }),
+	toPayload: (state) => ({}),
 };
 
killedBy: the manual tab writes down what was chosen and nothing else
statusReason: expected {} to deeply equal { featureIds: [ 3, 4 ] }

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:177:15
 	key: RULE_BASED_SELECTION_TAB_KEY,
 	label: "Rule-Based",
 	mode: DeliverySelectionMode.RuleBased,
-	premiumGate: {
-		whenLocked: "lockTab",
-		notice: `Rule-based ${terms.deliveryTerm.toLowerCase()} selection is a premium feature. Please upgrade your license to use this functionality.`,
-		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
-	},
+	premiumGate: {},
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.RuleBased) ||
killedBy: what a licence that does not cover a tab says locks the rule-based tab, and the tooltip on the locked button says how to unlock it
statusReason: expected undefined to be 'lockTab' // Object.is equality

[Killed] MethodExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:179:25
 	mode: DeliverySelectionMode.RuleBased,
 	premiumGate: {
 		whenLocked: "lockTab",
-		notice: `Rule-based ${terms.deliveryTerm.toLowerCase()} selection is a premium feature. Please upgrade your license to use this functionality.`,
+		notice: `Rule-based ${terms.deliveryTerm.toUpperCase()} selection is a premium feature. Please upgrade your license to use this functionality.`,
 		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
 	},
killedBy: what a licence that does not cover a tab says locks the rule-based tab, and the tooltip on the locked button says how to unlock it
statusReason: expected 'Rule-based LAUNCH selection is a prem…' to be 'Rule-based launch selection is a prem…' // Object.is equality

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:179:11
 	mode: DeliverySelectionMode.RuleBased,
 	premiumGate: {
 		whenLocked: "lockTab",
-		notice: `Rule-based ${terms.deliveryTerm.toLowerCase()} selection is a premium feature. Please upgrade your license to use this functionality.`,
+		notice: ``,
 		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
 	},
killedBy: what a licence that does not cover a tab says locks the rule-based tab, and the tooltip on the locked button says how to unlock it
statusReason: expected '' to be 'Rule-based launch selection is a prem…' // Object.is equality

[Killed] MethodExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:180:74
 	premiumGate: {
 		whenLocked: "lockTab",
 		notice: `Rule-based ${terms.deliveryTerm.toLowerCase()} selection is a premium feature. Please upgrade your license to use this functionality.`,
-		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
+		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toUpperCase()}.`,
 	},
 	claims: (delivery) =>
killedBy: what a licence that does not cover a tab says locks the rule-based tab, and the tooltip on the locked button says how to unlock it
statusReason: expected 'Please obtain a premium license to us…' to be 'Please obtain a premium license to us…' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:182:10
 		notice: `Rule-based ${terms.deliveryTerm.toLowerCase()} selection is a premium feature. Please upgrade your license to use this functionality.`,
 		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
 	},
-	claims: (delivery) =>
-		isStoredAs(delivery, DeliverySelectionMode.RuleBased) ||
-		(delivery.rules?.length ?? 0) > 0,
+	claims: () => undefined,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: expected 'manual' to be 'rules' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:183:3
 		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
 	},
 	claims: (delivery) =>
-		isStoredAs(delivery, DeliverySelectionMode.RuleBased) ||
-		(delivery.rules?.length ?? 0) > 0,
+		false,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: expected 'manual' to be 'rules' // Object.is equality

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:183:3
 		tooltipExtraInfo: `Please obtain a premium license to use rule-based ${terms.deliveriesTerm.toLowerCase()}.`,
 	},
 	claims: (delivery) =>
-		isStoredAs(delivery, DeliverySelectionMode.RuleBased) ||
-		(delivery.rules?.length ?? 0) > 0,
+		isStoredAs(delivery, DeliverySelectionMode.RuleBased) && (delivery.rules?.length ?? 0) > 0,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: expected 'manual' to be 'rules' // Object.is equality
