[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:184:3
 	},
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.RuleBased) ||
-		(delivery.rules?.length ?? 0) > 0,
+		(delivery.rules?.length ?? 0) <= 0,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
killedBy: which tab a stored delivery reopens on opens rule-based for one carrying rules but stored before the mode was written down
statusReason: expected 'manual' to be 'rules' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:184:3
 	},
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.RuleBased) ||
-		(delivery.rules?.length ?? 0) > 0,
+		(delivery.rules?.length ?? 0) >= 0,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
killedBy: which tab a stored delivery reopens on opens manual for one with neither
statusReason: expected 'rules' to be 'manual' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:187:26
 		(delivery.rules?.length ?? 0) > 0,
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
-	fieldErrors: (state) => {
-		const rules = ruleInputError(state.rules) ?? ruleBasedBlockingError(state);
-		return rules === null ? {} : { rules };
-	},
+	fieldErrors: (state) => {},
 	toPayload: (state) => ({
 		featureIds: state.selectedFeatureIds,
killedBy: the rule-based tab complains about what was typed before it complains about what was matched
statusReason: expected undefined to deeply equal { Object (rules) }

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:188:17
 	hydrate: valuesFromDelivery,
 	firstBlockingError: ruleBasedBlockingError,
 	fieldErrors: (state) => {
-		const rules = ruleInputError(state.rules) ?? ruleBasedBlockingError(state);
+		const rules = ruleInputError(state.rules) && ruleBasedBlockingError(state);
 		return rules === null ? {} : { rules };
 	},
killedBy: the rule-based tab complains about what was typed before it complains about what was matched
statusReason: expected { Object (rules) } to deeply equal { Object (rules) }

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:189:10
 	firstBlockingError: ruleBasedBlockingError,
 	fieldErrors: (state) => {
 		const rules = ruleInputError(state.rules) ?? ruleBasedBlockingError(state);
-		return rules === null ? {} : { rules };
+		return false ? {} : { rules };
 	},
 	toPayload: (state) => ({
killedBy: the rule-based tab leaves the field clean when the rules are filled in and have matched
statusReason: expected { rules: null } to deeply equal {}

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:189:10
 	firstBlockingError: ruleBasedBlockingError,
 	fieldErrors: (state) => {
 		const rules = ruleInputError(state.rules) ?? ruleBasedBlockingError(state);
-		return rules === null ? {} : { rules };
+		return rules !== null ? {} : { rules };
 	},
 	toPayload: (state) => ({
killedBy: the rule-based tab complains about what was typed before it complains about what was matched
statusReason: expected {} to deeply equal { Object (rules) }

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:191:13
 		const rules = ruleInputError(state.rules) ?? ruleBasedBlockingError(state);
 		return rules === null ? {} : { rules };
 	},
-	toPayload: (state) => ({
-		featureIds: state.selectedFeatureIds,
-		rules: state.rules,
-		mode: state.mode,
-	}),
+	toPayload: () => undefined,
 });
 
killedBy: the rule-based tab writes down the rules and how they combine, not only what was matched
statusReason: expected undefined to deeply equal { featureIds: [ 5 ], …(2) }

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:198:30
 	}),
 });
 
-const builtInSelectionTabs = (
-	terms: DeliverySelectionTerms,
-): DeliverySelectionTab[] => [manualTab, ruleBasedSelectionTab(terms)];
+const builtInSelectionTabs = () => undefined;
 
 export const defaultDeliverySelectionTab = manualTab;
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: builtInSelectionTabs is not a function or its return value is not iterable

[Killed] ArrayDeclaration
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:200:30
 
 const builtInSelectionTabs = (
 	terms: DeliverySelectionTerms,
-): DeliverySelectionTab[] => [manualTab, ruleBasedSelectionTab(terms)];
+): DeliverySelectionTab[] => [];
 
 export const defaultDeliverySelectionTab = manualTab;
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: Cannot read properties of undefined (reading 'hydrate')

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:219:15
 	label: source.displayName,
 	mode: DeliverySelectionMode.SourceBound,
 	source,
-	premiumGate: {
-		whenLocked: "explainInside",
-		notice: `Taking a ${terms.deliveryTerm.toLowerCase()} date from a ${source.displayName} is a premium feature. Please upgrade your license to use this functionality.`,
-	},
+	premiumGate: {},
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
killedBy: what a licence that does not cover a tab says lets a source tab be opened and explains inside it, in the tenant's own word for a delivery
statusReason: expected undefined to be 'explainInside' // Object.is equality

[Killed] MethodExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:221:23
 	source,
 	premiumGate: {
 		whenLocked: "explainInside",
-		notice: `Taking a ${terms.deliveryTerm.toLowerCase()} date from a ${source.displayName} is a premium feature. Please upgrade your license to use this functionality.`,
+		notice: `Taking a ${terms.deliveryTerm.toUpperCase()} date from a ${source.displayName} is a premium feature. Please upgrade your license to use this functionality.`,
 	},
 	claims: (delivery) =>
killedBy: what a licence that does not cover a tab says lets a source tab be opened and explains inside it, in the tenant's own word for a delivery
statusReason: expected 'Taking a LAUNCH date from a Jira Rele…' to be 'Taking a launch date from a Jira Rele…' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:223:10
 		whenLocked: "explainInside",
 		notice: `Taking a ${terms.deliveryTerm.toLowerCase()} date from a ${source.displayName} is a premium feature. Please upgrade your license to use this functionality.`,
 	},
-	claims: (delivery) =>
-		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
-		delivery.sourceKey === source.key,
+	claims: () => undefined,
 	hydrate: (delivery) => ({
 		...emptySelectionValues(),
killedBy: which tab a delivery that follows a source reopens on recognises it from 'the name the server sends'
statusReason: expected 'manual' to be 'source:jira-release' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:224:3
 		notice: `Taking a ${terms.deliveryTerm.toLowerCase()} date from a ${source.displayName} is a premium feature. Please upgrade your license to use this functionality.`,
 	},
 	claims: (delivery) =>
-		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
-		delivery.sourceKey === source.key,
+		false,
 	hydrate: (delivery) => ({
 		...emptySelectionValues(),
killedBy: which tab a delivery that follows a source reopens on recognises it from 'the name the server sends'
statusReason: expected 'manual' to be 'source:jira-release' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:224:3
 		notice: `Taking a ${terms.deliveryTerm.toLowerCase()} date from a ${source.displayName} is a premium feature. Please upgrade your license to use this functionality.`,
 	},
 	claims: (delivery) =>
-		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
-		delivery.sourceKey === source.key,
+		true,
 	hydrate: (delivery) => ({
 		...emptySelectionValues(),
killedBy: which tab a delivery that follows a source reopens on opens on the source it follows, not on the first source the connection offers
statusReason: expected 'source:jira-release' to be 'source:jira-fix-version' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:225:3
 	},
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
-		delivery.sourceKey === source.key,
+		true,
 	hydrate: (delivery) => ({
 		...emptySelectionValues(),
killedBy: which tab a delivery that follows a source reopens on opens on the source it follows, not on the first source the connection offers
statusReason: expected 'source:jira-release' to be 'source:jira-fix-version' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:225:3
 	},
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
-		delivery.sourceKey === source.key,
+		delivery.sourceKey !== source.key,
 	hydrate: (delivery) => ({
 		...emptySelectionValues(),
killedBy: which tab a delivery that follows a source reopens on recognises it from 'the name the server sends'
statusReason: expected 'source:jira-fix-version' to be 'source:jira-release' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:226:11
 	claims: (delivery) =>
 		isStoredAs(delivery, DeliverySelectionMode.SourceBound) &&
 		delivery.sourceKey === source.key,
-	hydrate: (delivery) => ({
-		...emptySelectionValues(),
-		sourceReference: delivery.sourceReference ?? null,
-		publishForecastToSource: delivery.publishForecastToSource ?? false,
-	}),
+	hydrate: () => undefined,
 	firstBlockingError: (state) =>
 		state.sourceReference === null
killedBy: a tab that reads a date out of the work tracking system reopens on the entry the delivery already follows, and on nothing else
statusReason: expected undefined to deeply equal { selectedFeatureIds: [], …(4) }

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:228:20
 		delivery.sourceKey === source.key,
 	hydrate: (delivery) => ({
 		...emptySelectionValues(),
-		sourceReference: delivery.sourceReference ?? null,
+		sourceReference: delivery.sourceReference && null,
 		publishForecastToSource: delivery.publishForecastToSource ?? false,
 	}),
killedBy: a tab that reads a date out of the work tracking system reopens on the entry the delivery already follows, and on nothing else
statusReason: expected { selectedFeatureIds: [], …(4) } to deeply equal { selectedFeatureIds: [], …(4) }

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:231:22
 		sourceReference: delivery.sourceReference ?? null,
 		publishForecastToSource: delivery.publishForecastToSource ?? false,
 	}),
-	firstBlockingError: (state) =>
-		state.sourceReference === null
-			? `Pick a ${source.displayName} to see the date it would set.`
-			: null,
+	firstBlockingError: () => undefined,
 	fieldErrors: () => ({}),
 	toPayload: (state) => ({
killedBy: a tab that reads a date out of the work tracking system asks for something to be picked, and stops asking once something is
statusReason: expected undefined to be 'Pick a Jira Release to see the date i…' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:232:3
 		publishForecastToSource: delivery.publishForecastToSource ?? false,
 	}),
 	firstBlockingError: (state) =>
-		state.sourceReference === null
+		state.sourceReference !== null
 			? `Pick a ${source.displayName} to see the date it would set.`
 			: null,
killedBy: a tab that reads a date out of the work tracking system asks for something to be picked, and stops asking once something is
statusReason: expected null to be 'Pick a Jira Release to see the date i…' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:232:3
 		publishForecastToSource: delivery.publishForecastToSource ?? false,
 	}),
 	firstBlockingError: (state) =>
-		state.sourceReference === null
+		false
 			? `Pick a ${source.displayName} to see the date it would set.`
 			: null,
killedBy: a tab that reads a date out of the work tracking system asks for something to be picked, and stops asking once something is
statusReason: expected null to be 'Pick a Jira Release to see the date i…' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:235:15
 		state.sourceReference === null
 			? `Pick a ${source.displayName} to see the date it would set.`
 			: null,
-	fieldErrors: () => ({}),
+	fieldErrors: () => undefined,
 	toPayload: (state) => ({
 		featureIds: [],
killedBy: a tab that reads a date out of the work tracking system never puts a complaint on a field the reader cannot type into
statusReason: expected undefined to deeply equal {}

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:236:13
 			? `Pick a ${source.displayName} to see the date it would set.`
 			: null,
 	fieldErrors: () => ({}),
-	toPayload: (state) => ({
-		featureIds: [],
-		sourceKey: source.key,
-		sourceReference: state.sourceReference ?? undefined,
-		publishForecastToSource: state.publishForecastToSource,
-	}),
+	toPayload: () => undefined,
 });
 
killedBy: a tab that reads a date out of the work tracking system writes down which entry it follows, and nothing anyone chose by hand
statusReason: expected undefined to deeply equal { featureIds: [], …(3) }

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:236:25
 			? `Pick a ${source.displayName} to see the date it would set.`
 			: null,
 	fieldErrors: () => ({}),
-	toPayload: (state) => ({
-		featureIds: [],
-		sourceKey: source.key,
-		sourceReference: state.sourceReference ?? undefined,
-		publishForecastToSource: state.publishForecastToSource,
-	}),
+	toPayload: (state) => ({}),
 });
 
killedBy: a tab that reads a date out of the work tracking system writes down which entry it follows, and nothing anyone chose by hand
statusReason: expected {} to deeply equal { featureIds: [], …(3) }

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:239:20
 	toPayload: (state) => ({
 		featureIds: [],
 		sourceKey: source.key,
-		sourceReference: state.sourceReference ?? undefined,
+		sourceReference: state.sourceReference && undefined,
 		publishForecastToSource: state.publishForecastToSource,
 	}),
killedBy: a tab that reads a date out of the work tracking system writes down which entry it follows, and nothing anyone chose by hand
statusReason: expected { featureIds: [], …(3) } to deeply equal { featureIds: [], …(3) }

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:248:41
  * Every tab this Portfolio should offer. The sources come from the server, so a connection that
  * grows another one grows another tab here without a line changing.
  */
-export const deliverySelectionTabsFor = (
-	sources: IDeliverySource[],
-	terms: DeliverySelectionTerms,
-): DeliverySelectionTab[] => [
-	...builtInSelectionTabs(terms),
-	...sources.map((source) => sourceSelectionTab(source, terms)),
-];
+export const deliverySelectionTabsFor = () => undefined;
 
 /**
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ArrayDeclaration
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:251:30
 export const deliverySelectionTabsFor = (
 	sources: IDeliverySource[],
 	terms: DeliverySelectionTerms,
-): DeliverySelectionTab[] => [
-	...builtInSelectionTabs(terms),
-	...sources.map((source) => sourceSelectionTab(source, terms)),
-];
+): DeliverySelectionTab[] => [];
 
 /**
killedBy: reopening the form on a stored delivery reads back what was chosen, the rules, and how they were combined
statusReason: Cannot read properties of undefined (reading 'hydrate')

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:253:17
 	terms: DeliverySelectionTerms,
 ): DeliverySelectionTab[] => [
 	...builtInSelectionTabs(terms),
-	...sources.map((source) => sourceSelectionTab(source, terms)),
+	...sources.map(() => undefined),
 ];
 
killedBy: what a licence that does not cover a tab says lets a source tab be opened and explains inside it, in the tenant's own word for a delivery
statusReason: Cannot read properties of undefined (reading 'premiumGate')

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:262:39
  * connection offers — search the built-in pair alone and a bound delivery reopens as a hand-picked
  * one, which the next save would make true.
  */
-export const deliveryTabForDelivery = (
-	delivery: IDelivery,
-	tabs: DeliverySelectionTab[],
-): DeliverySelectionTab =>
-	tabs.find((tab) => tab.claims?.(delivery) === true) ??
-	defaultDeliverySelectionTab;
+export const deliveryTabForDelivery = () => undefined;
 
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:266:21
 	delivery: IDelivery,
 	tabs: DeliverySelectionTab[],
 ): DeliverySelectionTab =>
-	tabs.find((tab) => tab.claims?.(delivery) === true) ??
+	tabs.find((tab) => false) ??
 	defaultDeliverySelectionTab;
 
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: expected 'manual' to be 'rules' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliverySelectionTabs.ts:266:12
 	delivery: IDelivery,
 	tabs: DeliverySelectionTab[],
 ): DeliverySelectionTab =>
-	tabs.find((tab) => tab.claims?.(delivery) === true) ??
+	tabs.find(() => undefined) ??
 	defaultDeliverySelectionTab;
 
killedBy: which tab a stored delivery reopens on opens rule-based for one saved as rule-based, even with no rules stored against it
statusReason: expected 'manual' to be 'rules' // Object.is equality
