[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:62:3
 }) => {
 	const { getTerm } = useTerminology();
 	const terms = useMemo(
-		() => ({
-			deliveryTerm: getTerm(TERMINOLOGY_KEYS.DELIVERY),
-			featureTerm: getTerm(TERMINOLOGY_KEYS.FEATURE),
-			featuresTerm: getTerm(TERMINOLOGY_KEYS.FEATURES),
-			workItemsTerm: getTerm(TERMINOLOGY_KEYS.WORK_ITEMS),
-			portfolioTerm: getTerm(TERMINOLOGY_KEYS.PORTFOLIO),
-		}),
+		() => undefined,
 		[getTerm],
 	);
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Cannot destructure property 'deliveryTerm' of 'terms' as it is undefined.

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:73:6
 	);
 	const deliveriesTerm = getTerm(TERMINOLOGY_KEYS.DELIVERIES);
 
-	if (archivedDeliveries.length === 0) {
+	if (archivedDeliveries.length !== 0) {
 		return null;
 	}
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an accessible element with the role "button" and name `/Archived Deliveries/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:73:6
 	);
 	const deliveriesTerm = getTerm(TERMINOLOGY_KEYS.DELIVERIES);
 
-	if (archivedDeliveries.length === 0) {
+	if (false) {
 		return null;
 	}
killedBy: ArchivedDeliveriesSection says nothing at all when a Portfolio has retired nothing
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  class="MuiTypography-root MuiTypography-h6 css-1miy0lu-MuiTypography-root"
>
  Archived 
  Deliveries
   (

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:82:9
 			{/* Nothing is rendered until the section is opened: a Portfolio can accumulate retired
 			    Deliveries indefinitely, and none of them is what the reader came for. */}
 			<Accordion
-				sx={{ overflow: "hidden" }}
+				sx={{}}
 				slotProps={{ transition: { unmountOnExit: true } }}
 			>

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:83:47
 			    Deliveries indefinitely, and none of them is what the reader came for. */}
 			<Accordion
 				sx={{ overflow: "hidden" }}
-				slotProps={{ transition: { unmountOnExit: true } }}
+				slotProps={{ transition: { unmountOnExit: false } }}
 			>
 				<AccordionSummary expandIcon={<ExpandMoreIcon />}>
killedBy: PortfolioDeliveryView - retiring a Delivery keeps the retired Deliveries out of the live list and under their own heading
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h4
  class="MuiTypography-root MuiTypography-subtitle1 css-1i3tsf3-MuiTypography-root"
>
  Autumn Launch
</h4> instead

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:83:16
 			    Deliveries indefinitely, and none of them is what the reader came for. */}
 			<Accordion
 				sx={{ overflow: "hidden" }}
-				slotProps={{ transition: { unmountOnExit: true } }}
+				slotProps={{}}
 			>
 				<AccordionSummary expandIcon={<ExpandMoreIcon />}>
killedBy: PortfolioDeliveryView - retiring a Delivery keeps the retired Deliveries out of the live list and under their own heading
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h4
  class="MuiTypography-root MuiTypography-subtitle1 css-1i3tsf3-MuiTypography-root"
>
  Autumn Launch
</h4> instead

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:91:30
 					</Typography>
 				</AccordionSummary>
 				<AccordionDetails>
-					{archivedDeliveries.map((archived) => (
-						<ArchivedDeliveryRow
-							key={archived.id}
-							archived={archived}
-							canEdit={canEdit}
-							onDelete={onDelete}
-							onUnarchive={onUnarchive}
-							terms={terms}
-						/>
-					))}
+					{archivedDeliveries.map(() => undefined)}
 				</AccordionDetails>
 			</Accordion>
killedBy: PortfolioDeliveryView - retiring a Delivery keeps the retired Deliveries out of the live list and under their own heading
statusReason: Unable to find an element with the text: Autumn Launch. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:126:14
 const selectionSummary = (
 	archived: ArchivedDelivery,
 	featuresTerm: string,
-): string => {
-	if (!archived.isRuleBased) {
-		return `Manual: ${featuresTerm} were fixed`;
-	}
-
-	if (archived.rules.length === 0) {
-		return `Rule-Based: ${featuresTerm} were chosen by a rule`;
-	}
-
-	const conditions = archived.rules
-		.map((rule) => `${rule.fieldKey} ${rule.operator} ${rule.value}`)
-		.join(archived.mode === "or" ? " or " : " and ");
-
-	return `Rule-Based: ${featuresTerm} were chosen by ${conditions}`;
-};
+): string => {};
 
 /**
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:127:6
 	archived: ArchivedDelivery,
 	featuresTerm: string,
 ): string => {
-	if (!archived.isRuleBased) {
+	if (archived.isRuleBased) {
 		return `Manual: ${featuresTerm} were fixed`;
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:127:6
 	archived: ArchivedDelivery,
 	featuresTerm: string,
 ): string => {
-	if (!archived.isRuleBased) {
+	if (true) {
 		return `Manual: ${featuresTerm} were fixed`;
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:131:6
 		return `Manual: ${featuresTerm} were fixed`;
 	}
 
-	if (archived.rules.length === 0) {
+	if (archived.rules.length !== 0) {
 		return `Rule-Based: ${featuresTerm} were chosen by a rule`;
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:131:6
 		return `Manual: ${featuresTerm} were fixed`;
 	}
 
-	if (archived.rules.length === 0) {
+	if (true) {
 		return `Rule-Based: ${featuresTerm} were chosen by a rule`;
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:136:8
 	}
 
 	const conditions = archived.rules
-		.map((rule) => `${rule.fieldKey} ${rule.operator} ${rule.value}`)
+		.map(() => undefined)
 		.join(archived.mode === "or" ? " or " : " and ");
 
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:136:18
 	}
 
 	const conditions = archived.rules
-		.map((rule) => `${rule.fieldKey} ${rule.operator} ${rule.value}`)
+		.map((rule) => ``)
 		.join(archived.mode === "or" ? " or " : " and ");
 
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:137:9
 
 	const conditions = archived.rules
 		.map((rule) => `${rule.fieldKey} ${rule.operator} ${rule.value}`)
-		.join(archived.mode === "or" ? " or " : " and ");
+		.join(false ? " or " : " and ");
 
 	return `Rule-Based: ${featuresTerm} were chosen by ${conditions}`;

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:137:9
 
 	const conditions = archived.rules
 		.map((rule) => `${rule.fieldKey} ${rule.operator} ${rule.value}`)
-		.join(archived.mode === "or" ? " or " : " and ");
+		.join(true ? " or " : " and ");
 
 	return `Rule-Based: ${featuresTerm} were chosen by ${conditions}`;

[Killed] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:139:9
 		.map((rule) => `${rule.fieldKey} ${rule.operator} ${rule.value}`)
 		.join(archived.mode === "or" ? " or " : " and ");
 
-	return `Rule-Based: ${featuresTerm} were chosen by ${conditions}`;
+	return ``;
 };
 
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:156:3
 }) => {
 	const { deliveryTerm, featureTerm, featuresTerm, workItemsTerm } = terms;
 	const [activeTab, setActiveTab] = useState<"workItems" | "metrics" | "notes">(
-		"workItems",
+		"",
 	);
 	const {
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an element with the text: Checkout rewrite. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:166:3
 	} = useLazyMetricsHistory(archived.id);
 
 	const isMetricsTabDisabled =
-		archived.metricSnapshotCount < MINIMUM_METRIC_SNAPSHOTS;
+		false;
 
 	const handleTabChange = useCallback(
killedBy: Reading a retired Delivery as the record it was keeps the Metrics tab dark on a record closed before it had enough days
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  aria-selected="false"
  class="MuiButtonBase-root MuiTab-root MuiTab-textColorPrimary css-1usuzwp-MuiButtonBase-root-MuiTab-root"
  role="tab"
  tabindex="-1"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:166:3
 	} = useLazyMetricsHistory(archived.id);
 
 	const isMetricsTabDisabled =
-		archived.metricSnapshotCount < MINIMUM_METRIC_SNAPSHOTS;
+		true;
 
 	const handleTabChange = useCallback(
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: Unable to find role="tab" and name "Metrics"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:172:8
 		(
 			_event: React.SyntheticEvent,
 			nextTab: "workItems" | "metrics" | "notes",
-		) => {
-			if (nextTab === "metrics" && isMetricsTabDisabled) {
-				return;
-			}
-			setActiveTab(nextTab);
-			if (nextTab === "metrics") {
-				loadMetricsHistory();
-			}
-		},
+		) => {},
 		[isMetricsTabDisabled, loadMetricsHistory],
 	);
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: expected "vi.fn()" to be called with arguments: [ 9 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:173:8
 			_event: React.SyntheticEvent,
 			nextTab: "workItems" | "metrics" | "notes",
 		) => {
-			if (nextTab === "metrics" && isMetricsTabDisabled) {
+			if (nextTab === "metrics" || isMetricsTabDisabled) {
 				return;
 			}
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: expected "vi.fn()" to be called with arguments: [ 9 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:173:8
 			_event: React.SyntheticEvent,
 			nextTab: "workItems" | "metrics" | "notes",
 		) => {
-			if (nextTab === "metrics" && isMetricsTabDisabled) {
+			if (true) {
 				return;
 			}
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: expected "vi.fn()" to be called with arguments: [ 9 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:177:8
 				return;
 			}
 			setActiveTab(nextTab);
-			if (nextTab === "metrics") {
+			if (nextTab !== "metrics") {
 				loadMetricsHistory();
 			}
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: expected "vi.fn()" to be called with arguments: [ 9 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:177:8
 				return;
 			}
 			setActiveTab(nextTab);
-			if (nextTab === "metrics") {
+			if (false) {
 				loadMetricsHistory();
 			}
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: expected "vi.fn()" to be called with arguments: [ 9 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:187:56
 	// The grid hands back the references in the order the reader is looking at them, so the file is
 	// sorted and filtered the way the screen is — the same arrangement a live Delivery exports by.
 	const exportTable = useCallback(
-		(orderedRowIds: GridRowId[]): DataGridExportTable => {
-			const rowByReference = new Map(
-				archived.featureBreakdown.map((row) => [row.referenceId, row]),
-			);
-			const ordered = orderedRowIds
-				.map((rowId) => rowByReference.get(String(rowId)))
-				.filter((row): row is FeatureMetric => row !== undefined);
-
-			return buildArchivedDeliveryExportTable(archived, ordered, terms);
-		},
+		(orderedRowIds: GridRowId[]): DataGridExportTable => {},
 		[archived, terms],
 	);
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:189:35
 	const exportTable = useCallback(
 		(orderedRowIds: GridRowId[]): DataGridExportTable => {
 			const rowByReference = new Map(
-				archived.featureBreakdown.map((row) => [row.referenceId, row]),
+				archived.featureBreakdown.map(() => undefined),
 			);
 			const ordered = orderedRowIds
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Survived] MethodExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:191:20
 			const rowByReference = new Map(
 				archived.featureBreakdown.map((row) => [row.referenceId, row]),
 			);
-			const ordered = orderedRowIds
-				.map((rowId) => rowByReference.get(String(rowId)))
-				.filter((row): row is FeatureMetric => row !== undefined);
+			const ordered = orderedRowIds.map(rowId => rowByReference.get(String(rowId)));
 
 			return buildArchivedDeliveryExportTable(archived, ordered, terms);

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:192:10
 				archived.featureBreakdown.map((row) => [row.referenceId, row]),
 			);
 			const ordered = orderedRowIds
-				.map((rowId) => rowByReference.get(String(rowId)))
+				.map(() => undefined)
 				.filter((row): row is FeatureMetric => row !== undefined);
 
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:193:44
 			);
 			const ordered = orderedRowIds
 				.map((rowId) => rowByReference.get(String(rowId)))
-				.filter((row): row is FeatureMetric => row !== undefined);
+				.filter((row): row is FeatureMetric => false);
 
 			return buildArchivedDeliveryExportTable(archived, ordered, terms);
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:193:44
 			);
 			const ordered = orderedRowIds
 				.map((rowId) => rowByReference.get(String(rowId)))
-				.filter((row): row is FeatureMetric => row !== undefined);
+				.filter((row): row is FeatureMetric => row === undefined);
 
 			return buildArchivedDeliveryExportTable(archived, ordered, terms);
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] ArrayDeclaration
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:197:3
 
 			return buildArchivedDeliveryExportTable(archived, ordered, terms);
 		},
-		[archived, terms],
+		[],
 	);
 

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:203:3
 	const teamsWithoutForecast = archived.teamsWithoutForecast;
 	const forecastLevel = new ForecastLevel(archived.likelihoodPercentage);
 	const deliveryCannotBeForecast =
-		cannotBeForecast({ teamsWithoutForecast }) ||
-		archived.likelihoodPercentage === null;
+		true;
 	const hasInsufficientData = isForecastDataInsufficient({
 		hasRemainingWork: archived.remainingWork > 0,
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-

[Survived] LogicalOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:203:3
 	const teamsWithoutForecast = archived.teamsWithoutForecast;
 	const forecastLevel = new ForecastLevel(archived.likelihoodPercentage);
 	const deliveryCannotBeForecast =
-		cannotBeForecast({ teamsWithoutForecast }) ||
-		archived.likelihoodPercentage === null;
+		cannotBeForecast({
+  teamsWithoutForecast
+}) && archived.likelihoodPercentage === null;
 	const hasInsufficientData = isForecastDataInsufficient({
 		hasRemainingWork: archived.remainingWork > 0,

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:204:3
 	const forecastLevel = new ForecastLevel(archived.likelihoodPercentage);
 	const deliveryCannotBeForecast =
 		cannotBeForecast({ teamsWithoutForecast }) ||
-		archived.likelihoodPercentage === null;
+		archived.likelihoodPercentage !== null;
 	const hasInsufficientData = isForecastDataInsufficient({
 		hasRemainingWork: archived.remainingWork > 0,
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:204:3
 	const forecastLevel = new ForecastLevel(archived.likelihoodPercentage);
 	const deliveryCannotBeForecast =
 		cannotBeForecast({ teamsWithoutForecast }) ||
-		archived.likelihoodPercentage === null;
+		false;
 	const hasInsufficientData = isForecastDataInsufficient({
 		hasRemainingWork: archived.remainingWork > 0,

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:206:21
 		cannotBeForecast({ teamsWithoutForecast }) ||
 		archived.likelihoodPercentage === null;
 	const hasInsufficientData = isForecastDataInsufficient({
-		hasRemainingWork: archived.remainingWork > 0,
+		hasRemainingWork: archived.remainingWork <= 0,
 		hasSufficientData: archived.hasSufficientData,
 	});

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:206:21
 		cannotBeForecast({ teamsWithoutForecast }) ||
 		archived.likelihoodPercentage === null;
 	const hasInsufficientData = isForecastDataInsufficient({
-		hasRemainingWork: archived.remainingWork > 0,
+		hasRemainingWork: true,
 		hasSufficientData: archived.hasSufficientData,
 	});

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:211:6
 	});
 
 	let likelihoodLabel: string;
-	if (deliveryCannotBeForecast || archived.likelihoodPercentage === null) {
+	if (true) {
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
 	} else if (hasInsufficientData) {
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:211:74
 	});
 
 	let likelihoodLabel: string;
-	if (deliveryCannotBeForecast || archived.likelihoodPercentage === null) {
-		likelihoodLabel = CANNOT_FORECAST_SHORT;
-	} else if (hasInsufficientData) {
+	if (deliveryCannotBeForecast || archived.likelihoodPercentage === null) {} else if (hasInsufficientData) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
 	} else {
killedBy: ArchivedDeliveriesSection still says why a Delivery that closed without a forecast has no number
statusReason: Unable to find an element with the text: Cannot forecast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:213:13
 	let likelihoodLabel: string;
 	if (deliveryCannotBeForecast || archived.likelihoodPercentage === null) {
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
-	} else if (hasInsufficientData) {
+	} else if (true) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
 	} else {
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:213:13
 	let likelihoodLabel: string;
 	if (deliveryCannotBeForecast || archived.likelihoodPercentage === null) {
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
-	} else if (hasInsufficientData) {
+	} else if (false) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
 	} else {

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:215:9
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
 	} else if (hasInsufficientData) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
-	} else {
-		likelihoodLabel = jointLikelihoodLabel({
-			term: featuresTerm,
-			date: archived.getFormattedDate(),
-			value: formatLikelihood(archived.likelihoodPercentage, {
-				hasRemainingWork: archived.remainingWork > 0,
-				precision: "round",
-			}),
-		});
-	}
+	} else {}
 
 	return (
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-
