[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:216:42
 	} else if (hasInsufficientData) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
 	} else {
-		likelihoodLabel = jointLikelihoodLabel({
-			term: featuresTerm,
-			date: archived.getFormattedDate(),
-			value: formatLikelihood(archived.likelihoodPercentage, {
-				hasRemainingWork: archived.remainingWork > 0,
-				precision: "round",
-			}),
-		});
+		likelihoodLabel = jointLikelihoodLabel({});
 	}
 
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:220:23
 			term: featuresTerm,
 			date: archived.getFormattedDate(),
 			value: formatLikelihood(archived.likelihoodPercentage, {
-				hasRemainingWork: archived.remainingWork > 0,
+				hasRemainingWork: archived.remainingWork >= 0,
 				precision: "round",
 			}),

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:220:23
 			term: featuresTerm,
 			date: archived.getFormattedDate(),
 			value: formatLikelihood(archived.likelihoodPercentage, {
-				hasRemainingWork: archived.remainingWork > 0,
+				hasRemainingWork: archived.remainingWork <= 0,
 				precision: "round",
 			}),

[Killed] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:221:16
 			date: archived.getFormattedDate(),
 			value: formatLikelihood(archived.likelihoodPercentage, {
 				hasRemainingWork: archived.remainingWork > 0,
-				precision: "round",
+				precision: "",
 			}),
 		});
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /All Features by .*: 64%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:234:54
 			<AccordionSummary
 				expandIcon={<ExpandMoreIcon />}
 				sx={{
-					"& .MuiAccordionSummary-content": { alignItems: "center", gap: 4 },
+					"& .MuiAccordionSummary-content": { alignItems: "", gap: 4 },
 					pr: 12,
 				}}

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:240:11
 			>
 				{canEdit && (
 					<Box
-						sx={{
-							position: "absolute",
-							top: "50%",
-							transform: "translateY(-50%)",
-							right: 48,
-							zIndex: 1,
-							display: "flex",
-							alignItems: "center",
-							gap: 0.5,
-						}}
+						sx={{}}
 					>
 						{/* Deliberately ungated: archiving is a premium capability, but a lapsed licence

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:246:17
 							transform: "translateY(-50%)",
 							right: 48,
 							zIndex: 1,
-							display: "flex",
+							display: "",
 							alignItems: "center",
 							gap: 0.5,

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:256:29
 						<Tooltip title={`Bring this ${deliveryTerm} back`}>
 							<IconButton
 								size="small"
-								onClick={(event) => {
-									event.stopPropagation();
-									onUnarchive(archived);
-								}}
+								onClick={(event) => {}}
 								aria-label="unarchive"
 								sx={{
killedBy: PortfolioDeliveryView - retiring a Delivery brings a retired Delivery back on the version it is looking at
statusReason: expected "vi.fn()" to be called with arguments: [ 9, …(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:262:19
 								}}
 								aria-label="unarchive"
 								sx={{
-									bgcolor: "background.paper",
+									bgcolor: "",
 									"&:hover": { bgcolor: "primary.light" },
 								}}

[Killed] BlockStatement
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:271:28
 						</Tooltip>
 						<IconButton
 							size="small"
-							onClick={(event) => {
-								event.stopPropagation();
-								onDelete(archived);
-							}}
+							onClick={(event) => {}}
 							aria-label="delete"
 							sx={{
killedBy: ArchivedDeliveriesSection keeps Delete available on a retired Delivery
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:276:12
 								onDelete(archived);
 							}}
 							aria-label="delete"
-							sx={{
-								bgcolor: "background.paper",
-								"&:hover": { bgcolor: "error.light" },
-							}}
+							sx={{}}
 						>
 							<DeleteIcon />

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:285:25
 						</IconButton>
 					</Box>
 				)}
-				<Box sx={{ display: "flex", flexDirection: "column", gap: 1, flex: 1 }}>
+				<Box sx={{ display: "", flexDirection: "column", gap: 1, flex: 1 }}>
 					<Box
 						sx={{

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:285:14
 						</IconButton>
 					</Box>
 				)}
-				<Box sx={{ display: "flex", flexDirection: "column", gap: 1, flex: 1 }}>
+				<Box sx={{}}>
 					<Box
 						sx={{

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:291:18
 							display: "flex",
 							alignItems: "center",
 							gap: 2,
-							flexWrap: "wrap",
+							flexWrap: "",
 						}}
 					>

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:298:17
 							{archived.name}
 						</Typography>
 						<Tooltip title={selectionSummary(archived, featuresTerm)}>
-							<Box sx={{ display: "flex", alignItems: "center" }}>
+							<Box sx={{}}>
 								{archived.isRuleBased ? (
 									<AutoModeIcon

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:302:24
 								{archived.isRuleBased ? (
 									<AutoModeIcon
 										fontSize="small"
-										sx={{ color: "text.secondary" }}
+										sx={{ color: "" }}
 									/>
 								) : (

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:329:12
 							}
 							label={likelihoodLabel}
 							size="small"
-							sx={{
-								bgcolor: forecastLevel.color,
-								color: "#fff",
-								fontWeight: "bold",
-							}}
+							sx={{}}
 						/>
 					</Box>

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:332:21
 							sx={{
 								bgcolor: forecastLevel.color,
 								color: "#fff",
-								fontWeight: "bold",
+								fontWeight: "",
 							}}
 						/>

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:346:14
 					}}
 				>
 					<ProgressIndicator
-						title={`${archived.totalWork} ${workItemsTerm}`}
+						title={``}
 						progressableItem={{
 							remainingWork: archived.remainingWork,

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:351:20
 							remainingWork: archived.remainingWork,
 							totalWork: archived.totalWork,
 						}}
-						showDetails={true}
+						showDetails={false}
 					/>
 				</Box>
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Unable to find an element with the text: /80% \(40\/50\)/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:355:26
 					/>
 				</Box>
 			</AccordionSummary>
-			<AccordionDetails sx={{ p: 0 }}>
+			<AccordionDetails sx={{}}>
 				<Tabs
 					value={activeTab}

[Survived] StringLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:359:18
 				<Tabs
 					value={activeTab}
 					onChange={handleTabChange}
-					aria-label={`archived ${deliveryTerm} view tabs`}
+					aria-label={``}
 					sx={{ px: 2, borderBottom: 1, borderColor: "divider" }}
 				>

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:374:22
 										: ""
 								}
 							>
-								<span style={{ pointerEvents: "auto" }}>Metrics</span>
+								<span style={{}}>Metrics</span>
 							</Tooltip>
 						}

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:380:6
 					/>
 					<Tab label="Notes" value="notes" />
 				</Tabs>
-				{activeTab === "workItems" && (
-					<ArchivedFeatureGrid
-						rows={archived.featureBreakdown}
-						deliveryId={archived.id}
-						featureTerm={featureTerm}
-						featuresTerm={featuresTerm}
-						workItemsTerm={workItemsTerm}
-						exportFileName={archived.name}
-						exportTable={exportTable}
-					/>
-				)}
+				{true}
 				{activeTab === "metrics" && (
 					<DeliveryMetricsTab
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an element with the text: Checkout rewrite. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:380:6
 					/>
 					<Tab label="Notes" value="notes" />
 				</Tabs>
-				{activeTab === "workItems" && (
-					<ArchivedFeatureGrid
-						rows={archived.featureBreakdown}
-						deliveryId={archived.id}
-						featureTerm={featureTerm}
-						featuresTerm={featuresTerm}
-						workItemsTerm={workItemsTerm}
-						exportFileName={archived.name}
-						exportTable={exportTable}
-					/>
-				)}
+				{false}
 				{activeTab === "metrics" && (
 					<DeliveryMetricsTab
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an element with the text: Checkout rewrite. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:391:6
 						exportTable={exportTable}
 					/>
 				)}
-				{activeTab === "metrics" && (
-					<DeliveryMetricsTab
-						isLoading={isLoadingMetrics}
-						history={metricsHistory}
-						hasFailed={metricsFailed}
-						featuresTerm={featuresTerm}
-					/>
-				)}
+				{activeTab === "metrics" || <DeliveryMetricsTab isLoading={isLoadingMetrics} history={metricsHistory} hasFailed={metricsFailed} featuresTerm={featuresTerm} />}
 				{activeTab === "notes" && (
 					<DeliveryNotesPanel
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:391:6
 						exportTable={exportTable}
 					/>
 				)}
-				{activeTab === "metrics" && (
-					<DeliveryMetricsTab
-						isLoading={isLoadingMetrics}
-						history={metricsHistory}
-						hasFailed={metricsFailed}
-						featuresTerm={featuresTerm}
-					/>
-				)}
+				{false}
 				{activeTab === "notes" && (
 					<DeliveryNotesPanel
killedBy: Reading a retired Delivery as the record it was opens the Metrics tab on a record with enough days behind it
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:399:6
 						featuresTerm={featuresTerm}
 					/>
 				)}
-				{activeTab === "notes" && (
+				{activeTab !== "notes" && (
 					<DeliveryNotesPanel
 						deliveryId={archived.id}
killedBy: Reading a retired Delivery as the record it was lists the notes written before it closed, with nowhere to write another
statusReason: Unable to find an element by: [data-testid="delivery-note"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:399:6
 						featuresTerm={featuresTerm}
 					/>
 				)}
-				{activeTab === "notes" && (
-					<DeliveryNotesPanel
-						deliveryId={archived.id}
-						canWrite={canEdit}
-						isReadOnly={true}
-					/>
-				)}
+				{false}
 			</AccordionDetails>
 		</Accordion>
killedBy: Reading a retired Delivery as the record it was lists the notes written before it closed, with nowhere to write another
statusReason: Unable to find an element by: [data-testid="delivery-note"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/ArchivedDeliveriesSection.tsx:403:19
 					<DeliveryNotesPanel
 						deliveryId={archived.id}
 						canWrite={canEdit}
-						isReadOnly={true}
+						isReadOnly={false}
 					/>
 				)}
killedBy: Reading a retired Delivery as the record it was lists the notes written before it closed, with nowhere to write another
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <textarea
  aria-describedby="_r_1n_-helper-text"
  aria-invalid="false"
  class="MuiInputBase-input MuiOutlinedInput-input css-w4nesw-MuiInputBase-input-MuiOutlinedInput-input"
  data-testid="note-input"
  id="_r_1n_"
