[Killed] BlockStatement
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:16:73
 
 export const METRICS_GRID_COLUMNS = { xs: "1fr", lg: "1fr 1fr" };
 
-export function metricsUnavailableReason(snapshotCount: number): string {
-	return `Metrics need at least ${MINIMUM_METRIC_SNAPSHOTS} daily records to chart trends (have ${snapshotCount}).`;
-}
+export function metricsUnavailableReason(snapshotCount: number): string {}
 
 /**
killedBy: DeliverySection Metrics tab snapshot gating disables the Metrics tab with an explanatory tooltip while too few snapshots are recorded
statusReason: Unable to find an element with the text: Metrics need at least 3 daily records to chart trends (have 2).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded Mu

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:27:45
 export function useLazyMetricsHistory(deliveryId: number) {
 	const { deliveryService } = useContext(ApiServiceContext);
 	const [history, setHistory] = useState<DeliveryMetricsHistory | null>(null);
-	const [isLoading, setIsLoading] = useState(false);
+	const [isLoading, setIsLoading] = useState(true);
 	const [hasFailed, setHasFailed] = useState(false);
 
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:28:45
 	const { deliveryService } = useContext(ApiServiceContext);
 	const [history, setHistory] = useState<DeliveryMetricsHistory | null>(null);
 	const [isLoading, setIsLoading] = useState(false);
-	const [hasFailed, setHasFailed] = useState(false);
+	const [hasFailed, setHasFailed] = useState(true);
 
 	const load = useCallback(() => {

[Killed] BlockStatement
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:30:33
 	const [isLoading, setIsLoading] = useState(false);
 	const [hasFailed, setHasFailed] = useState(false);
 
-	const load = useCallback(() => {
-		if (history !== null || isLoading) {
-			return;
-		}
-
-		setIsLoading(true);
-		setHasFailed(false);
-		deliveryService
-			.getMetricsHistory(deliveryId)
-			.then(setHistory)
-			// Without this the tab keeps saying it is loading, for as long as anyone leaves it open.
-			// A reader cannot tell that apart from a slow answer, so they wait for one that is never
-			// coming.
-			.catch((error: unknown) => {
-				console.error("Failed to load delivery metrics history:", error);
-				setHasFailed(true);
-			})
-			.finally(() => setIsLoading(false));
-	}, [deliveryService, deliveryId, history, isLoading]);
+	const load = useCallback(() => {}, [deliveryService, deliveryId, history, isLoading]);
 
 	return { history, isLoading, hasFailed, load };
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:31:7
 	const [hasFailed, setHasFailed] = useState(false);
 
 	const load = useCallback(() => {
-		if (history !== null || isLoading) {
+		if (false) {
 			return;
 		}
killedBy: DeliverySection Metrics tab fetches metrics history only once across repeated tab switches
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:31:7
 	const [hasFailed, setHasFailed] = useState(false);
 
 	const load = useCallback(() => {
-		if (history !== null || isLoading) {
+		if (false || isLoading) {
 			return;
 		}
killedBy: DeliverySection Metrics tab fetches metrics history only once across repeated tab switches
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:36:16
 		}
 
 		setIsLoading(true);
-		setHasFailed(false);
+		setHasFailed(true);
 		deliveryService
 			.getMetricsHistory(deliveryId)
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:43:31
 			// Without this the tab keeps saying it is loading, for as long as anyone leaves it open.
 			// A reader cannot tell that apart from a slow answer, so they wait for one that is never
 			// coming.
-			.catch((error: unknown) => {
-				console.error("Failed to load delivery metrics history:", error);
-				setHasFailed(true);
-			})
+			.catch((error: unknown) => {})
 			.finally(() => setIsLoading(false));
 	}, [deliveryService, deliveryId, history, isLoading]);

[NoCoverage] StringLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:44:19
 			// A reader cannot tell that apart from a slow answer, so they wait for one that is never
 			// coming.
 			.catch((error: unknown) => {
-				console.error("Failed to load delivery metrics history:", error);
+				console.error("", error);
 				setHasFailed(true);
 			})

[NoCoverage] BooleanLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:45:18
 			// coming.
 			.catch((error: unknown) => {
 				console.error("Failed to load delivery metrics history:", error);
-				setHasFailed(true);
+				setHasFailed(false);
 			})
 			.finally(() => setIsLoading(false));

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:47:32
 				console.error("Failed to load delivery metrics history:", error);
 				setHasFailed(true);
 			})
-			.finally(() => setIsLoading(false));
+			.finally(() => setIsLoading(true));
 	}, [deliveryService, deliveryId, history, isLoading]);
 
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:47:13
 				console.error("Failed to load delivery metrics history:", error);
 				setHasFailed(true);
 			})
-			.finally(() => setIsLoading(false));
+			.finally(() => undefined);
 	}, [deliveryService, deliveryId, history, isLoading]);
 
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[NoCoverage] BooleanLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:63:14
 const DeliveryMetricsTab: React.FC<DeliveryMetricsTabProps> = ({
 	isLoading,
 	history,
-	hasFailed = false,
+	hasFailed = true,
 	featuresTerm,
 }) => {

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:66:6
 	hasFailed = false,
 	featuresTerm,
 }) => {
-	if (hasFailed) {
+	if (true) {
 		return (
 			<Typography variant="body2" color="error" sx={{ p: 2 }}>
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:66:17
 	hasFailed = false,
 	featuresTerm,
 }) => {
-	if (hasFailed) {
-		return (
-			<Typography variant="body2" color="error" sx={{ p: 2 }}>
-				Could not load the metrics history. Close this tab and open it again to
-				retry.
-			</Typography>
-		);
-	}
+	if (hasFailed) {}
 
 	if (isLoading || history === null) {

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:75:6
 		);
 	}
 
-	if (isLoading || history === null) {
+	if (true) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:75:6
 		);
 	}
 
-	if (isLoading || history === null) {
+	if (isLoading && history === null) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
killedBy: DeliverySection Metrics tab layout keeps the placeholder up when the delivery has no metrics to show
statusReason: Unable to find an element with the text: Loading metrics.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:97:13
 		>
 			<EnlargeableChart
 				ariaLabel="Delivery Burnup"
-				render={(height) => (
-					<DeliveryBurnupChart history={history} height={height} />
-				)}
+				render={() => undefined}
 			/>
 			<EnlargeableChart
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:103:13
 			/>
 			<EnlargeableChart
 				ariaLabel="Delivery Predictability"
-				render={(height) => (
-					<DeliveryPredictabilityChart history={history} height={height} />
-				)}
+				render={() => undefined}
 			/>
 			<EnlargeableChart
killedBy: DeliverySection Metrics tab renders the burnup, predictability and fever charts together from the same fetched history
statusReason: Unable to find an element by: [data-testid="predictability-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] StringLiteral
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:108:16
 				)}
 			/>
 			<EnlargeableChart
-				ariaLabel={`${featuresTerm} over Time`}
+				ariaLabel={``}
 				render={(height) => (
 					<DeliveryEpicSizeChart
killedBy: DeliverySection Metrics tab layout names the card's enlarge control after the same term
statusReason: Unable to find an accessible element with the role "button" and name "Enlarge Epics over Time"

Here are the accessible roles:

  heading:

  Name "Premium feature - Upgrade to use Test Delivery Manual: Features are fixed Delivery Date: 6/10/2026 All Epics by 6/10/2026: 75% Forecast: 1 feature (10 Work Items) 60 60% (6/10)":
  <h3

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:109:13
 			/>
 			<EnlargeableChart
 				ariaLabel={`${featuresTerm} over Time`}
-				render={(height) => (
-					<DeliveryEpicSizeChart
-						history={history}
-						featuresTerm={featuresTerm}
-						height={height}
-					/>
-				)}
+				render={() => undefined}
 			/>
 			<EnlargeableChart
killedBy: DeliverySection Metrics tab layout shows the epic size and count card built from the same fetched history (AC-1.3)
statusReason: Unable to find an element by: [data-testid="epic-size-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/DeliveryMetricsTab.tsx:119:13
 			/>
 			<EnlargeableChart
 				ariaLabel="Delivery Progress"
-				render={(height) => (
-					<DeliveryFeverChart history={history} height={height} />
-				)}
+				render={() => undefined}
 			/>
 		</Box>
killedBy: DeliverySection Metrics tab renders the burnup, predictability and fever charts together from the same fetched history
statusReason: Unable to find an element by: [data-testid="fever-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"
