[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:94:12
 	onEdit,
 	onArchive,
 	teams,
-	canEdit = true,
+	canEdit = false,
 	canArchive = false,
 }) => {

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:95:15
 	onArchive,
 	teams,
 	canEdit = true,
-	canArchive = false,
+	canArchive = true,
 }) => {
 	const { featureService } = useContext(ApiServiceContext);

[Survived] ArrayDeclaration
Detail/Components/DeliveryGrid/DeliverySection.tsx:100:72
 	const { featureService } = useContext(ApiServiceContext);
 
 	const [selectedFeature, setSelectedFeature] = useState<IFeature | null>(null);
-	const [featureWorkItems, setFeatureWorkItems] = useState<IWorkItem[]>([]);
+	const [featureWorkItems, setFeatureWorkItems] = useState<IWorkItem[]>(["Stryker was here"]);
 	const [isWorkItemsDialogOpen, setIsWorkItemsDialogOpen] = useState(false);
 

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:101:69
 
 	const [selectedFeature, setSelectedFeature] = useState<IFeature | null>(null);
 	const [featureWorkItems, setFeatureWorkItems] = useState<IWorkItem[]>([]);
-	const [isWorkItemsDialogOpen, setIsWorkItemsDialogOpen] = useState(false);
+	const [isWorkItemsDialogOpen, setIsWorkItemsDialogOpen] = useState(true);
 
 	const [activeTab, setActiveTab] = useState<"workItems" | "metrics" | "notes">(

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:114:3
 	} = useLazyMetricsHistory(delivery.id);
 
 	const isMetricsTabDisabled =
-		delivery.metricSnapshotCount < MINIMUM_METRIC_SNAPSHOTS;
+		delivery.metricSnapshotCount <= MINIMUM_METRIC_SNAPSHOTS;
 
 	const handleTabChange = useCallback(
killedBy: DeliverySection Metrics tab offers the Metrics tab to community users without a premium license
statusReason: Unable to find an accessible element with the role "tab" and name "Metrics"

Here are the accessible roles:

  heading:

  Name "Premium feature - Upgrade to use Test Delivery Manual: Features are fixed Delivery Date: 6/10/2026 All Epics by 6/10/2026: 75% Forecast: 1 feature (10 Work Items) 0 60% (6/10)":
  <h3

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:114:3
 	} = useLazyMetricsHistory(delivery.id);
 
 	const isMetricsTabDisabled =
-		delivery.metricSnapshotCount < MINIMUM_METRIC_SNAPSHOTS;
+		true;
 
 	const handleTabChange = useCallback(
killedBy: DeliverySection Metrics tab offers the Metrics tab to community users without a premium license
statusReason: Unable to find an accessible element with the role "tab" and name "Metrics"

Here are the accessible roles:

  heading:

  Name "Premium feature - Upgrade to use Test Delivery Manual: Features are fixed Delivery Date: 6/10/2026 All Epics by 6/10/2026: 75% Forecast: 1 feature (10 Work Items) 0 60% (6/10)":
  <h3

[Killed] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:125:31
 				return;
 			}
 			setActiveTab(nextTab);
-			if (nextTab === "metrics") {
-				loadMetricsHistory();
-			}
+			if (nextTab === "metrics") {}
 		},
 		[isMetricsTabDisabled, loadMetricsHistory],
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:133:32
 	);
 
 	const handleShowFeatureDetails = useCallback(
-		async (feature: IFeature) => {
-			setSelectedFeature(feature);
-			setFeatureWorkItems([]);
-			setIsWorkItemsDialogOpen(true);
-
-			const items = await featureService.getFeatureWorkItems(feature.id);
-			setFeatureWorkItems(items);
-		},
+		async (feature: IFeature) => {},
 		[featureService],
 	);

[NoCoverage] ArrayDeclaration
Detail/Components/DeliveryGrid/DeliverySection.tsx:135:24
 	const handleShowFeatureDetails = useCallback(
 		async (feature: IFeature) => {
 			setSelectedFeature(feature);
-			setFeatureWorkItems([]);
+			setFeatureWorkItems(["Stryker was here"]);
 			setIsWorkItemsDialogOpen(true);
 

[NoCoverage] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:136:29
 		async (feature: IFeature) => {
 			setSelectedFeature(feature);
 			setFeatureWorkItems([]);
-			setIsWorkItemsDialogOpen(true);
+			setIsWorkItemsDialogOpen(false);
 
 			const items = await featureService.getFeatureWorkItems(feature.id);

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:144:43
 		[featureService],
 	);
 
-	const handleCloseWorkItemsDialog = () => {
-		setIsWorkItemsDialogOpen(false);
-		setSelectedFeature(null);
-	};
+	const handleCloseWorkItemsDialog = () => {};
 
 	const { getTerm } = useTerminology();

[NoCoverage] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:145:28
 	);
 
 	const handleCloseWorkItemsDialog = () => {
-		setIsWorkItemsDialogOpen(false);
+		setIsWorkItemsDialogOpen(true);
 		setSelectedFeature(null);
 	};

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:159:56
 	// The grid hands back the ids in the order the reader is looking at them, so the file is sorted
 	// and filtered the way the screen is.
 	const exportTable = useCallback(
-		(orderedRowIds: GridRowId[]): DataGridExportTable => {
-			const featureById = new Map(
-				features.map((feature) => [feature.id, feature]),
-			);
-			const orderedFeatures = orderedRowIds
-				.map((rowId) => featureById.get(Number(rowId)))
-				.filter((feature): feature is IFeature => feature !== undefined);
-
-			return buildDeliveryExportTable(delivery, orderedFeatures, teams, {
-				deliveryTerm,
-				workItemsTerm,
-				featureTerm,
-				portfolioTerm,
-			});
-		},
+		(orderedRowIds: GridRowId[]): DataGridExportTable => {},
 		[
 			delivery,

[NoCoverage] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:161:18
 	const exportTable = useCallback(
 		(orderedRowIds: GridRowId[]): DataGridExportTable => {
 			const featureById = new Map(
-				features.map((feature) => [feature.id, feature]),
+				features.map(() => undefined),
 			);
 			const orderedFeatures = orderedRowIds

[NoCoverage] MethodExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:163:28
 			const featureById = new Map(
 				features.map((feature) => [feature.id, feature]),
 			);
-			const orderedFeatures = orderedRowIds
-				.map((rowId) => featureById.get(Number(rowId)))
-				.filter((feature): feature is IFeature => feature !== undefined);
+			const orderedFeatures = orderedRowIds.map(rowId => featureById.get(Number(rowId)));
 
 			return buildDeliveryExportTable(delivery, orderedFeatures, teams, {

[NoCoverage] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:164:10
 				features.map((feature) => [feature.id, feature]),
 			);
 			const orderedFeatures = orderedRowIds
-				.map((rowId) => featureById.get(Number(rowId)))
+				.map(() => undefined)
 				.filter((feature): feature is IFeature => feature !== undefined);
 

[NoCoverage] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:165:47
 			);
 			const orderedFeatures = orderedRowIds
 				.map((rowId) => featureById.get(Number(rowId)))
-				.filter((feature): feature is IFeature => feature !== undefined);
+				.filter((feature): feature is IFeature => false);
 
 			return buildDeliveryExportTable(delivery, orderedFeatures, teams, {

[NoCoverage] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:165:47
 			);
 			const orderedFeatures = orderedRowIds
 				.map((rowId) => featureById.get(Number(rowId)))
-				.filter((feature): feature is IFeature => feature !== undefined);
+				.filter((feature): feature is IFeature => feature === undefined);
 
 			return buildDeliveryExportTable(delivery, orderedFeatures, teams, {

[Survived] ArrayDeclaration
Detail/Components/DeliveryGrid/DeliverySection.tsx:174:3
 				portfolioTerm,
 			});
 		},
-		[
-			delivery,
-			features,
-			teams,
-			deliveryTerm,
-			workItemsTerm,
-			featureTerm,
-			portfolioTerm,
-		],
+		[],
 	);
 

[Survived] LogicalOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:186:3
 	);
 
 	const isRuleBased =
-		delivery.selectionMode === DeliverySelectionMode.RuleBased ||
-		(delivery.selectionMode as unknown as string) === "RuleBased";
+		delivery.selectionMode === DeliverySelectionMode.RuleBased && delivery.selectionMode as unknown as string === "RuleBased";
 
 	const formatDate = (date: Date): string => {

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:186:3
 	);
 
 	const isRuleBased =
-		delivery.selectionMode === DeliverySelectionMode.RuleBased ||
+		delivery.selectionMode !== DeliverySelectionMode.RuleBased ||
 		(delivery.selectionMode as unknown as string) === "RuleBased";
 

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:187:3
 
 	const isRuleBased =
 		delivery.selectionMode === DeliverySelectionMode.RuleBased ||
-		(delivery.selectionMode as unknown as string) === "RuleBased";
+		false;
 
 	const formatDate = (date: Date): string => {

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:187:3
 
 	const isRuleBased =
 		delivery.selectionMode === DeliverySelectionMode.RuleBased ||
-		(delivery.selectionMode as unknown as string) === "RuleBased";
+		delivery.selectionMode as unknown as string !== "RuleBased";
 
 	const formatDate = (date: Date): string => {

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:189:45
 		delivery.selectionMode === DeliverySelectionMode.RuleBased ||
 		(delivery.selectionMode as unknown as string) === "RuleBased";
 
-	const formatDate = (date: Date): string => {
-		return new Date(date).toLocaleDateString("en-US", {
-			month: "short",
-			day: "numeric",
-			year: "numeric",
-		});
-	};
+	const formatDate = (date: Date): string => {};
 
 	const columns: DataGridColumn<IFeature & GridValidRowModel>[] = useMemo(

[NoCoverage] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:190:44
 		(delivery.selectionMode as unknown as string) === "RuleBased";
 
 	const formatDate = (date: Date): string => {
-		return new Date(date).toLocaleDateString("en-US", {
+		return new Date(date).toLocaleDateString("", {
 			month: "short",
 			day: "numeric",

[NoCoverage] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:190:53
 		(delivery.selectionMode as unknown as string) === "RuleBased";
 
 	const formatDate = (date: Date): string => {
-		return new Date(date).toLocaleDateString("en-US", {
-			month: "short",
-			day: "numeric",
-			year: "numeric",
-		});
+		return new Date(date).toLocaleDateString("en-US", {});
 	};
 

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:202:15
 			{
 				field: "name",
 				headerName: `${featureTerm} Name`,
-				hideable: false,
+				hideable: true,
 				minWidth: 120,
 				flex: 1,

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:205:17
 				hideable: false,
 				minWidth: 120,
 				flex: 1,
-				renderCell: ({ row }) => (
-					<FeatureName
-						name={getWorkItemName(row.name, row.referenceId)}
-						url={row.url ?? ""}
-					/>
-				),
+				renderCell: () => undefined,
 			},
 			{

[Survived] LogicalOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:208:12
 				renderCell: ({ row }) => (
 					<FeatureName
 						name={getWorkItemName(row.name, row.referenceId)}
-						url={row.url ?? ""}
+						url={row.url && ""}
 					/>
 				),

[Survived] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:217:30
 				headerName: "Team",
 				minWidth: 100,
 				flex: 0.5,
-				renderCell: ({ row }) => {
-					const teamsWithWork = teams.filter(
-						(team) => row.getTotalWorkForTeam(team.id) > 0,
-					);
-
-					if (teamsWithWork.length === 0) {
-						return (
-							<Typography variant="body2" color="text.secondary">
-								Unassigned
-							</Typography>
-						);
-					}
-
-					return (
-						<Box sx={{ display: "flex", flexDirection: "column", gap: 0.5 }}>
-							{teamsWithWork.map((team) => (
-								<StyledLink key={team.id} to={`/teams/${team.id}`}>
-									<Typography variant="body2">{team.name}</Typography>
-								</StyledLink>
-							))}
-						</Box>
-					);
-				},
+				renderCell: ({ row }) => {},
 			},
 			{

[Survived] MethodExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:218:28
 				minWidth: 100,
 				flex: 0.5,
 				renderCell: ({ row }) => {
-					const teamsWithWork = teams.filter(
-						(team) => row.getTotalWorkForTeam(team.id) > 0,
-					);
+					const teamsWithWork = teams;
 
 					if (teamsWithWork.length === 0) {

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:219:17
 				flex: 0.5,
 				renderCell: ({ row }) => {
 					const teamsWithWork = teams.filter(
-						(team) => row.getTotalWorkForTeam(team.id) > 0,
+						(team) => row.getTotalWorkForTeam(team.id) <= 0,
 					);
 

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:219:17
 				flex: 0.5,
 				renderCell: ({ row }) => {
 					const teamsWithWork = teams.filter(
-						(team) => row.getTotalWorkForTeam(team.id) > 0,
+						(team) => row.getTotalWorkForTeam(team.id) >= 0,
 					);
 

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:222:10
 						(team) => row.getTotalWorkForTeam(team.id) > 0,
 					);
 
-					if (teamsWithWork.length === 0) {
+					if (false) {
 						return (
 							<Typography variant="body2" color="text.secondary">

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:222:10
 						(team) => row.getTotalWorkForTeam(team.id) > 0,
 					);
 
-					if (teamsWithWork.length === 0) {
+					if (teamsWithWork.length !== 0) {
 						return (
 							<Typography variant="body2" color="text.secondary">

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:231:50
 					}
 
 					return (
-						<Box sx={{ display: "flex", flexDirection: "column", gap: 0.5 }}>
+						<Box sx={{ display: "flex", flexDirection: "", gap: 0.5 }}>
 							{teamsWithWork.map((team) => (
 								<StyledLink key={team.id} to={`/teams/${team.id}`}>

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:232:27
 
 					return (
 						<Box sx={{ display: "flex", flexDirection: "column", gap: 0.5 }}>
-							{teamsWithWork.map((team) => (
-								<StyledLink key={team.id} to={`/teams/${team.id}`}>
-									<Typography variant="body2">{team.name}</Typography>
-								</StyledLink>
-							))}
+							{teamsWithWork.map(() => undefined)}
 						</Box>
 					);

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:233:39
 					return (
 						<Box sx={{ display: "flex", flexDirection: "column", gap: 0.5 }}>
 							{teamsWithWork.map((team) => (
-								<StyledLink key={team.id} to={`/teams/${team.id}`}>
+								<StyledLink key={team.id} to={``}>
 									<Typography variant="body2">{team.name}</Typography>
 								</StyledLink>

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:241:4
 					);
 				},
 			},
-			{
-				field: "progress",
-				headerName: "Progress",
-				minWidth: 200,
-				flex: 1,
-				sortable: false,
-				renderCell: ({ row }) => (
-					<FeatureProgressIndicator
-						feature={row}
-						teams={teams}
-						onShowDetails={() => handleShowFeatureDetails(row)}
-					/>
-				),
-			},
+			{},
 			{
 				...createForecastsColumn("Forecast"),

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:246:15
 				headerName: "Progress",
 				minWidth: 200,
 				flex: 1,
-				sortable: false,
+				sortable: true,
 				renderCell: ({ row }) => (
 					<FeatureProgressIndicator

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:247:17
 				minWidth: 200,
 				flex: 1,
 				sortable: false,
-				renderCell: ({ row }) => (
-					<FeatureProgressIndicator
-						feature={row}
-						teams={teams}
-						onShowDetails={() => handleShowFeatureDetails(row)}
-					/>
-				),
+				renderCell: () => undefined,
 			},
 			{

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:251:22
 					<FeatureProgressIndicator
 						feature={row}
 						teams={teams}
-						onShowDetails={() => handleShowFeatureDetails(row)}
+						onShowDetails={() => undefined}
 					/>
 				),

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:266:15
 				headerName: MARGINAL_LIKELIHOOD_HEADER,
 				minWidth: 110,
 				flex: 0.3,
-				sortable: false,
+				sortable: true,
 				renderCell: ({ row }) =>
 					delivery.featureLikelihoods

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:267:17
 				minWidth: 110,
 				flex: 0.3,
 				sortable: false,
-				renderCell: ({ row }) =>
-					delivery.featureLikelihoods
-						.filter((fl) => fl.featureId === row.id)
-						.map((fl) => (
-							<FeatureLikelihoodChip
-								key={fl.featureId}
-								featureLikelihood={fl}
-								hasRemainingWork={row.getRemainingWorkForFeature() > 0}
-							/>
-						)),
+				renderCell: () => undefined,
 			},
 			createStateColumn(),

[Survived] MethodExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:268:6
 				flex: 0.3,
 				sortable: false,
 				renderCell: ({ row }) =>
-					delivery.featureLikelihoods
-						.filter((fl) => fl.featureId === row.id)
+					delivery.featureLikelihoods
 						.map((fl) => (
 							<FeatureLikelihoodChip

[NoCoverage] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:269:23
 				sortable: false,
 				renderCell: ({ row }) =>
 					delivery.featureLikelihoods
-						.filter((fl) => fl.featureId === row.id)
+						.filter((fl) => fl.featureId !== row.id)
 						.map((fl) => (
 							<FeatureLikelihoodChip

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:269:15
 				sortable: false,
 				renderCell: ({ row }) =>
 					delivery.featureLikelihoods
-						.filter((fl) => fl.featureId === row.id)
+						.filter(() => undefined)
 						.map((fl) => (
 							<FeatureLikelihoodChip

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:270:12
 				renderCell: ({ row }) =>
 					delivery.featureLikelihoods
 						.filter((fl) => fl.featureId === row.id)
-						.map((fl) => (
-							<FeatureLikelihoodChip
-								key={fl.featureId}
-								featureLikelihood={fl}
-								hasRemainingWork={row.getRemainingWorkForFeature() > 0}
-							/>
-						)),
+						.map(() => undefined),
 			},
 			createStateColumn(),

[NoCoverage] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:274:27
 							<FeatureLikelihoodChip
 								key={fl.featureId}
 								featureLikelihood={fl}
-								hasRemainingWork={row.getRemainingWorkForFeature() > 0}
+								hasRemainingWork={true}
 							/>
 						)),

[NoCoverage] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:274:27
 							<FeatureLikelihoodChip
 								key={fl.featureId}
 								featureLikelihood={fl}
-								hasRemainingWork={row.getRemainingWorkForFeature() > 0}
+								hasRemainingWork={row.getRemainingWorkForFeature() <= 0}
 							/>
 						)),

[Survived] LogicalOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:285:31
 
 	const forecastLevel = new ForecastLevel(delivery.likelihoodPercentage);
 
-	const teamsWithoutForecast = delivery.teamsWithoutForecast ?? [];
+	const teamsWithoutForecast = delivery.teamsWithoutForecast && [];
 	const deliveryLikelihood = delivery.likelihoodPercentage;
 	const deliveryCannotBeForecast =

[Survived] ArrayDeclaration
Detail/Components/DeliveryGrid/DeliverySection.tsx:285:64
 
 	const forecastLevel = new ForecastLevel(delivery.likelihoodPercentage);
 
-	const teamsWithoutForecast = delivery.teamsWithoutForecast ?? [];
+	const teamsWithoutForecast = delivery.teamsWithoutForecast ?? ["Stryker was here"];
 	const deliveryLikelihood = delivery.likelihoodPercentage;
 	const deliveryCannotBeForecast =

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:288:3
 	const teamsWithoutForecast = delivery.teamsWithoutForecast ?? [];
 	const deliveryLikelihood = delivery.likelihoodPercentage;
 	const deliveryCannotBeForecast =
-		cannotBeForecast({ teamsWithoutForecast }) || deliveryLikelihood === null;
+		false;
 
 	const hasInsufficientData = isForecastDataInsufficient({

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:288:3
 	const teamsWithoutForecast = delivery.teamsWithoutForecast ?? [];
 	const deliveryLikelihood = delivery.likelihoodPercentage;
 	const deliveryCannotBeForecast =
-		cannotBeForecast({ teamsWithoutForecast }) || deliveryLikelihood === null;
+		true;
 
 	const hasInsufficientData = isForecastDataInsufficient({

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:291:21
 		cannotBeForecast({ teamsWithoutForecast }) || deliveryLikelihood === null;
 
 	const hasInsufficientData = isForecastDataInsufficient({
-		hasRemainingWork: delivery.remainingWork > 0,
+		hasRemainingWork: delivery.remainingWork <= 0,
 		hasSufficientData: delivery.hasSufficientData,
 	});

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:291:21
 		cannotBeForecast({ teamsWithoutForecast }) || deliveryLikelihood === null;
 
 	const hasInsufficientData = isForecastDataInsufficient({
-		hasRemainingWork: delivery.remainingWork > 0,
+		hasRemainingWork: delivery.remainingWork >= 0,
 		hasSufficientData: delivery.hasSufficientData,
 	});

[Survived] LogicalOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:295:6
 		hasSufficientData: delivery.hasSufficientData,
 	});
 	let likelihoodLabel: string;
-	if (deliveryCannotBeForecast || deliveryLikelihood === null) {
+	if (deliveryCannotBeForecast && deliveryLikelihood === null) {
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
 	} else if (hasInsufficientData) {

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:295:6
 		hasSufficientData: delivery.hasSufficientData,
 	});
 	let likelihoodLabel: string;
-	if (deliveryCannotBeForecast || deliveryLikelihood === null) {
+	if (false) {
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
 	} else if (hasInsufficientData) {

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:297:34
 	let likelihoodLabel: string;
 	if (deliveryCannotBeForecast || deliveryLikelihood === null) {
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
-	} else if (hasInsufficientData) {
-		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
-	} else {
+	} else if (hasInsufficientData) {} else {
 		likelihoodLabel = jointLikelihoodLabel({
 			term: featuresTerm,

[Survived] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:299:9
 		likelihoodLabel = CANNOT_FORECAST_SHORT;
 	} else if (hasInsufficientData) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
-	} else {
-		likelihoodLabel = jointLikelihoodLabel({
-			term: featuresTerm,
-			date: delivery.getFormattedDate(),
-			value: formatLikelihood(deliveryLikelihood, {
-				hasRemainingWork: delivery.remainingWork > 0,
-				precision: "round",
-			}),
-		});
-	}
+	} else {}
 
 	return (

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:300:42
 	} else if (hasInsufficientData) {
 		likelihoodLabel = INSUFFICIENT_FORECAST_DATA_SHORT;
 	} else {
-		likelihoodLabel = jointLikelihoodLabel({
-			term: featuresTerm,
-			date: delivery.getFormattedDate(),
-			value: formatLikelihood(deliveryLikelihood, {
-				hasRemainingWork: delivery.remainingWork > 0,
-				precision: "round",
-			}),
-		});
+		likelihoodLabel = jointLikelihoodLabel({});
 	}
 

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:303:48
 		likelihoodLabel = jointLikelihoodLabel({
 			term: featuresTerm,
 			date: delivery.getFormattedDate(),
-			value: formatLikelihood(deliveryLikelihood, {
-				hasRemainingWork: delivery.remainingWork > 0,
-				precision: "round",
-			}),
+			value: formatLikelihood(deliveryLikelihood, {}),
 		});
 	}

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:304:23
 			term: featuresTerm,
 			date: delivery.getFormattedDate(),
 			value: formatLikelihood(deliveryLikelihood, {
-				hasRemainingWork: delivery.remainingWork > 0,
+				hasRemainingWork: delivery.remainingWork >= 0,
 				precision: "round",
 			}),

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:304:23
 			term: featuresTerm,
 			date: delivery.getFormattedDate(),
 			value: formatLikelihood(deliveryLikelihood, {
-				hasRemainingWork: delivery.remainingWork > 0,
+				hasRemainingWork: delivery.remainingWork <= 0,
 				precision: "round",
 			}),

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:311:47
 	}
 
 	return (
-		<Paper elevation={1} sx={{ mb: 2, overflow: "hidden" }}>
+		<Paper elevation={1} sx={{ mb: 2, overflow: "" }}>
 			<Box sx={{ position: "relative" }}>
 				<Accordion

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:315:16
 			<Box sx={{ position: "relative" }}>
 				<Accordion
 					expanded={isExpanded}
-					onChange={() => onToggleExpanded(delivery.id)}
+					onChange={() => undefined}
 					sx={{ overflow: "hidden" }}
 					slotProps={{

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:318:19
 					onChange={() => onToggleExpanded(delivery.id)}
 					sx={{ overflow: "hidden" }}
 					slotProps={{
-						transition: {
-							unmountOnExit: false,
-						},
+						transition: {},
 					}}
 				>

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:319:23
 					sx={{ overflow: "hidden" }}
 					slotProps={{
 						transition: {
-							unmountOnExit: false,
+							unmountOnExit: true,
 						},
 					}}

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:333:17
 							},
 							"& .MuiAccordionSummary-content": {
 								alignItems: "center",
-								margin: "12px 0",
+								margin: "",
 								"&.Mui-expanded": {
 									margin: "12px 0",

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:334:27
 							"& .MuiAccordionSummary-content": {
 								alignItems: "center",
 								margin: "12px 0",
-								"&.Mui-expanded": {
-									margin: "12px 0",
-								},
+								"&.Mui-expanded": {},
 							},
 							pr: 15,

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:357:14
 								<Tooltip
 									title={
 										canArchive
-											? `Archive ${deliveryTerm}`
+											? ``
 											: PREMIUM_UPGRADE_TOOLTIP
 									}

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:366:22
 									<span>
 										<IconButton
 											size="small"
-											disabled={!canArchive}
+											disabled={canArchive}
 											onClick={(e) => {
 												e.stopPropagation();
killedBy: PortfolioDeliveryView - retiring a Delivery asks before archiving, and archives on the version it is looking at
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  aria-label="archive"
  class="MuiButtonBase-root Mui-disabled MuiIconButton-root Mui-disabled MuiIconButton-sizeSmall css-sctndk-MuiButtonBase-root-MuiIconButton-root"
  disabled=""
  tabindex="-1"

[Killed] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:367:28
 										<IconButton
 											size="small"
 											disabled={!canArchive}
-											onClick={(e) => {
-												e.stopPropagation();
-												onArchive?.(delivery);
-											}}
+											onClick={(e) => {}}
 											aria-label="archive"
 											sx={{
killedBy: PortfolioDeliveryView - retiring a Delivery asks before archiving, and archives on the version it is looking at
statusReason: Unable to find an element with the text: /bring it back/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Survived] OptionalChaining
Detail/Components/DeliveryGrid/DeliverySection.tsx:369:13
 											disabled={!canArchive}
 											onClick={(e) => {
 												e.stopPropagation();
-												onArchive?.(delivery);
+												onArchive(delivery);
 											}}
 											aria-label="archive"

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:372:16
 												onArchive?.(delivery);
 											}}
 											aria-label="archive"
-											sx={{
-												bgcolor: "background.paper",
-												"&:hover": {
-													bgcolor: "primary.light",
-												},
-											}}
+											sx={{}}
 										>
 											<ArchiveIcon />

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:385:26
 								</Tooltip>
 								<IconButton
 									size="small"
-									onClick={(e) => {
-										e.stopPropagation();
-										onEdit(delivery);
-									}}
+									onClick={(e) => {}}
 									aria-label="edit"
 									sx={{

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:392:22
 									aria-label="edit"
 									sx={{
 										bgcolor: "background.paper",
-										"&:hover": {
-											bgcolor: "primary.light",
-										},
+										"&:hover": {},
 									}}
 								>
