[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:401:26
 								</IconButton>
 								<IconButton
 									size="small"
-									onClick={(e) => {
-										e.stopPropagation();
-										onDelete(delivery);
-									}}
+									onClick={(e) => {}}
 									aria-label="delete"
 									sx={{

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:409:21
 									sx={{
 										bgcolor: "background.paper",
 										"&:hover": {
-											bgcolor: "error.light",
+											bgcolor: "",
 										},
 									}}

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:419:18
 						)}
 						<Box
 							sx={{
-								display: "flex",
+								display: "",
 								flexDirection: "column",
 								width: "100%",

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:426:13
 							}}
 						>
 							<Box
-								sx={{
-									display: "flex",
-									alignItems: "center",
-									justifyContent: "space-between",
-									width: "100%",
-									gap: 4,
-								}}
+								sx={{}}
 							>
 								<Box

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:435:14
 								}}
 							>
 								<Box
-									sx={{
-										display: "flex",
-										flexDirection: "column",
-										gap: 1,
-										flex: 1,
-									}}
+									sx={{}}
 								>
 									<Box

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:443:15
 									}}
 								>
 									<Box
-										sx={{
-											display: "flex",
-											alignItems: "center",
-											gap: 2,
-											flexShrink: 0,
-										}}
+										sx={{}}
 									>
 										<Typography variant="h6" component="h3">

[NoCoverage] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:456:16
 										<Tooltip
 											title={
 												isRuleBased
-													? "Rule-Based: Features automatically update based on rules"
+													? ""
 													: "Manual: Features are fixed"
 											}

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:460:32
 													: "Manual: Features are fixed"
 											}
 										>
-											<Box sx={{ display: "flex", alignItems: "center" }}>
+											<Box sx={{ display: "", alignItems: "center" }}>
 												{isRuleBased ? (
 													<AutoModeIcon

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:460:52
 													: "Manual: Features are fixed"
 											}
 										>
-											<Box sx={{ display: "flex", alignItems: "center" }}>
+											<Box sx={{ display: "flex", alignItems: "" }}>
 												{isRuleBased ? (
 													<AutoModeIcon

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:469:19
 												) : (
 													<TouchAppIcon
 														fontSize="small"
-														sx={{ color: "text.secondary" }}
+														sx={{}}
 													/>
 												)}

[Survived] ArrowFunction
Detail/Components/DeliveryGrid/DeliverySection.tsx:503:41
 										<Typography variant="body2" color="text.secondary">
 											Forecast:
 										</Typography>
-										{delivery.completionDates.map((forecast) => (
-											<Chip
-												key={forecast.probability}
-												label={`${forecast.probability}%: ${formatDate(forecast.expectedDate)}`}
-												size="small"
-												variant="outlined"
-											/>
-										))}
+										{delivery.completionDates.map(() => undefined)}
 									</Box>
 								</Box>

[NoCoverage] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:506:20
 										{delivery.completionDates.map((forecast) => (
 											<Chip
 												key={forecast.probability}
-												label={`${forecast.probability}%: ${formatDate(forecast.expectedDate)}`}
+												label={``}
 												size="small"
 												variant="outlined"

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:514:14
 									</Box>
 								</Box>
 								<Box
-									sx={{
-										display: "flex",
-										alignItems: "center",
-										justifyContent: "center",
-										minWidth: 200,
-										flex: 1,
-									}}
+									sx={{}}
 								>
 									<ProgressIndicator

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:523:51
 									}}
 								>
 									<ProgressIndicator
-										title={`${delivery.getFeatureCount()} ${delivery.getFeatureCount() === 1 ? featureTerm : featuresTerm} (${delivery.totalWork} ${workItemsTerm})`}
+										title={`${delivery.getFeatureCount()} ${delivery.getFeatureCount() !== 1 ? featureTerm : featuresTerm} (${delivery.totalWork} ${workItemsTerm})`}
 										progressableItem={{
 											remainingWork: delivery.remainingWork,

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:523:51
 									}}
 								>
 									<ProgressIndicator
-										title={`${delivery.getFeatureCount()} ${delivery.getFeatureCount() === 1 ? featureTerm : featuresTerm} (${delivery.totalWork} ${workItemsTerm})`}
+										title={`${delivery.getFeatureCount()} ${true ? featureTerm : featuresTerm} (${delivery.totalWork} ${workItemsTerm})`}
 										progressableItem={{
 											remainingWork: delivery.remainingWork,

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:553:41
 												: ""
 										}
 									>
-										<span style={{ pointerEvents: "auto" }}>Metrics</span>
+										<span style={{ pointerEvents: "" }}>Metrics</span>
 									</Tooltip>
 								}

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:560:8
 							{/* Always enabled: unlike Metrics, a note needs no accumulated history. */}
 							<Tab label="Notes" value="notes" />
 						</Tabs>
-						{activeTab === "workItems" && (
-							<WorkItemsTab
-								isLoadingFeatures={isLoadingFeatures}
-								features={features}
-								columns={columns}
-								deliveryId={delivery.id}
-								featuresTerm={featuresTerm}
-								deliveryTerm={deliveryTerm}
-								exportFileName={delivery.name}
-								exportTable={exportTable}
-							/>
-						)}
+						{true}
 						{activeTab === "metrics" && (
 							<DeliveryMetricsTab

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:560:8
 							{/* Always enabled: unlike Metrics, a note needs no accumulated history. */}
 							<Tab label="Notes" value="notes" />
 						</Tabs>
-						{activeTab === "workItems" && (
+						{true && (
 							<WorkItemsTab
 								isLoadingFeatures={isLoadingFeatures}

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:572:8
 								exportTable={exportTable}
 							/>
 						)}
-						{activeTab === "metrics" && (
+						{activeTab !== "metrics" && (
 							<DeliveryMetricsTab
 								isLoading={isLoadingMetrics}
killedBy: DeliverySection Metrics tab renders the burnup chart for community users without a premium license
statusReason: Unable to find an element by: [data-testid="burnup-chart"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Survived] LogicalOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:580:8
 								featuresTerm={featuresTerm}
 							/>
 						)}
-						{activeTab === "notes" && (
-							<DeliveryNotesPanel deliveryId={delivery.id} canWrite={canEdit} />
-						)}
+						{activeTab === "notes" || <DeliveryNotesPanel deliveryId={delivery.id} canWrite={canEdit} />}
 					</AccordionDetails>
 				</Accordion>

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:586:5
 					</AccordionDetails>
 				</Accordion>
 			</Box>
-			{selectedFeature && (
-				<WorkItemsDialog
-					title={`${getWorkItemName(selectedFeature.name, selectedFeature.referenceId)} ${workItemsTerm}`}
-					items={featureWorkItems}
-					open={isWorkItemsDialogOpen}
-					onClose={handleCloseWorkItemsDialog}
-				/>
-			)}
+			{false}
 		</Paper>
 	);

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:586:5
 					</AccordionDetails>
 				</Accordion>
 			</Box>
-			{selectedFeature && (
-				<WorkItemsDialog
-					title={`${getWorkItemName(selectedFeature.name, selectedFeature.referenceId)} ${workItemsTerm}`}
-					items={featureWorkItems}
-					open={isWorkItemsDialogOpen}
-					onClose={handleCloseWorkItemsDialog}
-				/>
-			)}
+			{true}
 		</Paper>
 	);

[NoCoverage] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:588:13
 			</Box>
 			{selectedFeature && (
 				<WorkItemsDialog
-					title={`${getWorkItemName(selectedFeature.name, selectedFeature.referenceId)} ${workItemsTerm}`}
+					title={``}
 					items={featureWorkItems}
 					open={isWorkItemsDialogOpen}

[NoCoverage] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:619:25
 	exportFileName,
 	exportTable,
 }) => {
-	if (isLoadingFeatures) {
-		return (
-			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
-				{`Loading ${featuresTerm}...`}
-			</Typography>
-		);
-	}
+	if (isLoadingFeatures) {}
 
 	if (features.length === 0) {

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:619:6
 	exportFileName,
 	exportTable,
 }) => {
-	if (isLoadingFeatures) {
+	if (true) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>

[NoCoverage] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:622:6
 	if (isLoadingFeatures) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
-				{`Loading ${featuresTerm}...`}
+				{``}
 			</Typography>
 		);

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:627:6
 		);
 	}
 
-	if (features.length === 0) {
+	if (false) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>

[Survived] BlockStatement
Detail/Components/DeliveryGrid/DeliverySection.tsx:627:29
 		);
 	}
 
-	if (features.length === 0) {
-		return (
-			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
-				No {featuresTerm} in this {deliveryTerm}.
-			</Typography>
-		);
-	}
+	if (features.length === 0) {}
 
 	return (

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:636:12
 	}
 
 	return (
-		<Box sx={{ mx: 2, mb: 2, mt: 2 }}>
+		<Box sx={{}}>
 			<FeatureListDataGrid
 				features={features}

[Survived] StringLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:640:17
 			<FeatureListDataGrid
 				features={features}
 				columns={columns}
-				storageKey={`delivery-features-${deliveryId}`}
+				storageKey={``}
 				hideCompletedStorageKey={`lighthouse_hide_completed_features_delivery_${deliveryId}`}
 				loading={false}

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:642:14
 				columns={columns}
 				storageKey={`delivery-features-${deliveryId}`}
 				hideCompletedStorageKey={`lighthouse_hide_completed_features_delivery_${deliveryId}`}
-				loading={false}
+				loading={true}
 				emptyStateMessage={`No ${featuresTerm} found`}
 				enableExport={true}

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:644:19
 				hideCompletedStorageKey={`lighthouse_hide_completed_features_delivery_${deliveryId}`}
 				loading={false}
 				emptyStateMessage={`No ${featuresTerm} found`}
-				enableExport={true}
+				enableExport={false}
 				exportFileName={exportFileName}
 				exportTable={exportTable}
