[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliveryExportTable.ts:31:2
 
 const HEADERS = [
 	"Name",
-	"Team",
+	"",
 	"Progress",
 	...FORECAST_PROBABILITIES.map((probability) => `Forecast ${probability}%`),
killedBy: buildDeliveryExportTable names the same eleven columns in the same order every time
statusReason: expected [ 'Name', '', 'Progress', …(8) ] to deeply equal [ 'Name', 'Team', 'Progress', …(8) ]

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:33:32
 	"Name",
 	"Team",
 	"Progress",
-	...FORECAST_PROBABILITIES.map((probability) => `Forecast ${probability}%`),
+	...FORECAST_PROBABILITIES.map(() => undefined),
 	"Likelihood",
 	"State",
killedBy: buildDeliveryExportTable names the same eleven columns in the same order every time
statusReason: expected [ 'Name', 'Team', 'Progress', …(8) ] to deeply equal [ 'Name', 'Team', 'Progress', …(8) ]

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliveryExportTable.ts:33:49
 	"Name",
 	"Team",
 	"Progress",
-	...FORECAST_PROBABILITIES.map((probability) => `Forecast ${probability}%`),
+	...FORECAST_PROBABILITIES.map((probability) => ``),
 	"Likelihood",
 	"State",
killedBy: buildDeliveryExportTable names the same eleven columns in the same order every time
statusReason: expected [ Array(11) ] to deeply equal [ 'Name', 'Team', 'Progress', …(8) ]

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:45:14
 const dateFor = (
 	forecasts: readonly IWhenForecast[],
 	probability: number,
-): string => {
-	const forecast = forecasts.find(
-		(candidate) => candidate.probability === probability,
-	);
-	return forecast
-		? formatLocalDate(new Date(forecast.expectedDate))
-		: NOTHING_TO_SAY;
-};
+): string => {};
 
 const progress = (total: number, remaining: number): string =>
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:47:18
 	probability: number,
 ): string => {
 	const forecast = forecasts.find(
-		(candidate) => candidate.probability === probability,
+		(candidate) => false,
 	);
 	return forecast
killedBy: buildDeliveryExportTable the Delivery's own row dates each of its four forecasts as a calendar day
statusReason: expected '' to be '2026-09-01' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:47:18
 	probability: number,
 ): string => {
 	const forecast = forecasts.find(
-		(candidate) => candidate.probability === probability,
+		(candidate) => candidate.probability !== probability,
 	);
 	return forecast
killedBy: buildDeliveryExportTable the Delivery's own row dates each of its four forecasts as a calendar day
statusReason: expected '2026-09-05' to be '2026-09-01' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:54:18
 		: NOTHING_TO_SAY;
 };
 
-const progress = (total: number, remaining: number): string =>
-	`${total - remaining}/${total}`;
+const progress = () => undefined;
 
 const deliveryRow = (
killedBy: buildDeliveryExportTable the Delivery's own row counts the work done against the work there is
statusReason: expected undefined to be '72/120' // Object.is equality

[Killed] ArithmeticOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:55:5
 };
 
 const progress = (total: number, remaining: number): string =>
-	`${total - remaining}/${total}`;
+	`${total + remaining}/${total}`;
 
 const deliveryRow = (
killedBy: buildDeliveryExportTable the Delivery's own row counts the work done against the work there is
statusReason: expected '168/120' to be '72/120' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:57:21
 const progress = (total: number, remaining: number): string =>
 	`${total - remaining}/${total}`;
 
-const deliveryRow = (
-	delivery: IDelivery,
-	{ deliveryTerm }: DeliveryExportTerms,
-): string[] => [
-	`${delivery.name} (${deliveryTerm})`,
-	NOTHING_TO_SAY,
-	progress(delivery.totalWork, delivery.remainingWork),
-	...FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(delivery.completionDates ?? [], probability),
-	),
-	delivery.likelihoodPercentage === null ||
-	delivery.likelihoodPercentage === undefined
-		? NOTHING_TO_SAY
-		: `${Math.round(delivery.likelihoodPercentage)}%`,
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-];
+const deliveryRow = () => undefined;
 
 const teamsOn = (feature: IFeature, teams: IEntityReference[]): string => {
killedBy: buildDeliveryExportTable the Delivery's own row comes first, and says which of the rows is the Delivery
statusReason: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliveryExportTable.ts:61:2
 	delivery: IDelivery,
 	{ deliveryTerm }: DeliveryExportTerms,
 ): string[] => [
-	`${delivery.name} (${deliveryTerm})`,
+	``,
 	NOTHING_TO_SAY,
 	progress(delivery.totalWork, delivery.remainingWork),
killedBy: buildDeliveryExportTable the Delivery's own row comes first, and says which of the rows is the Delivery
statusReason: expected '' to be 'Q3 Platform (Delivery)' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:64:32
 	`${delivery.name} (${deliveryTerm})`,
 	NOTHING_TO_SAY,
 	progress(delivery.totalWork, delivery.remainingWork),
-	...FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(delivery.completionDates ?? [], probability),
+	...FORECAST_PROBABILITIES.map(() => undefined,
 	),
 	delivery.likelihoodPercentage === null ||
killedBy: buildDeliveryExportTable the Delivery's own row dates each of its four forecasts as a calendar day
statusReason: expected undefined to be '2026-09-01' // Object.is equality

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:65:11
 	NOTHING_TO_SAY,
 	progress(delivery.totalWork, delivery.remainingWork),
 	...FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(delivery.completionDates ?? [], probability),
+		dateFor(delivery.completionDates && [], probability),
 	),
 	delivery.likelihoodPercentage === null ||
killedBy: buildDeliveryExportTable the Delivery's own row dates each of its four forecasts as a calendar day
statusReason: expected '' to be '2026-09-01' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:67:2
 	...FORECAST_PROBABILITIES.map((probability) =>
 		dateFor(delivery.completionDates ?? [], probability),
 	),
-	delivery.likelihoodPercentage === null ||
-	delivery.likelihoodPercentage === undefined
+	false
 		? NOTHING_TO_SAY
 		: `${Math.round(delivery.likelihoodPercentage)}%`,
killedBy: buildDeliveryExportTable the Delivery's own row leaves a chance nobody computed empty rather than reporting a zero
statusReason: expected '0%' to be '' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:67:2
 	...FORECAST_PROBABILITIES.map((probability) =>
 		dateFor(delivery.completionDates ?? [], probability),
 	),
-	delivery.likelihoodPercentage === null ||
+	false ||
 	delivery.likelihoodPercentage === undefined
 		? NOTHING_TO_SAY
killedBy: buildDeliveryExportTable the Delivery's own row leaves a chance nobody computed empty rather than reporting a zero
statusReason: expected '0%' to be '' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:68:2
 		dateFor(delivery.completionDates ?? [], probability),
 	),
 	delivery.likelihoodPercentage === null ||
-	delivery.likelihoodPercentage === undefined
+	delivery.likelihoodPercentage !== undefined
 		? NOTHING_TO_SAY
 		: `${Math.round(delivery.likelihoodPercentage)}%`,
killedBy: buildDeliveryExportTable the Delivery's own row rounds its chance of landing to a whole percentage
statusReason: expected '' to be '82%' // Object.is equality

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:68:2
 		dateFor(delivery.completionDates ?? [], probability),
 	),
 	delivery.likelihoodPercentage === null ||
-	delivery.likelihoodPercentage === undefined
+	false
 		? NOTHING_TO_SAY
 		: `${Math.round(delivery.likelihoodPercentage)}%`,

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliveryExportTable.ts:70:5
 	delivery.likelihoodPercentage === null ||
 	delivery.likelihoodPercentage === undefined
 		? NOTHING_TO_SAY
-		: `${Math.round(delivery.likelihoodPercentage)}%`,
+		: ``,
 	NOTHING_TO_SAY,
 	NOTHING_TO_SAY,
killedBy: buildDeliveryExportTable the Delivery's own row rounds its chance of landing to a whole percentage
statusReason: expected '' to be '82%' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:76:75
 	NOTHING_TO_SAY,
 ];
 
-const teamsOn = (feature: IFeature, teams: IEntityReference[]): string => {
-	const withWork = teams.filter(
-		(team) => feature.getTotalWorkForTeam(team.id) > 0,
-	);
-
-	return withWork.length === 0
-		? "Unassigned"
-		: withWork.map((team) => team.name).join("; ");
-};
+const teamsOn = (feature: IFeature, teams: IEntityReference[]): string => {};
 
 const forecastCells = (feature: IFeature): string[] => {
killedBy: buildDeliveryExportTable a Feature's row lists every team with work on it
statusReason: expected undefined to be 'Team Alpha; Team Beta' // Object.is equality

[Killed] MethodExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:77:19
 ];
 
 const teamsOn = (feature: IFeature, teams: IEntityReference[]): string => {
-	const withWork = teams.filter(
-		(team) => feature.getTotalWorkForTeam(team.id) > 0,
-	);
+	const withWork = teams;
 
 	return withWork.length === 0
killedBy: buildDeliveryExportTable a Feature's row says nobody is on it rather than leaving the reader to guess
statusReason: expected 'Team Alpha; Team Beta' to be 'Unassigned' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:78:13
 
 const teamsOn = (feature: IFeature, teams: IEntityReference[]): string => {
 	const withWork = teams.filter(
-		(team) => feature.getTotalWorkForTeam(team.id) > 0,
+		(team) => false,
 	);
 
killedBy: buildDeliveryExportTable a Feature's row lists every team with work on it
statusReason: expected 'Unassigned' to be 'Team Alpha; Team Beta' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:78:13
 
 const teamsOn = (feature: IFeature, teams: IEntityReference[]): string => {
 	const withWork = teams.filter(
-		(team) => feature.getTotalWorkForTeam(team.id) > 0,
+		(team) => true,
 	);
 
killedBy: buildDeliveryExportTable a Feature's row says nobody is on it rather than leaving the reader to guess
statusReason: expected 'Team Alpha; Team Beta' to be 'Unassigned' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:81:9
 		(team) => feature.getTotalWorkForTeam(team.id) > 0,
 	);
 
-	return withWork.length === 0
+	return withWork.length !== 0
 		? "Unassigned"
 		: withWork.map((team) => team.name).join("; ");
killedBy: buildDeliveryExportTable a Feature's row lists every team with work on it
statusReason: expected 'Unassigned' to be 'Team Alpha; Team Beta' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:81:9
 		(team) => feature.getTotalWorkForTeam(team.id) > 0,
 	);
 
-	return withWork.length === 0
+	return true
 		? "Unassigned"
 		: withWork.map((team) => team.name).join("; ");
killedBy: buildDeliveryExportTable a Feature's row lists every team with work on it
statusReason: expected 'Unassigned' to be 'Team Alpha; Team Beta' // Object.is equality

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliveryExportTable.ts:82:5
 	);
 
 	return withWork.length === 0
-		? "Unassigned"
+		? ""
 		: withWork.map((team) => team.name).join("; ");
 };
killedBy: buildDeliveryExportTable a Feature's row says nobody is on it rather than leaving the reader to guess
statusReason: expected '' to be 'Unassigned' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:83:18
 
 	return withWork.length === 0
 		? "Unassigned"
-		: withWork.map((team) => team.name).join("; ");
+		: withWork.map(() => undefined).join("; ");
 };
 
killedBy: buildDeliveryExportTable a Feature's row lists every team with work on it
statusReason: expected '; ' to be 'Team Alpha; Team Beta' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:86:56
 		: withWork.map((team) => team.name).join("; ");
 };
 
-const forecastCells = (feature: IFeature): string[] => {
-	if (
-		cannotBeForecast({ teamsWithoutForecast: feature.teamsWithoutForecast })
-	) {
-		return FORECAST_PROBABILITIES.map(() => CANNOT_FORECAST_SHORT);
-	}
-
-	return FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(feature.forecasts ?? [], probability),
-	);
-};
+const forecastCells = (feature: IFeature): string[] => {};
 
 const likelihoodOf = (feature: IFeature, delivery: IDelivery): string => {
killedBy: buildDeliveryExportTable the Delivery's own row comes first, and says which of the rows is the Delivery
statusReason: forecastCells is not a function or its return value is not iterable

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:88:3
 
 const forecastCells = (feature: IFeature): string[] => {
 	if (
-		cannotBeForecast({ teamsWithoutForecast: feature.teamsWithoutForecast })
+		true
 	) {
 		return FORECAST_PROBABILITIES.map(() => CANNOT_FORECAST_SHORT);
killedBy: buildDeliveryExportTable a Feature's row dates each of its four forecasts as a calendar day
statusReason: expected 'Cannot forecast' to be '2026-09-01' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:88:3
 
 const forecastCells = (feature: IFeature): string[] => {
 	if (
-		cannotBeForecast({ teamsWithoutForecast: feature.teamsWithoutForecast })
+		false
 	) {
 		return FORECAST_PROBABILITIES.map(() => CANNOT_FORECAST_SHORT);
killedBy: buildDeliveryExportTable a Feature's row says it cannot forecast in all four columns when no team can be forecast
statusReason: expected '2026-09-01' to be 'Cannot forecast' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:89:4
 const forecastCells = (feature: IFeature): string[] => {
 	if (
 		cannotBeForecast({ teamsWithoutForecast: feature.teamsWithoutForecast })
-	) {
-		return FORECAST_PROBABILITIES.map(() => CANNOT_FORECAST_SHORT);
-	}
+	) {}
 
 	return FORECAST_PROBABILITIES.map((probability) =>
killedBy: buildDeliveryExportTable a Feature's row says it cannot forecast in all four columns when no team can be forecast
statusReason: expected '2026-09-01' to be 'Cannot forecast' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:90:37
 	if (
 		cannotBeForecast({ teamsWithoutForecast: feature.teamsWithoutForecast })
 	) {
-		return FORECAST_PROBABILITIES.map(() => CANNOT_FORECAST_SHORT);
+		return FORECAST_PROBABILITIES.map(() => undefined);
 	}
 
killedBy: buildDeliveryExportTable a Feature's row says it cannot forecast in all four columns when no team can be forecast
statusReason: expected undefined to be 'Cannot forecast' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:93:36
 		return FORECAST_PROBABILITIES.map(() => CANNOT_FORECAST_SHORT);
 	}
 
-	return FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(feature.forecasts ?? [], probability),
+	return FORECAST_PROBABILITIES.map(() => undefined,
 	);
 };
killedBy: buildDeliveryExportTable a Feature's row dates each of its four forecasts as a calendar day
statusReason: expected undefined to be '2026-09-01' // Object.is equality

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:94:11
 	}
 
 	return FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(feature.forecasts ?? [], probability),
+		dateFor(feature.forecasts && [], probability),
 	);
 };
killedBy: buildDeliveryExportTable a Feature's row dates each of its four forecasts as a calendar day
statusReason: expected '' to be '2026-09-01' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:98:74
 	);
 };
 
-const likelihoodOf = (feature: IFeature, delivery: IDelivery): string => {
-	const featureLikelihood = delivery.featureLikelihoods?.find(
-		(candidate) => candidate.featureId === feature.id,
-	);
-
-	return featureLikelihood
-		? featureLikelihoodLabel(
-				featureLikelihood,
-				feature.getRemainingWorkForFeature() > 0,
-			)
-		: NOTHING_TO_SAY;
-};
+const likelihoodOf = (feature: IFeature, delivery: IDelivery): string => {};
 
 const dependenciesOf = (
killedBy: buildDeliveryExportTable a Feature's row reads its chance of landing off the Delivery it belongs to
statusReason: expected undefined to be '63%' // Object.is equality

[Survived] OptionalChaining
Detail/Components/DeliveryGrid/deliveryExportTable.ts:99:28
 };
 
 const likelihoodOf = (feature: IFeature, delivery: IDelivery): string => {
-	const featureLikelihood = delivery.featureLikelihoods?.find(
+	const featureLikelihood = delivery.featureLikelihoods.find(
 		(candidate) => candidate.featureId === feature.id,
 	);

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:100:18
 
 const likelihoodOf = (feature: IFeature, delivery: IDelivery): string => {
 	const featureLikelihood = delivery.featureLikelihoods?.find(
-		(candidate) => candidate.featureId === feature.id,
+		(candidate) => false,
 	);
 
killedBy: buildDeliveryExportTable a Feature's row reads its chance of landing off the Delivery it belongs to
statusReason: expected '' to be '63%' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:100:3
 
 const likelihoodOf = (feature: IFeature, delivery: IDelivery): string => {
 	const featureLikelihood = delivery.featureLikelihoods?.find(
-		(candidate) => candidate.featureId === feature.id,
+		() => undefined,
 	);
 
killedBy: buildDeliveryExportTable a Feature's row reads its chance of landing off the Delivery it belongs to
statusReason: expected '' to be '63%' // Object.is equality

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:106:5
 	return featureLikelihood
 		? featureLikelihoodLabel(
 				featureLikelihood,
-				feature.getRemainingWorkForFeature() > 0,
+				true,
 			)
 		: NOTHING_TO_SAY;

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:106:5
 	return featureLikelihood
 		? featureLikelihoodLabel(
 				featureLikelihood,
-				feature.getRemainingWorkForFeature() > 0,
+				false,
 			)
 		: NOTHING_TO_SAY;

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:111:24
 		: NOTHING_TO_SAY;
 };
 
-const dependenciesOf = (
-	feature: IFeature,
-	terms: DeliveryExportTerms,
-): string =>
-	(feature.dependsOn ?? [])
-		.map((dependency) =>
-			dependency.isWithheld
-				? withheldName(terms)
-				: `${dependency.referenceId}: ${dependency.name}`,
-		)
-		.join("; ");
+const dependenciesOf = () => undefined;
 
 const featureRow = (
killedBy: buildDeliveryExportTable a Feature's row names everything the Feature is waiting on
statusReason: expected undefined to be 'FTR-90: Warehouse sync; FTR-91: Card …' // Object.is equality

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:115:3
 	feature: IFeature,
 	terms: DeliveryExportTerms,
 ): string =>
-	(feature.dependsOn ?? [])
+	(feature.dependsOn && [])
 		.map((dependency) =>
 			dependency.isWithheld
killedBy: buildDeliveryExportTable a Feature's row names everything the Feature is waiting on
statusReason: expected '' to be 'FTR-90: Warehouse sync; FTR-91: Card …' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:116:8
 	terms: DeliveryExportTerms,
 ): string =>
 	(feature.dependsOn ?? [])
-		.map((dependency) =>
-			dependency.isWithheld
-				? withheldName(terms)
-				: `${dependency.referenceId}: ${dependency.name}`,
+		.map(() => undefined,
 		)
 		.join("; ");
killedBy: buildDeliveryExportTable a Feature's row names everything the Feature is waiting on
statusReason: expected '; ' to be 'FTR-90: Warehouse sync; FTR-91: Card …' // Object.is equality

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:132:5
 	const warnings = featureWarningSentences(
 		{
 			isDoneWithRemainingWork:
-				feature.stateCategory === "Done" &&
-				feature.getRemainingWorkForFeature() > 0,
+				feature.stateCategory === "Done" || feature.getRemainingWorkForFeature() > 0,
 			isUsingDefaultFeatureSize: feature.isUsingDefaultFeatureSize,
 			dependencies: feature.dependsOn,
killedBy: buildDeliveryExportTable a Feature's row says so when there is nothing to attend to
statusReason: expected 'Yes' to be 'No' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:132:5
 	const warnings = featureWarningSentences(
 		{
 			isDoneWithRemainingWork:
-				feature.stateCategory === "Done" &&
-				feature.getRemainingWorkForFeature() > 0,
+				true,
 			isUsingDefaultFeatureSize: feature.isUsingDefaultFeatureSize,
 			dependencies: feature.dependsOn,
killedBy: buildDeliveryExportTable a Feature's row says so when there is nothing to attend to
statusReason: expected 'Yes' to be 'No' // Object.is equality

[NoCoverage] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:133:5
 		{
 			isDoneWithRemainingWork:
 				feature.stateCategory === "Done" &&
-				feature.getRemainingWorkForFeature() > 0,
+				feature.getRemainingWorkForFeature() >= 0,
 			isUsingDefaultFeatureSize: feature.isUsingDefaultFeatureSize,
 			dependencies: feature.dependsOn,

[NoCoverage] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:133:5
 		{
 			isDoneWithRemainingWork:
 				feature.stateCategory === "Done" &&
-				feature.getRemainingWorkForFeature() > 0,
+				feature.getRemainingWorkForFeature() <= 0,
 			isUsingDefaultFeatureSize: feature.isUsingDefaultFeatureSize,
 			dependencies: feature.dependsOn,

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:149:3
 		),
 		...forecastCells(feature),
 		likelihoodOf(feature, delivery),
-		feature.state ?? NOTHING_TO_SAY,
+		feature.state && NOTHING_TO_SAY,
 		dependenciesOf(feature, terms),
 		warnings.length > 0 ? "Yes" : "No",
killedBy: buildDeliveryExportTable a Feature's row reports the state the tracker has it in
statusReason: expected '' to be 'In Review' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:151:3
 		likelihoodOf(feature, delivery),
 		feature.state ?? NOTHING_TO_SAY,
 		dependenciesOf(feature, terms),
-		warnings.length > 0 ? "Yes" : "No",
+		warnings.length <= 0 ? "Yes" : "No",
 	];
 };
killedBy: buildDeliveryExportTable a Feature's row says a Feature needs attention without repeating what the screen says
statusReason: expected 'No' to be 'Yes' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:151:3
 		likelihoodOf(feature, delivery),
 		feature.state ?? NOTHING_TO_SAY,
 		dependenciesOf(feature, terms),
-		warnings.length > 0 ? "Yes" : "No",
+		warnings.length >= 0 ? "Yes" : "No",
 	];
 };
killedBy: buildDeliveryExportTable a Feature's row says so when there is nothing to attend to
statusReason: expected 'Yes' to be 'No' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:170:24
 	features: IFeature[],
 	teams: IEntityReference[],
 	terms: DeliveryExportTerms,
-): DataGridExportTable {
-	return {
-		headers: HEADERS,
-		rows: [
-			deliveryRow(delivery, terms),
-			...features.map((feature) => featureRow(feature, delivery, teams, terms)),
-		],
-	};
-}
+): DataGridExportTable {}
 
 const archivedDeliveryRow = (
killedBy: buildDeliveryExportTable names the same eleven columns in the same order every time
statusReason: Cannot read properties of undefined (reading 'headers')

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:175:20
 		headers: HEADERS,
 		rows: [
 			deliveryRow(delivery, terms),
-			...features.map((feature) => featureRow(feature, delivery, teams, terms)),
+			...features.map(() => undefined),
 		],
 	};
killedBy: buildDeliveryExportTable a Feature's row names the Feature the way the screen names it
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:180:29
 	};
 }
 
-const archivedDeliveryRow = (
-	archived: ArchivedDelivery,
-	{ deliveryTerm }: DeliveryExportTerms,
-): string[] => [
-	`${archived.name} (${deliveryTerm})`,
-	NOTHING_TO_SAY,
-	progress(archived.totalWork, archived.remainingWork),
-	...FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(archived.whenDistribution, probability),
-	),
-	archived.likelihoodPercentage === null
-		? NOTHING_TO_SAY
-		: `${Math.round(archived.likelihoodPercentage)}%`,
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-];
+const archivedDeliveryRow = () => undefined;
 
 // The record keeps how far along a Feature was as a percentage and how many items it held, so the
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ArrayDeclaration
Detail/Components/DeliveryGrid/deliveryExportTable.ts:183:16
 const archivedDeliveryRow = (
 	archived: ArchivedDelivery,
 	{ deliveryTerm }: DeliveryExportTerms,
-): string[] => [
-	`${archived.name} (${deliveryTerm})`,
-	NOTHING_TO_SAY,
-	progress(archived.totalWork, archived.remainingWork),
-	...FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(archived.whenDistribution, probability),
-	),
-	archived.likelihoodPercentage === null
-		? NOTHING_TO_SAY
-		: `${Math.round(archived.likelihoodPercentage)}%`,
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-];
+): string[] => [];
 
 // The record keeps how far along a Feature was as a percentage and how many items it held, so the
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected '' to contain 'Autumn Launch (Delivery)'

[Killed] StringLiteral
Detail/Components/DeliveryGrid/deliveryExportTable.ts:184:2
 	archived: ArchivedDelivery,
 	{ deliveryTerm }: DeliveryExportTerms,
 ): string[] => [
-	`${archived.name} (${deliveryTerm})`,
+	``,
 	NOTHING_TO_SAY,
 	progress(archived.totalWork, archived.remainingWork),
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected ',,40/50,2026-04-20,2026-04-24,2026-04…' to contain 'Autumn Launch (Delivery)'

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:187:32
 	`${archived.name} (${deliveryTerm})`,
 	NOTHING_TO_SAY,
 	progress(archived.totalWork, archived.remainingWork),
-	...FORECAST_PROBABILITIES.map((probability) =>
-		dateFor(archived.whenDistribution, probability),
+	...FORECAST_PROBABILITIES.map(() => undefined,
 	),
 	archived.likelihoodPercentage === null
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:190:2
 	...FORECAST_PROBABILITIES.map((probability) =>
 		dateFor(archived.whenDistribution, probability),
 	),
-	archived.likelihoodPercentage === null
+	true
 		? NOTHING_TO_SAY
 		: `${Math.round(archived.likelihoodPercentage)}%`,
killedBy: buildArchivedDeliveryExportTable puts the Delivery itself in the first data row, as a live export does
statusReason: expected '' to be '64%' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:190:2
 	...FORECAST_PROBABILITIES.map((probability) =>
 		dateFor(archived.whenDistribution, probability),
 	),
-	archived.likelihoodPercentage === null
+	archived.likelihoodPercentage !== null
 		? NOTHING_TO_SAY
 		: `${Math.round(archived.likelihoodPercentage)}%`,
killedBy: buildArchivedDeliveryExportTable puts the Delivery itself in the first data row, as a live export does
statusReason: expected '' to be '64%' // Object.is equality
