[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:201:24
 // The record keeps how far along a Feature was as a percentage and how many items it held, so the
 // same "done of total" cell a live export writes is recoverable exactly. A record written before
 // item counts were kept has no total, and half a fraction is worse than none.
-const pinnedProgress = (row: FeatureMetric): string =>
-	row.totalItems === null
-		? NOTHING_TO_SAY
-		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
+const pinnedProgress = () => undefined;
 
 const pinnedLikelihood = (row: FeatureMetric): string =>
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:202:2
 // same "done of total" cell a live export writes is recoverable exactly. A record written before
 // item counts were kept has no total, and half a fraction is worse than none.
 const pinnedProgress = (row: FeatureMetric): string =>
-	row.totalItems === null
+	row.totalItems !== null
 		? NOTHING_TO_SAY
 		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
killedBy: buildArchivedDeliveryExportTable writes the Feature rows that were noted, not ones worked out now
statusReason: expected '' to be '12/20' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:202:2
 // same "done of total" cell a live export writes is recoverable exactly. A record written before
 // item counts were kept has no total, and half a fraction is worse than none.
 const pinnedProgress = (row: FeatureMetric): string =>
-	row.totalItems === null
+	false
 		? NOTHING_TO_SAY
 		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
killedBy: buildArchivedDeliveryExportTable leaves progress blank on a row recorded before Work Item counts were kept
statusReason: expected '0/null' to be '' // Object.is equality

[Killed] ArithmeticOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:204:20
 const pinnedProgress = (row: FeatureMetric): string =>
 	row.totalItems === null
 		? NOTHING_TO_SAY
-		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
+		: `${Math.round((row.completion * 100) * row.totalItems)}/${row.totalItems}`;
 
 const pinnedLikelihood = (row: FeatureMetric): string =>
killedBy: buildArchivedDeliveryExportTable writes the Feature rows that were noted, not ones worked out now
statusReason: expected '120000/20' to be '12/20' // Object.is equality

[Killed] ArithmeticOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:204:19
 const pinnedProgress = (row: FeatureMetric): string =>
 	row.totalItems === null
 		? NOTHING_TO_SAY
-		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
+		: `${Math.round(row.completion / 100 / row.totalItems)}/${row.totalItems}`;
 
 const pinnedLikelihood = (row: FeatureMetric): string =>
killedBy: buildArchivedDeliveryExportTable writes the Feature rows that were noted, not ones worked out now
statusReason: expected '0/20' to be '12/20' // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:206:26
 		? NOTHING_TO_SAY
 		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
 
-const pinnedLikelihood = (row: FeatureMetric): string =>
-	row.likelihood === null
-		? CANNOT_FORECAST_SHORT
-		: formatLikelihood(row.likelihood, {
-				hasRemainingWork: row.completion < 100,
-				precision: "round",
-			});
+const pinnedLikelihood = () => undefined;
 
 const archivedFeatureRow = (row: FeatureMetric): string[] => [
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:207:2
 		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
 
 const pinnedLikelihood = (row: FeatureMetric): string =>
-	row.likelihood === null
+	false
 		? CANNOT_FORECAST_SHORT
 		: formatLikelihood(row.likelihood, {
killedBy: buildArchivedDeliveryExportTable says a Feature could not be forecast rather than reporting a zero chance
statusReason: expected '0%' to be 'Cannot forecast' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:207:2
 		: `${Math.round((row.completion / 100) * row.totalItems)}/${row.totalItems}`;
 
 const pinnedLikelihood = (row: FeatureMetric): string =>
-	row.likelihood === null
+	row.likelihood !== null
 		? CANNOT_FORECAST_SHORT
 		: formatLikelihood(row.likelihood, {
killedBy: buildArchivedDeliveryExportTable writes the Feature rows that were noted, not ones worked out now
statusReason: expected 'Cannot forecast' to be '72%' // Object.is equality

[Survived] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:210:23
 	row.likelihood === null
 		? CANNOT_FORECAST_SHORT
 		: formatLikelihood(row.likelihood, {
-				hasRemainingWork: row.completion < 100,
+				hasRemainingWork: row.completion <= 100,
 				precision: "round",
 			});

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:210:23
 	row.likelihood === null
 		? CANNOT_FORECAST_SHORT
 		: formatLikelihood(row.likelihood, {
-				hasRemainingWork: row.completion < 100,
+				hasRemainingWork: false,
 				precision: "round",
 			});

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:214:28
 				precision: "round",
 			});
 
-const archivedFeatureRow = (row: FeatureMetric): string[] => [
-	getWorkItemName(row.name, row.referenceId),
-	NOTHING_TO_SAY,
-	pinnedProgress(row),
-	...FORECAST_PROBABILITIES.map(() => NOTHING_TO_SAY),
-	pinnedLikelihood(row),
-	NOTHING_TO_SAY,
-	NOTHING_TO_SAY,
-	pinnedWarning(row),
-];
+const archivedFeatureRow = () => undefined;
 
 // A record that says the size was measured is answering the question, and answering it with a blank
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/deliveryExportTable.ts:218:32
 	getWorkItemName(row.name, row.referenceId),
 	NOTHING_TO_SAY,
 	pinnedProgress(row),
-	...FORECAST_PROBABILITIES.map(() => NOTHING_TO_SAY),
+	...FORECAST_PROBABILITIES.map(() => undefined),
 	pinnedLikelihood(row),
 	NOTHING_TO_SAY,
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:227:55
 
 // A record that says the size was measured is answering the question, and answering it with a blank
 // would read as nobody having asked. Only a row from before sizes were kept has nothing to say.
-const pinnedWarning = (row: FeatureMetric): string => {
-	if (row.isUsingDefaultSize === null || row.isUsingDefaultSize === undefined) {
-		return NOTHING_TO_SAY;
-	}
-
-	return row.isUsingDefaultSize ? "Yes" : "No";
-};
+const pinnedWarning = (row: FeatureMetric): string => {};
 
 /**
killedBy: buildArchivedDeliveryExportTable answers the warning question when the record answered it
statusReason: expected undefined to be 'No' // Object.is equality

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/deliveryExportTable.ts:228:41
 // A record that says the size was measured is answering the question, and answering it with a blank
 // would read as nobody having asked. Only a row from before sizes were kept has nothing to say.
 const pinnedWarning = (row: FeatureMetric): string => {
-	if (row.isUsingDefaultSize === null || row.isUsingDefaultSize === undefined) {
+	if (row.isUsingDefaultSize === null || row.isUsingDefaultSize !== undefined) {
 		return NOTHING_TO_SAY;
 	}
killedBy: buildArchivedDeliveryExportTable answers the warning question when the record answered it
statusReason: expected '' to be 'No' // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/deliveryExportTable.ts:228:6
 // A record that says the size was measured is answering the question, and answering it with a blank
 // would read as nobody having asked. Only a row from before sizes were kept has nothing to say.
 const pinnedWarning = (row: FeatureMetric): string => {
-	if (row.isUsingDefaultSize === null || row.isUsingDefaultSize === undefined) {
+	if (true) {
 		return NOTHING_TO_SAY;
 	}
killedBy: buildArchivedDeliveryExportTable answers the warning question when the record answered it
statusReason: expected '' to be 'No' // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/deliveryExportTable.ts:248:24
 	archived: ArchivedDelivery,
 	rows: readonly FeatureMetric[],
 	terms: DeliveryExportTerms,
-): DataGridExportTable {
-	return {
-		headers: HEADERS,
-		rows: [
-			archivedDeliveryRow(archived, terms),
-			...rows.map(archivedFeatureRow),
-		],
-	};
-}
+): DataGridExportTable {}
 
killedBy: buildArchivedDeliveryExportTable writes the same columns a live Delivery exports, so the two files can be read side by side
statusReason: Cannot read properties of undefined (reading 'headers')
