[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:38:57
 const STALE_VERSION_MESSAGE =
 	"This was changed by someone else since you opened it. Refresh the page and try again.";
 
-function isConcurrencyConflict(error: unknown): boolean {
-	return (
-		error instanceof ApiError && error.code === CONCURRENCY_CONFLICT_STATUS
-	);
-}
+function isConcurrencyConflict(error: unknown): boolean {}
 
 /**
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:40:3
 
 function isConcurrencyConflict(error: unknown): boolean {
 	return (
-		error instanceof ApiError && error.code === CONCURRENCY_CONFLICT_STATUS
+		true
 	);
 }
killedBy: useDeliveryManagement Delivery Update should handle update delivery error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to update Delivery' ]

Received:

  1st vi.fn() call:

  [
-   "Failed to update Delivery",

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:40:32
 
 function isConcurrencyConflict(error: unknown): boolean {
 	return (
-		error instanceof ApiError && error.code === CONCURRENCY_CONFLICT_STATUS
+		error instanceof ApiError && error.code !== CONCURRENCY_CONFLICT_STATUS
 	);
 }
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:53:11
 	error: unknown,
 	deliveryTerm: string,
 	fallback: string,
-): string {
-	if (isArchivedRefusal(error)) {
-		return archivedRefusalMessage(deliveryTerm);
-	}
-
-	if (isNotArchivedRefusal(error)) {
-		return notArchivedRefusalMessage(deliveryTerm);
-	}
-
-	return isConcurrencyConflict(error) ? STALE_VERSION_MESSAGE : fallback;
-}
+): string {}
 
 export const useDeliveryManagement = ({
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:54:6
 	deliveryTerm: string,
 	fallback: string,
 ): string {
-	if (isArchivedRefusal(error)) {
+	if (true) {
 		return archivedRefusalMessage(deliveryTerm);
 	}
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:54:32
 	deliveryTerm: string,
 	fallback: string,
 ): string {
-	if (isArchivedRefusal(error)) {
-		return archivedRefusalMessage(deliveryTerm);
-	}
+	if (isArchivedRefusal(error)) {}
 
 	if (isNotArchivedRefusal(error)) {
killedBy: useDeliveryManagement Delivery Update says the Delivery is archived rather than telling the reader to refresh
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "This Delivery is archived, so it can no longer be changed. Bring it back first.",

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:58:6
 		return archivedRefusalMessage(deliveryTerm);
 	}
 
-	if (isNotArchivedRefusal(error)) {
+	if (true) {
 		return notArchivedRefusalMessage(deliveryTerm);
 	}
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:58:6
 		return archivedRefusalMessage(deliveryTerm);
 	}
 
-	if (isNotArchivedRefusal(error)) {
+	if (false) {
 		return notArchivedRefusalMessage(deliveryTerm);
 	}

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:75:45
 	const [archivedDeliveries, setArchivedDeliveries] = useState<
 		ArchivedDelivery[]
 	>([]);
-	const [isLoading, setIsLoading] = useState(false);
+	const [isLoading, setIsLoading] = useState(true);
 	const [showCreateModal, setShowCreateModal] = useState(false);
 	const [selectedDelivery, setSelectedDelivery] = useState<Delivery | null>(

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:76:57
 		ArchivedDelivery[]
 	>([]);
 	const [isLoading, setIsLoading] = useState(false);
-	const [showCreateModal, setShowCreateModal] = useState(false);
+	const [showCreateModal, setShowCreateModal] = useState(true);
 	const [selectedDelivery, setSelectedDelivery] = useState<Delivery | null>(
 		null,
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:80:59
 	const [selectedDelivery, setSelectedDelivery] = useState<Delivery | null>(
 		null,
 	);
-	const [deleteDialogOpen, setDeleteDialogOpen] = useState(false);
+	const [deleteDialogOpen, setDeleteDialogOpen] = useState(true);
 	const [deliveryToDelete, setDeliveryToDelete] =
 		useState<DeletableDelivery | null>(null);
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:83:61
 	const [deleteDialogOpen, setDeleteDialogOpen] = useState(false);
 	const [deliveryToDelete, setDeliveryToDelete] =
 		useState<DeletableDelivery | null>(null);
-	const [archiveDialogOpen, setArchiveDialogOpen] = useState(false);
+	const [archiveDialogOpen, setArchiveDialogOpen] = useState(true);
 	const [deliveryToArchive, setDeliveryToArchive] = useState<Delivery | null>(
 		null,

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:103:5
 	const loadFeaturesForDelivery = useCallback(
 		async (delivery: Delivery): Promise<void> => {
 			if (
-				loadingFeaturesByDelivery.has(delivery.id) ||
-				loadedFeatures.has(delivery.id)
+				false
 			)
 				return;
killedBy: useDeliveryManagement Feature Expansion should not reload features if already loaded
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:103:5
 	const loadFeaturesForDelivery = useCallback(
 		async (delivery: Delivery): Promise<void> => {
 			if (
-				loadingFeaturesByDelivery.has(delivery.id) ||
-				loadedFeatures.has(delivery.id)
+				loadingFeaturesByDelivery.has(delivery.id) && loadedFeatures.has(delivery.id)
 			)
 				return;
killedBy: useDeliveryManagement Feature Expansion should not reload features if already loaded
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:108:8
 			)
 				return;
 
-			if (!delivery.features || delivery.features.length === 0) {
+			if (true) {
 				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, []));
 				return;
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected [] to deeply equal [ Feature{ …(27) }, Feature{ …(27) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:108:8
 			)
 				return;
 
-			if (!delivery.features || delivery.features.length === 0) {
+			if (!delivery.features && delivery.features.length === 0) {
 				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, []));
 				return;
killedBy: useDeliveryManagement Feature Expansion should handle delivery with no features
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [],

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:109:23
 				return;
 
 			if (!delivery.features || delivery.features.length === 0) {
-				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, []));
+				setLoadedFeatures(() => undefined);
 				return;
 			}
killedBy: useDeliveryManagement Feature Expansion should handle delivery with no features
statusReason: Cannot read properties of undefined (reading 'get')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:113:33
 				return;
 			}
 
-			setLoadingFeaturesByDelivery((prev) => new Set(prev).add(delivery.id));
+			setLoadingFeaturesByDelivery(() => undefined);
 
 			try {
killedBy: useDeliveryManagement Feature Expansion should track feature loading state
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:115:8
 
 			setLoadingFeaturesByDelivery((prev) => new Set(prev).add(delivery.id));
 
-			try {
-				const featureIds = delivery.features;
-				const features = await featureService.getFeaturesByIds(featureIds);
-				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, features));
-			} catch (error) {
+			try {} catch (error) {
 				console.error("Failed to load features for delivery:", error);
 				showError("Failed to load features for delivery");
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:118:23
 			try {
 				const featureIds = delivery.features;
 				const features = await featureService.getFeaturesByIds(featureIds);
-				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, features));
+				setLoadedFeatures(() => undefined);
 			} catch (error) {
 				console.error("Failed to load features for delivery:", error);
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: Cannot read properties of undefined (reading 'has')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:119:20
 				const featureIds = delivery.features;
 				const features = await featureService.getFeaturesByIds(featureIds);
 				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, features));
-			} catch (error) {
-				console.error("Failed to load features for delivery:", error);
-				showError("Failed to load features for delivery");
-			} finally {
+			} catch (error) {} finally {
 				setLoadingFeaturesByDelivery((prev) => {
 					const next = new Set(prev);
killedBy: useDeliveryManagement Feature Expansion should handle feature loading error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:122:14
 			} catch (error) {
 				console.error("Failed to load features for delivery:", error);
 				showError("Failed to load features for delivery");
-			} finally {
-				setLoadingFeaturesByDelivery((prev) => {
-					const next = new Set(prev);
-					next.delete(delivery.id);
-					return next;
-				});
-			}
+			} finally {}
 		},
 		[featureService, showError, loadingFeaturesByDelivery, loadedFeatures],
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:123:44
 				console.error("Failed to load features for delivery:", error);
 				showError("Failed to load features for delivery");
 			} finally {
-				setLoadingFeaturesByDelivery((prev) => {
-					const next = new Set(prev);
-					next.delete(delivery.id);
-					return next;
-				});
+				setLoadingFeaturesByDelivery((prev) => {});
 			}
 		},
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:134:48
 	);
 
 	const forceReloadFeaturesForDelivery = useCallback(
-		async (delivery: Delivery): Promise<void> => {
-			if (loadingFeaturesByDelivery.has(delivery.id)) return;
-
-			if (!delivery.features || delivery.features.length === 0) {
-				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, []));
-				return;
-			}
-
-			setLoadingFeaturesByDelivery((prev) => new Set(prev).add(delivery.id));
-
-			try {
-				const featureIds = delivery.features;
-				const features = await featureService.getFeaturesByIds(featureIds);
-				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, features));
-			} catch (error) {
-				console.error("Failed to load features for delivery:", error);
-				showError("Failed to load features for delivery");
-			} finally {
-				setLoadingFeaturesByDelivery((prev) => {
-					const next = new Set(prev);
-					next.delete(delivery.id);
-					return next;
-				});
-			}
-		},
+		async (delivery: Delivery): Promise<void> => {},
 		[featureService, showError, loadingFeaturesByDelivery],
 	);
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:135:8
 
 	const forceReloadFeaturesForDelivery = useCallback(
 		async (delivery: Delivery): Promise<void> => {
-			if (loadingFeaturesByDelivery.has(delivery.id)) return;
+			if (true) return;
 
 			if (!delivery.features || delivery.features.length === 0) {
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:135:8
 
 	const forceReloadFeaturesForDelivery = useCallback(
 		async (delivery: Delivery): Promise<void> => {
-			if (loadingFeaturesByDelivery.has(delivery.id)) return;
+			if (false) return;
 
 			if (!delivery.features || delivery.features.length === 0) {

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:137:30
 		async (delivery: Delivery): Promise<void> => {
 			if (loadingFeaturesByDelivery.has(delivery.id)) return;
 
-			if (!delivery.features || delivery.features.length === 0) {
+			if (!delivery.features || delivery.features.length !== 0) {
 				setLoadedFeatures((prev) => new Map(prev).set(delivery.id, []));
 				return;
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected [] to deeply equal [ Feature{ …(27) }, Feature{ …(27) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:159:3
 				});
 			}
 		},
-		[featureService, showError, loadingFeaturesByDelivery],
+		[],
 	);
 

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:164:61
 
 	// A Delivery that has left the live list takes its expansion and its loaded Features with it,
 	// so nothing is left holding rows for something that is no longer there to show them.
-	const forgetDelivery = useCallback((deliveryId: number) => {
-		setExpandedDeliveries((prev) => {
-			const next = new Set(prev);
-			next.delete(deliveryId);
-			return next;
-		});
-		setLoadedFeatures((prev) => {
-			const next = new Map(prev);
-			next.delete(deliveryId);
-			return next;
-		});
-	}, []);
+	const forgetDelivery = useCallback((deliveryId: number) => {}, []);
 
 	const fetchDeliveries = useCallback(async () => {
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:165:35
 	// A Delivery that has left the live list takes its expansion and its loaded Features with it,
 	// so nothing is left holding rows for something that is no longer there to show them.
 	const forgetDelivery = useCallback((deliveryId: number) => {
-		setExpandedDeliveries((prev) => {
-			const next = new Set(prev);
-			next.delete(deliveryId);
-			return next;
-		});
+		setExpandedDeliveries((prev) => {});
 		setLoadedFeatures((prev) => {
 			const next = new Map(prev);
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: Cannot read properties of undefined (reading 'has')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:170:31
 			next.delete(deliveryId);
 			return next;
 		});
-		setLoadedFeatures((prev) => {
-			const next = new Map(prev);
-			next.delete(deliveryId);
-			return next;
-		});
+		setLoadedFeatures((prev) => {});
 	}, []);
 
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: Cannot read properties of undefined (reading 'has')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:177:50
 		});
 	}, []);
 
-	const fetchDeliveries = useCallback(async () => {
-		setIsLoading(true);
-		try {
-			const portfolioDeliveries = await deliveryService.getByPortfolio(
-				portfolio.id,
-			);
-			setDeliveries(portfolioDeliveries.active);
-			setArchivedDeliveries(portfolioDeliveries.archived);
-		} catch (error) {
-			console.error("Failed to fetch deliveries:", error);
-			showError("Failed to fetch deliveries");
-		} finally {
-			setIsLoading(false);
-		}
-	}, [deliveryService, portfolio.id, showError]);
+	const fetchDeliveries = useCallback(async () => {}, [deliveryService, portfolio.id, showError]);
 
 	const handleAddDelivery = () => {
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:178:16
 	}, []);
 
 	const fetchDeliveries = useCallback(async () => {
-		setIsLoading(true);
+		setIsLoading(false);
 		try {
 			const portfolioDeliveries = await deliveryService.getByPortfolio(
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:179:7
 
 	const fetchDeliveries = useCallback(async () => {
 		setIsLoading(true);
-		try {
-			const portfolioDeliveries = await deliveryService.getByPortfolio(
-				portfolio.id,
-			);
-			setDeliveries(portfolioDeliveries.active);
-			setArchivedDeliveries(portfolioDeliveries.archived);
-		} catch (error) {
+		try {} catch (error) {
 			console.error("Failed to fetch deliveries:", error);
 			showError("Failed to fetch deliveries");
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:185:19
 			);
 			setDeliveries(portfolioDeliveries.active);
 			setArchivedDeliveries(portfolioDeliveries.archived);
-		} catch (error) {
-			console.error("Failed to fetch deliveries:", error);
-			showError("Failed to fetch deliveries");
-		} finally {
+		} catch (error) {} finally {
 			setIsLoading(false);
 		}
killedBy: useDeliveryManagement Initial State should handle fetch deliveries error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to fetch deliveries' ]

Number of calls: 0

[Killed] StringLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:187:14
 			setArchivedDeliveries(portfolioDeliveries.archived);
 		} catch (error) {
 			console.error("Failed to fetch deliveries:", error);
-			showError("Failed to fetch deliveries");
+			showError("");
 		} finally {
 			setIsLoading(false);
killedBy: useDeliveryManagement Initial State should handle fetch deliveries error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to fetch deliveries' ]

Received:

  1st vi.fn() call:

  [
-   "Failed to fetch deliveries",

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:188:13
 		} catch (error) {
 			console.error("Failed to fetch deliveries:", error);
 			showError("Failed to fetch deliveries");
-		} finally {
-			setIsLoading(false);
-		}
+		} finally {}
 	}, [deliveryService, portfolio.id, showError]);
 
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:191:5
 		} finally {
 			setIsLoading(false);
 		}
-	}, [deliveryService, portfolio.id, showError]);
+	}, []);
 
 	const handleAddDelivery = () => {

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:193:34
 		}
 	}, [deliveryService, portfolio.id, showError]);
 
-	const handleAddDelivery = () => {
-		setShowCreateModal(true);
-	};
+	const handleAddDelivery = () => {};
 
 	const handleDeleteDelivery = (delivery: DeletableDelivery) => {
killedBy: useDeliveryManagement Modal Management should open create modal when handleAddDelivery is called
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:194:22
 	}, [deliveryService, portfolio.id, showError]);
 
 	const handleAddDelivery = () => {
-		setShowCreateModal(true);
+		setShowCreateModal(false);
 	};
 
killedBy: useDeliveryManagement Modal Management should open create modal when handleAddDelivery is called
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:197:64
 		setShowCreateModal(true);
 	};
 
-	const handleDeleteDelivery = (delivery: DeletableDelivery) => {
-		setDeliveryToDelete(delivery);
-		setDeleteDialogOpen(true);
-	};
+	const handleDeleteDelivery = (delivery: DeletableDelivery) => {};
 
 	const handleEditDelivery = (delivery: Delivery) => {
killedBy: useDeliveryManagement Delete Delivery should open delete dialog when handleDeleteDelivery is called
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:199:23
 
 	const handleDeleteDelivery = (delivery: DeletableDelivery) => {
 		setDeliveryToDelete(delivery);
-		setDeleteDialogOpen(true);
+		setDeleteDialogOpen(false);
 	};
 
killedBy: useDeliveryManagement Delete Delivery should open delete dialog when handleDeleteDelivery is called
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:202:53
 		setDeleteDialogOpen(true);
 	};
 
-	const handleEditDelivery = (delivery: Delivery) => {
-		setSelectedDelivery(delivery);
-	};
+	const handleEditDelivery = (delivery: Delivery) => {};
 
 	const handleArchiveDelivery = (delivery: Delivery) => {
killedBy: useDeliveryManagement Modal Management should set selected delivery when handleEditDelivery is called
statusReason: expected null to deeply equal Delivery{ id: 1, …(17) }

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:206:56
 		setSelectedDelivery(delivery);
 	};
 
-	const handleArchiveDelivery = (delivery: Delivery) => {
-		setDeliveryToArchive(delivery);
-		setArchiveDialogOpen(true);
-	};
+	const handleArchiveDelivery = (delivery: Delivery) => {};
 
 	const handleCreateDelivery = async (deliveryData: {
killedBy: useDeliveryManagement Archiving asks before archiving and does nothing while the question is open
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:208:24
 
 	const handleArchiveDelivery = (delivery: Delivery) => {
 		setDeliveryToArchive(delivery);
-		setArchiveDialogOpen(true);
+		setArchiveDialogOpen(false);
 	};
 
killedBy: useDeliveryManagement Archiving asks before archiving and does nothing while the question is open
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:218:8
 		selectionMode?: DeliverySelectionMode;
 		rules?: IWorkItemRuleCondition[];
 		mode?: "and" | "or";
-	}) => {
-		try {
-			await deliveryService.create(
-				portfolio.id,
-				deliveryData.name,
-				new Date(deliveryData.date),
-				deliveryData.featureIds,
-				deliveryData.selectionMode,
-				deliveryData.rules,
-				deliveryData.mode,
-			);
-			setShowCreateModal(false);
-			await fetchDeliveries();
-		} catch (error) {
-			console.error("Failed to create delivery:", error);
-			showError("Failed to create delivery");
-		}
-	};
+	}) => {};
 
 	const handleUpdateDelivery = async (deliveryData: {
killedBy: useDeliveryManagement Create Delivery should create delivery successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'New Delivery', …(5) ]

Number of calls: 0

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:219:7
 		rules?: IWorkItemRuleCondition[];
 		mode?: "and" | "or";
 	}) => {
-		try {
-			await deliveryService.create(
-				portfolio.id,
-				deliveryData.name,
-				new Date(deliveryData.date),
-				deliveryData.featureIds,
-				deliveryData.selectionMode,
-				deliveryData.rules,
-				deliveryData.mode,
-			);
-			setShowCreateModal(false);
-			await fetchDeliveries();
-		} catch (error) {
+		try {} catch (error) {
 			console.error("Failed to create delivery:", error);
 			showError("Failed to create delivery");
killedBy: useDeliveryManagement Create Delivery should create delivery successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'New Delivery', …(5) ]

Number of calls: 0

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:229:23
 				deliveryData.rules,
 				deliveryData.mode,
 			);
-			setShowCreateModal(false);
+			setShowCreateModal(true);
 			await fetchDeliveries();
 		} catch (error) {
killedBy: useDeliveryManagement Create Delivery should create delivery successfully
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:231:19
 			);
 			setShowCreateModal(false);
 			await fetchDeliveries();
-		} catch (error) {
-			console.error("Failed to create delivery:", error);
-			showError("Failed to create delivery");
-		}
+		} catch (error) {}
 	};
 
killedBy: useDeliveryManagement Create Delivery should handle create delivery error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to create delivery' ]

Number of calls: 0
