[Killed] StringLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:233:14
 			await fetchDeliveries();
 		} catch (error) {
 			console.error("Failed to create delivery:", error);
-			showError("Failed to create delivery");
+			showError("");
 		}
 	};
killedBy: useDeliveryManagement Create Delivery should handle create delivery error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to create delivery' ]

Received:

  1st vi.fn() call:

  [
-   "Failed to create delivery",

[Survived] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:261:32
 				concurrencyToken: deliveryData.concurrencyToken,
 			});
 			setSelectedDelivery(null);
-			setLoadedFeatures((prev) => {
-				const next = new Map(prev);
-				next.delete(deliveryData.id);
-				return next;
-			});
+			setLoadedFeatures((prev) => {});
 			await fetchDeliveries();
 

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:268:8
 			});
 			await fetchDeliveries();
 
-			if (wasExpanded) {
+			if (true) {
 				const updatedDeliveries = await deliveryService.getByPortfolio(
 					portfolio.id,
killedBy: useDeliveryManagement Delivery Update should update delivery and refresh list
statusReason: expected "vi.fn()" to be called 2 times, but got 3 times

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:268:8
 			});
 			await fetchDeliveries();
 
-			if (wasExpanded) {
+			if (false) {
 				const updatedDeliveries = await deliveryService.getByPortfolio(
 					portfolio.id,
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:273:6
 					portfolio.id,
 				);
 				const updatedDelivery = updatedDeliveries.active.find(
-					(d) => d.id === deliveryData.id,
+					() => undefined,
 				);
 				if (updatedDelivery) {
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:273:13
 					portfolio.id,
 				);
 				const updatedDelivery = updatedDeliveries.active.find(
-					(d) => d.id === deliveryData.id,
+					(d) => d.id !== deliveryData.id,
 				);
 				if (updatedDelivery) {
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:275:9
 				const updatedDelivery = updatedDeliveries.active.find(
 					(d) => d.id === deliveryData.id,
 				);
-				if (updatedDelivery) {
+				if (false) {
 					await forceReloadFeaturesForDelivery(updatedDelivery);
 				}
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:275:26
 				const updatedDelivery = updatedDeliveries.active.find(
 					(d) => d.id === deliveryData.id,
 				);
-				if (updatedDelivery) {
-					await forceReloadFeaturesForDelivery(updatedDelivery);
-				}
+				if (updatedDelivery) {}
 			}
 		} catch (error) {
killedBy: useDeliveryManagement Delivery Update should clear cached features when updating delivery and reload if expanded
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:279:19
 					await forceReloadFeaturesForDelivery(updatedDelivery);
 				}
 			}
-		} catch (error) {
-			console.error("Failed to update delivery:", error);
-			showError(
-				refusalMessage(error, deliveryTerm, `Failed to update ${deliveryTerm}`),
-			);
-		}
+		} catch (error) {}
 	};
 
killedBy: useDeliveryManagement Delivery Update should handle update delivery error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to update Delivery' ]

Number of calls: 0

[Survived] StringLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:280:18
 				}
 			}
 		} catch (error) {
-			console.error("Failed to update delivery:", error);
+			console.error("", error);
 			showError(
 				refusalMessage(error, deliveryTerm, `Failed to update ${deliveryTerm}`),

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:287:65
 		}
 	};
 
-	const handleDeleteConfirmation = async (confirmed: boolean) => {
-		if (confirmed && deliveryToDelete) {
-			try {
-				await deliveryService.delete(deliveryToDelete.id);
-				forgetDelivery(deliveryToDelete.id);
-				await fetchDeliveries();
-			} catch (error) {
-				console.error("Failed to delete delivery:", error);
-				showError("Failed to delete delivery");
-			}
-		}
-
-		setDeleteDialogOpen(false);
-		setDeliveryToDelete(null);
-	};
+	const handleDeleteConfirmation = async (confirmed: boolean) => {};
 
 	const handleArchiveConfirmation = async (confirmed: boolean) => {
killedBy: useDeliveryManagement Delete Delivery should delete delivery when confirmation is accepted
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:288:7
 	};
 
 	const handleDeleteConfirmation = async (confirmed: boolean) => {
-		if (confirmed && deliveryToDelete) {
+		if (false) {
 			try {
 				await deliveryService.delete(deliveryToDelete.id);
killedBy: useDeliveryManagement Delete Delivery should delete delivery when confirmation is accepted
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:288:38
 	};
 
 	const handleDeleteConfirmation = async (confirmed: boolean) => {
-		if (confirmed && deliveryToDelete) {
-			try {
-				await deliveryService.delete(deliveryToDelete.id);
-				forgetDelivery(deliveryToDelete.id);
-				await fetchDeliveries();
-			} catch (error) {
-				console.error("Failed to delete delivery:", error);
-				showError("Failed to delete delivery");
-			}
-		}
+		if (confirmed && deliveryToDelete) {}
 
 		setDeleteDialogOpen(false);
killedBy: useDeliveryManagement Delete Delivery should delete delivery when confirmation is accepted
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:289:8
 
 	const handleDeleteConfirmation = async (confirmed: boolean) => {
 		if (confirmed && deliveryToDelete) {
-			try {
-				await deliveryService.delete(deliveryToDelete.id);
-				forgetDelivery(deliveryToDelete.id);
-				await fetchDeliveries();
-			} catch (error) {
+			try {} catch (error) {
 				console.error("Failed to delete delivery:", error);
 				showError("Failed to delete delivery");
killedBy: useDeliveryManagement Delete Delivery should delete delivery when confirmation is accepted
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:293:20
 				await deliveryService.delete(deliveryToDelete.id);
 				forgetDelivery(deliveryToDelete.id);
 				await fetchDeliveries();
-			} catch (error) {
-				console.error("Failed to delete delivery:", error);
-				showError("Failed to delete delivery");
-			}
+			} catch (error) {}
 		}
 
killedBy: useDeliveryManagement Delete Delivery should handle delete delivery error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to delete delivery' ]

Number of calls: 0

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:299:23
 			}
 		}
 
-		setDeleteDialogOpen(false);
+		setDeleteDialogOpen(true);
 		setDeliveryToDelete(null);
 	};
killedBy: useDeliveryManagement Delete Delivery should delete delivery when confirmation is accepted
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:303:66
 		setDeliveryToDelete(null);
 	};
 
-	const handleArchiveConfirmation = async (confirmed: boolean) => {
-		if (confirmed && deliveryToArchive) {
-			try {
-				await deliveryService.archive(
-					deliveryToArchive.id,
-					deliveryToArchive.concurrencyToken,
-				);
-				forgetDelivery(deliveryToArchive.id);
-				await fetchDeliveries();
-			} catch (error) {
-				console.error("Failed to archive delivery:", error);
-				showError(
-					refusalMessage(
-						error,
-						deliveryTerm,
-						`Failed to archive ${deliveryTerm}`,
-					),
-				);
-			}
-		}
-
-		setArchiveDialogOpen(false);
-		setDeliveryToArchive(null);
-	};
+	const handleArchiveConfirmation = async (confirmed: boolean) => {};
 
 	const handleUnarchiveDelivery = async (delivery: ArchivedDelivery) => {
killedBy: useDeliveryManagement Archiving archives the version it is looking at, then reads the list again
statusReason: expected "vi.fn()" to be called with arguments: [ 1, …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:304:7
 	};
 
 	const handleArchiveConfirmation = async (confirmed: boolean) => {
-		if (confirmed && deliveryToArchive) {
+		if (false) {
 			try {
 				await deliveryService.archive(
killedBy: useDeliveryManagement Archiving archives the version it is looking at, then reads the list again
statusReason: expected "vi.fn()" to be called with arguments: [ 1, …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:304:7
 	};
 
 	const handleArchiveConfirmation = async (confirmed: boolean) => {
-		if (confirmed && deliveryToArchive) {
+		if (true) {
 			try {
 				await deliveryService.archive(
killedBy: useDeliveryManagement Archiving leaves the Delivery alone when the question is declined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      1,

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:305:8
 
 	const handleArchiveConfirmation = async (confirmed: boolean) => {
 		if (confirmed && deliveryToArchive) {
-			try {
-				await deliveryService.archive(
-					deliveryToArchive.id,
-					deliveryToArchive.concurrencyToken,
-				);
-				forgetDelivery(deliveryToArchive.id);
-				await fetchDeliveries();
-			} catch (error) {
+			try {} catch (error) {
 				console.error("Failed to archive delivery:", error);
 				showError(
killedBy: useDeliveryManagement Archiving archives the version it is looking at, then reads the list again
statusReason: expected "vi.fn()" to be called with arguments: [ 1, …(1) ]

Number of calls: 0

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:312:20
 				);
 				forgetDelivery(deliveryToArchive.id);
 				await fetchDeliveries();
-			} catch (error) {
-				console.error("Failed to archive delivery:", error);
-				showError(
-					refusalMessage(
-						error,
-						deliveryTerm,
-						`Failed to archive ${deliveryTerm}`,
-					),
-				);
-			}
+			} catch (error) {}
 		}
 
killedBy: useDeliveryManagement Archiving says a stale version was refused rather than reporting a plain failure
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching{…} ]

Number of calls: 0

[Survived] StringLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:313:19
 				forgetDelivery(deliveryToArchive.id);
 				await fetchDeliveries();
 			} catch (error) {
-				console.error("Failed to archive delivery:", error);
+				console.error("", error);
 				showError(
 					refusalMessage(

[Survived] StringLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:318:7
 					refusalMessage(
 						error,
 						deliveryTerm,
-						`Failed to archive ${deliveryTerm}`,
+						``,
 					),
 				);

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:324:24
 			}
 		}
 
-		setArchiveDialogOpen(false);
+		setArchiveDialogOpen(true);
 		setDeliveryToArchive(null);
 	};
killedBy: useDeliveryManagement Archiving archives the version it is looking at, then reads the list again
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:328:72
 		setDeliveryToArchive(null);
 	};
 
-	const handleUnarchiveDelivery = async (delivery: ArchivedDelivery) => {
-		try {
-			await deliveryService.unarchive(delivery.id, delivery.concurrencyToken);
-			await fetchDeliveries();
-		} catch (error) {
-			console.error("Failed to unarchive delivery:", error);
-			showError(
-				refusalMessage(
-					error,
-					deliveryTerm,
-					`Failed to bring back ${deliveryTerm}`,
-				),
-			);
-		}
-	};
+	const handleUnarchiveDelivery = async (delivery: ArchivedDelivery) => {};
 
 	const handleCloseCreateModal = () => {
killedBy: PortfolioDeliveryView - retiring a Delivery brings a retired Delivery back on the version it is looking at
statusReason: expected "vi.fn()" to be called with arguments: [ 9, …(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:329:7
 	};
 
 	const handleUnarchiveDelivery = async (delivery: ArchivedDelivery) => {
-		try {
-			await deliveryService.unarchive(delivery.id, delivery.concurrencyToken);
-			await fetchDeliveries();
-		} catch (error) {
+		try {} catch (error) {
 			console.error("Failed to unarchive delivery:", error);
 			showError(
killedBy: useDeliveryManagement Archiving brings a retired Delivery back on the version it was last written at
statusReason: expected "vi.fn()" to be called with arguments: [ 9, …(1) ]

Number of calls: 0

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:332:19
 		try {
 			await deliveryService.unarchive(delivery.id, delivery.concurrencyToken);
 			await fetchDeliveries();
-		} catch (error) {
-			console.error("Failed to unarchive delivery:", error);
-			showError(
-				refusalMessage(
-					error,
-					deliveryTerm,
-					`Failed to bring back ${deliveryTerm}`,
-				),
-			);
-		}
+		} catch (error) {}
 	};
 
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the retired Delivery moved on before it could be brought back
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:344:39
 		}
 	};
 
-	const handleCloseCreateModal = () => {
-		setShowCreateModal(false);
-	};
+	const handleCloseCreateModal = () => {};
 
 	const handleCloseEditModal = () => {
killedBy: useDeliveryManagement Modal Management should close create modal when handleCloseCreateModal is called
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:345:22
 	};
 
 	const handleCloseCreateModal = () => {
-		setShowCreateModal(false);
+		setShowCreateModal(true);
 	};
 
killedBy: useDeliveryManagement Modal Management should close create modal when handleCloseCreateModal is called
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:348:37
 		setShowCreateModal(false);
 	};
 
-	const handleCloseEditModal = () => {
-		setSelectedDelivery(null);
-	};
+	const handleCloseEditModal = () => {};
 
 	const handleToggleExpanded = useCallback(
killedBy: useDeliveryManagement Modal Management should clear selected delivery when handleCloseEditModal is called
statusReason: expected Delivery{ id: 1, …(17) } to be null

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:353:27
 	};
 
 	const handleToggleExpanded = useCallback(
-		(deliveryId: number) => {
-			const isCurrentlyExpanded = expandedDeliveries.has(deliveryId);
-
-			setExpandedDeliveries((prev) => {
-				const next = new Set(prev);
-				if (isCurrentlyExpanded) {
-					next.delete(deliveryId);
-				} else {
-					next.add(deliveryId);
-					const delivery = deliveries.find((d) => d.id === deliveryId);
-					if (delivery) {
-						loadFeaturesForDelivery(delivery);
-					}
-				}
-				return next;
-			});
-		},
+		(deliveryId: number) => {},
 		[expandedDeliveries, deliveries, loadFeaturesForDelivery],
 	);
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:356:36
 		(deliveryId: number) => {
 			const isCurrentlyExpanded = expandedDeliveries.has(deliveryId);
 
-			setExpandedDeliveries((prev) => {
-				const next = new Set(prev);
-				if (isCurrentlyExpanded) {
-					next.delete(deliveryId);
-				} else {
-					next.add(deliveryId);
-					const delivery = deliveries.find((d) => d.id === deliveryId);
-					if (delivery) {
-						loadFeaturesForDelivery(delivery);
-					}
-				}
-				return next;
-			});
+			setExpandedDeliveries((prev) => {});
 		},
 		[expandedDeliveries, deliveries, loadFeaturesForDelivery],
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: Cannot read properties of undefined (reading 'has')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:358:9
 
 			setExpandedDeliveries((prev) => {
 				const next = new Set(prev);
-				if (isCurrentlyExpanded) {
+				if (false) {
 					next.delete(deliveryId);
 				} else {
killedBy: useDeliveryManagement Feature Expansion should toggle expansion state
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:358:9
 
 			setExpandedDeliveries((prev) => {
 				const next = new Set(prev);
-				if (isCurrentlyExpanded) {
+				if (true) {
 					next.delete(deliveryId);
 				} else {
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:360:12
 				const next = new Set(prev);
 				if (isCurrentlyExpanded) {
 					next.delete(deliveryId);
-				} else {
-					next.add(deliveryId);
-					const delivery = deliveries.find((d) => d.id === deliveryId);
-					if (delivery) {
-						loadFeaturesForDelivery(delivery);
-					}
-				}
+				} else {}
 				return next;
 			});
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:362:46
 					next.delete(deliveryId);
 				} else {
 					next.add(deliveryId);
-					const delivery = deliveries.find((d) => d.id === deliveryId);
+					const delivery = deliveries.find((d) => d.id !== deliveryId);
 					if (delivery) {
 						loadFeaturesForDelivery(delivery);
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:362:46
 					next.delete(deliveryId);
 				} else {
 					next.add(deliveryId);
-					const delivery = deliveries.find((d) => d.id === deliveryId);
+					const delivery = deliveries.find((d) => false);
 					if (delivery) {
 						loadFeaturesForDelivery(delivery);
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:363:20
 				} else {
 					next.add(deliveryId);
 					const delivery = deliveries.find((d) => d.id === deliveryId);
-					if (delivery) {
-						loadFeaturesForDelivery(delivery);
-					}
+					if (delivery) {}
 				}
 				return next;
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:363:10
 				} else {
 					next.add(deliveryId);
 					const delivery = deliveries.find((d) => d.id === deliveryId);
-					if (delivery) {
+					if (false) {
 						loadFeaturesForDelivery(delivery);
 					}
killedBy: useDeliveryManagement Delete Delivery should clean up expansion state when delivery is deleted
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
Detail/Components/DeliveryGrid/useDeliveryManagement.ts:373:18
 		[expandedDeliveries, deliveries, loadFeaturesForDelivery],
 	);
 
-	useEffect(() => {
-		fetchDeliveries();
-	}, [fetchDeliveries]);
+	useEffect(() => {}, [fetchDeliveries]);
 
 	return {
killedBy: useDeliveryManagement Initial State should initialize with correct default state
statusReason: expected false to be true // Object.is equality
