[NoCoverage] BooleanLiteral
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:20:12
 
 const PortfolioDeliveryView: React.FC<PortfolioDeliveryViewProps> = ({
 	portfolio,
-	canEdit = true,
+	canEdit = false,
 }) => {
 	const {

[Killed] ObjectLiteral
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:46:28
 		loadedFeatures,
 		loadingFeaturesByDelivery,
 		handleToggleExpanded,
-	} = useDeliveryManagement({ portfolio });
+	} = useDeliveryManagement({});
 
 	// Asked once for the whole list rather than per row: the answer is the same for every Delivery
killedBy: PortfolioDeliveryView - RBAC action gating shows Add Delivery, Edit, and Delete buttons when canEdit is true
statusReason: Unable to find an element with the text: Phoenix Release. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiAlert-root MuiAlert-colorEr

[Killed] OptionalChaining
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:51:21
 	// Asked once for the whole list rather than per row: the answer is the same for every Delivery
 	// on the page, and asking per row means a licence lookup for each one.
 	const { licenseStatus } = useLicenseRestrictions();
-	const canArchive = licenseStatus?.canUsePremiumFeatures ?? false;
+	const canArchive = licenseStatus.canUsePremiumFeatures ?? false;
 
 	return (
killedBy: PortfolioDeliveryView - retiring a Delivery keeps the retired Deliveries out of the live list and under their own heading
statusReason: Unable to find an element with the text: Phoenix Release. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiAlert-root MuiAlert-colorEr

[Killed] LogicalOperator
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:51:21
 	// Asked once for the whole list rather than per row: the answer is the same for every Delivery
 	// on the page, and asking per row means a licence lookup for each one.
 	const { licenseStatus } = useLicenseRestrictions();
-	const canArchive = licenseStatus?.canUsePremiumFeatures ?? false;
+	const canArchive = licenseStatus?.canUsePremiumFeatures && false;
 
 	return (
killedBy: PortfolioDeliveryView - retiring a Delivery asks before archiving, and archives on the version it is looking at
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  aria-label="archive"
  class="MuiButtonBase-root Mui-disabled MuiIconButton-root Mui-disabled MuiIconButton-sizeSmall css-sctndk-MuiButtonBase-root-MuiIconButton-root"
  disabled=""
  tabindex="-1"

[Killed] ConditionalExpression
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:55:5
 
 	return (
 		<Box>
-			{canEdit && <DeliveryHeader onAddDelivery={handleAddDelivery} />}
+			{false}
 
 			{/* Render delivery sections instead of a grid */}
killedBy: PortfolioDeliveryView - RBAC action gating shows Add Delivery, Edit, and Delete buttons when canEdit is true
statusReason: Unable to find an accessible element with the role "button" and name "Add Delivery"

Here are the accessible roles:

  heading:

  Name "Premium feature - Upgrade to use Phoenix Release Manual: Features are fixed Delivery Date: 6/1/2026 All Features by 6/1/2026: 80% Forecast: 0 Features (10 Work Items) 0 50% (5/10)":
  <h3

[Killed] LogicalOperator
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:55:5
 
 	return (
 		<Box>
-			{canEdit && <DeliveryHeader onAddDelivery={handleAddDelivery} />}
+			{canEdit || <DeliveryHeader onAddDelivery={handleAddDelivery} />}
 
 			{/* Render delivery sections instead of a grid */}
killedBy: PortfolioDeliveryView - RBAC action gating shows Add Delivery, Edit, and Delete buttons when canEdit is true
statusReason: Unable to find an accessible element with the role "button" and name "Add Delivery"

Here are the accessible roles:

  heading:

  Name "Premium feature - Upgrade to use Phoenix Release Manual: Features are fixed Delivery Date: 6/1/2026 All Features by 6/1/2026: 80% Forecast: 0 Features (10 Work Items) 0 50% (5/10)":
  <h3

[Killed] BlockStatement
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:59:35
 
 			{/* Render delivery sections instead of a grid */}
 			<Box sx={{ mt: 2 }}>
-				{deliveries.map((delivery) => {
-					const isExpanded = expandedDeliveries.has(delivery.id);
-					const features = loadedFeatures.get(delivery.id) || [];
-					const isLoadingFeatures = loadingFeaturesByDelivery.has(delivery.id);
-
-					return (
-						<DeliverySection
-							key={delivery.id}
-							delivery={delivery}
-							features={features}
-							isExpanded={isExpanded}
-							isLoadingFeatures={isLoadingFeatures}
-							onToggleExpanded={handleToggleExpanded}
-							onDelete={handleDeleteDelivery}
-							onEdit={handleEditDelivery}
-							onArchive={handleArchiveDelivery}
-							teams={portfolio.involvedTeams}
-							canEdit={canEdit}
-							canArchive={canArchive}
-						/>
-					);
-				})}
+				{deliveries.map((delivery) => {})}
 
 				<ArchivedDeliveriesSection
killedBy: PortfolioDeliveryView - RBAC action gating shows Add Delivery, Edit, and Delete buttons when canEdit is true
statusReason: Unable to find an element with the text: Phoenix Release. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:61:23
 			<Box sx={{ mt: 2 }}>
 				{deliveries.map((delivery) => {
 					const isExpanded = expandedDeliveries.has(delivery.id);
-					const features = loadedFeatures.get(delivery.id) || [];
+					const features = false;
 					const isLoadingFeatures = loadingFeaturesByDelivery.has(delivery.id);
 
killedBy: PortfolioDeliveryView - retiring a Delivery keeps the retired Deliveries out of the live list and under their own heading
statusReason: Unable to find an element with the text: Phoenix Release. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiAlert-root MuiAlert-colorEr

[Killed] LogicalOperator
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:61:23
 			<Box sx={{ mt: 2 }}>
 				{deliveries.map((delivery) => {
 					const isExpanded = expandedDeliveries.has(delivery.id);
-					const features = loadedFeatures.get(delivery.id) || [];
+					const features = loadedFeatures.get(delivery.id) && [];
 					const isLoadingFeatures = loadingFeaturesByDelivery.has(delivery.id);
 
killedBy: PortfolioDeliveryView - RBAC action gating shows Add Delivery, Edit, and Delete buttons when canEdit is true
statusReason: Unable to find an element with the text: Phoenix Release. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiAlert-root MuiAlert-colorEr

[Killed] ConditionalExpression
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:90:5
 				/>
 			</Box>
 
-			{canEdit && (
-				<DeliveryModals
-					portfolio={portfolio}
-					showCreateModal={showCreateModal}
-					selectedDelivery={selectedDelivery}
-					deliveryToDelete={deliveryToDelete}
-					deleteDialogOpen={deleteDialogOpen}
-					onCloseCreateModal={handleCloseCreateModal}
-					onCloseEditModal={handleCloseEditModal}
-					onCreateDelivery={handleCreateDelivery}
-					onUpdateDelivery={handleUpdateDelivery}
-					deliveryToArchive={deliveryToArchive}
-					archiveDialogOpen={archiveDialogOpen}
-					onDeleteConfirmation={handleDeleteConfirmation}
-					onArchiveConfirmation={handleArchiveConfirmation}
-				/>
-			)}
+			{false}
 		</Box>
 	);
killedBy: PortfolioDeliveryView - retiring a Delivery asks before archiving, and archives on the version it is looking at
statusReason: Unable to find an element with the text: /bring it back/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
pages/Portfolios/Detail/PortfolioDeliveryView.tsx:90:5
 				/>
 			</Box>
 
-			{canEdit && (
-				<DeliveryModals
-					portfolio={portfolio}
-					showCreateModal={showCreateModal}
-					selectedDelivery={selectedDelivery}
-					deliveryToDelete={deliveryToDelete}
-					deleteDialogOpen={deleteDialogOpen}
-					onCloseCreateModal={handleCloseCreateModal}
-					onCloseEditModal={handleCloseEditModal}
-					onCreateDelivery={handleCreateDelivery}
-					onUpdateDelivery={handleUpdateDelivery}
-					deliveryToArchive={deliveryToArchive}
-					archiveDialogOpen={archiveDialogOpen}
-					onDeleteConfirmation={handleDeleteConfirmation}
-					onArchiveConfirmation={handleArchiveConfirmation}
-				/>
-			)}
+			{true}
 		</Box>
 	);
killedBy: PortfolioDeliveryView - retiring a Delivery asks before archiving, and archives on the version it is looking at
statusReason: Unable to find an element with the text: /bring it back/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >
