[Killed] BlockStatement
src/services/Api/ApiError.ts:19:4
 		technicalDetails?: string,
 		fieldName?: string,
 		problemCode?: string,
-	) {
-		super(message);
-		this.code = code;
-		this.technicalDetails = technicalDetails;
-		this.fieldName = fieldName;
-		this.problemCode = problemCode;
-		this.name = "ApiError";
-		// Set the prototype explicitly for older TS targets
-		Object.setPrototypeOf(this, ApiError.prototype);
-	}
+	) {}
 
 	toString() {
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[NoCoverage] BlockStatement
src/services/Api/ApiError.ts:30:13
 		Object.setPrototypeOf(this, ApiError.prototype);
 	}
 
-	toString() {
-		return `ApiError(${this.code}): ${this.message}`;
-	}
+	toString() {}
 }
 
