[Killed] BlockStatement
src/utils/deliveries/deliveryArchivedRefusal.ts:11:60
  * telling a reader they are out of date when the truth is that the Delivery is retired sends them
  * to refresh a page that will say exactly the same thing again.
  */
-export function isArchivedRefusal(error: unknown): boolean {
-	return (
-		error instanceof ApiError && error.problemCode === DELIVERY_ARCHIVED_CODE
-	);
-}
+export function isArchivedRefusal(error: unknown): boolean {}
 
 export function archivedRefusalMessage(deliveryTerm: string): string {
killedBy: useDeliveryManagement Delivery Update says the Delivery is archived rather than telling the reader to refresh
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "This Delivery is archived, so it can no longer be changed. Bring it back first.",

[Killed] LogicalOperator
src/utils/deliveries/deliveryArchivedRefusal.ts:13:3
  */
 export function isArchivedRefusal(error: unknown): boolean {
 	return (
-		error instanceof ApiError && error.problemCode === DELIVERY_ARCHIVED_CODE
+		error instanceof ApiError || error.problemCode === DELIVERY_ARCHIVED_CODE
 	);
 }
killedBy: useDeliveryManagement Archiving says a stale version was refused rather than reporting a plain failure
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching{…} ]

Received:

  1st vi.fn() call:

  [
-   StringMatching /changed by someone else/i,

[Killed] ConditionalExpression
src/utils/deliveries/deliveryArchivedRefusal.ts:13:3
  */
 export function isArchivedRefusal(error: unknown): boolean {
 	return (
-		error instanceof ApiError && error.problemCode === DELIVERY_ARCHIVED_CODE
+		false
 	);
 }
killedBy: useDeliveryManagement Delivery Update says the Delivery is archived rather than telling the reader to refresh
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "This Delivery is archived, so it can no longer be changed. Bring it back first.",

[Killed] BlockStatement
src/utils/deliveries/deliveryArchivedRefusal.ts:17:70
 	);
 }
 
-export function archivedRefusalMessage(deliveryTerm: string): string {
-	return `This ${deliveryTerm} is archived, so it can no longer be changed. Bring it back first.`;
-}
+export function archivedRefusalMessage(deliveryTerm: string): string {}
 
 /** The reason the server sends when asked to bring back something that is not away. */
killedBy: useDeliveryManagement Delivery Update says the Delivery is archived rather than telling the reader to refresh
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "This Delivery is archived, so it can no longer be changed. Bring it back first.",

[Killed] StringLiteral
src/utils/deliveries/deliveryArchivedRefusal.ts:18:9
 }
 
 export function archivedRefusalMessage(deliveryTerm: string): string {
-	return `This ${deliveryTerm} is archived, so it can no longer be changed. Bring it back first.`;
+	return ``;
 }
 
killedBy: useDeliveryManagement Delivery Update says the Delivery is archived rather than telling the reader to refresh
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "This Delivery is archived, so it can no longer be changed. Bring it back first.",

[Survived] BlockStatement
src/utils/deliveries/deliveryArchivedRefusal.ts:28:63
  * The exact opposite instruction to the one above, and it arrives as the same conflict — so a screen
  * reading only the status would tell somebody to bring back a Delivery that is already back.
  */
-export function isNotArchivedRefusal(error: unknown): boolean {
-	return (
-		error instanceof ApiError &&
-		error.problemCode === DELIVERY_NOT_ARCHIVED_CODE
-	);
-}
+export function isNotArchivedRefusal(error: unknown): boolean {}
 
 export function notArchivedRefusalMessage(deliveryTerm: string): string {

[Killed] LogicalOperator
src/utils/deliveries/deliveryArchivedRefusal.ts:30:3
  */
 export function isNotArchivedRefusal(error: unknown): boolean {
 	return (
-		error instanceof ApiError &&
-		error.problemCode === DELIVERY_NOT_ARCHIVED_CODE
+		error instanceof ApiError || error.problemCode === DELIVERY_NOT_ARCHIVED_CODE
 	);
 }
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] ConditionalExpression
src/utils/deliveries/deliveryArchivedRefusal.ts:30:3
  */
 export function isNotArchivedRefusal(error: unknown): boolean {
 	return (
-		error instanceof ApiError &&
-		error.problemCode === DELIVERY_NOT_ARCHIVED_CODE
+		true
 	);
 }
killedBy: useDeliveryManagement Delivery Update should handle update delivery error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to update Delivery' ]

Received:

  1st vi.fn() call:

  [
-   "Failed to update Delivery",

[Killed] EqualityOperator
src/utils/deliveries/deliveryArchivedRefusal.ts:31:3
 export function isNotArchivedRefusal(error: unknown): boolean {
 	return (
 		error instanceof ApiError &&
-		error.problemCode === DELIVERY_NOT_ARCHIVED_CODE
+		error.problemCode !== DELIVERY_NOT_ARCHIVED_CODE
 	);
 }
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] ConditionalExpression
src/utils/deliveries/deliveryArchivedRefusal.ts:31:3
 export function isNotArchivedRefusal(error: unknown): boolean {
 	return (
 		error instanceof ApiError &&
-		error.problemCode === DELIVERY_NOT_ARCHIVED_CODE
+		true
 	);
 }
killedBy: PortfolioDeliveryView - retiring a Delivery says so when the Delivery moved on while the confirmation was open
statusReason: Unable to find an element with the text: /changed by someone else/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[NoCoverage] BlockStatement
src/utils/deliveries/deliveryArchivedRefusal.ts:35:73
 	);
 }
 
-export function notArchivedRefusalMessage(deliveryTerm: string): string {
-	return `This ${deliveryTerm} is already back in the active list.`;
-}
+export function notArchivedRefusalMessage(deliveryTerm: string): string {}
 

[NoCoverage] StringLiteral
src/utils/deliveries/deliveryArchivedRefusal.ts:36:9
 }
 
 export function notArchivedRefusalMessage(deliveryTerm: string): string {
-	return `This ${deliveryTerm} is already back in the active list.`;
+	return ``;
 }
 
