[Killed] ObjectLiteral
src/models/Delivery/ArchivedDelivery.ts:17:43
  * not meant to be: the Feature may have been renamed, moved to another Team or deleted since, and a
  * row that could reach it would show today's answer under a heading promising the closing day's.
  */
-const ArchivedFeatureRowSchema = z.object({
-	referenceId: z.string(),
-	name: z.string(),
-	completion: z.number(),
-	likelihood: z
-		.number()
-		.nullish()
-		.transform((value) => value ?? null),
-	totalItems: z
-		.number()
-		.nullish()
-		.transform((value) => value ?? null),
-	isUsingDefaultSize: z
-		.boolean()
-		.nullish()
-		.transform((value) => value ?? null),
-});
+const ArchivedFeatureRowSchema = z.object({});
 
 export const ArchivedDeliverySchema = z.object({
killedBy: buildArchivedDeliveryExportTable writes the Feature rows that were noted, not ones worked out now
statusReason: expected undefined to be 'FTR-1: Checkout rewrite' // Object.is equality

[Killed] LogicalOperator
src/models/Delivery/ArchivedDelivery.ts:24:25
 	likelihood: z
 		.number()
 		.nullish()
-		.transform((value) => value ?? null),
+		.transform((value) => value && null),
 	totalItems: z
 		.number()
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an element with the text: 72%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--P

[Killed] ArrowFunction
src/models/Delivery/ArchivedDelivery.ts:24:14
 	likelihood: z
 		.number()
 		.nullish()
-		.transform((value) => value ?? null),
+		.transform(() => undefined),
 	totalItems: z
 		.number()
killedBy: ArchivedDelivery carries the Feature rows themselves, so there is nothing to look up
statusReason: expected [ { referenceId: 'FTR-1', …(5) } ] to deeply equal [ { referenceId: 'FTR-1', …(5) } ]

[Killed] ObjectLiteral
src/models/Delivery/ArchivedDelivery.ts:35:48
 		.transform((value) => value ?? null),
 });
 
-export const ArchivedDeliverySchema = z.object({
-	id: z.number(),
-	name: z.string(),
-	date: z.string(),
-	portfolioId: z.number(),
-	archivedOn: z.string(),
-	progress: z.number(),
-	totalWork: z.number(),
-	doneWork: z.number(),
-	remainingWork: z.number(),
-	likelihoodPercentage: z.number().nullable(),
-	hasSufficientData: z.boolean(),
-	teamsWithoutForecast: z.array(z.string()),
-	selectionMode: z.union([z.string(), z.number()]),
-	concurrencyToken: z.string(),
-	featureBreakdown: z.array(ArchivedFeatureRowSchema),
-	whenDistribution: z.array(
-		z.object({ probability: z.number(), expectedDate: z.coerce.date() }),
-	),
-	rules: z.array(ruleConditionSchema).default([]),
-	mode: z.string().default("and"),
-	metricSnapshotCount: z.number(),
-});
+export const ArchivedDeliverySchema = z.object({});
 
 export type IArchivedDelivery = z.infer<typeof ArchivedDeliverySchema>;
killedBy: buildArchivedDeliveryExportTable writes the same columns a live Delivery exports, so the two files can be read side by side
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ArrayDeclaration
src/models/Delivery/ArchivedDelivery.ts:48:25
 	likelihoodPercentage: z.number().nullable(),
 	hasSufficientData: z.boolean(),
 	teamsWithoutForecast: z.array(z.string()),
-	selectionMode: z.union([z.string(), z.number()]),
+	selectionMode: z.union([]),
 	concurrencyToken: z.string(),
 	featureBreakdown: z.array(ArchivedFeatureRowSchema),
killedBy: buildArchivedDeliveryExportTable writes the same columns a live Delivery exports, so the two files can be read side by side
statusReason: [
  {
    "code": "invalid_union",
    "errors": [],
    "path": [
      "selectionMode"
    ],
    "message": "Invalid input"

[Killed] ObjectLiteral
src/models/Delivery/ArchivedDelivery.ts:52:12
 	concurrencyToken: z.string(),
 	featureBreakdown: z.array(ArchivedFeatureRowSchema),
 	whenDistribution: z.array(
-		z.object({ probability: z.number(), expectedDate: z.coerce.date() }),
+		z.object({}),
 	),
 	rules: z.array(ruleConditionSchema).default([]),
killedBy: buildArchivedDeliveryExportTable carries the forecast dates that were worked out on the closing day
statusReason: expected [ '', '', '', '' ] to deeply equal [ '2026-04-20', '2026-04-24', …(2) ]

[Survived] StringLiteral
src/models/Delivery/ArchivedDelivery.ts:55:27
 		z.object({ probability: z.number(), expectedDate: z.coerce.date() }),
 	),
 	rules: z.array(ruleConditionSchema).default([]),
-	mode: z.string().default("and"),
+	mode: z.string().default(""),
 	metricSnapshotCount: z.number(),
 });

[Killed] BlockStatement
src/models/Delivery/ArchivedDelivery.ts:90:47
 	readonly mode: "and" | "or";
 	readonly metricSnapshotCount: number;
 
-	private constructor(data: IArchivedDelivery) {
-		this.id = data.id;
-		this.name = data.name;
-		this.date = data.date;
-		this.portfolioId = data.portfolioId;
-		this.archivedOn = data.archivedOn;
-		this.progress = data.progress;
-		this.totalWork = data.totalWork;
-		this.doneWork = data.doneWork;
-		this.remainingWork = data.remainingWork;
-		this.likelihoodPercentage = data.likelihoodPercentage;
-		this.hasSufficientData = data.hasSufficientData;
-		this.teamsWithoutForecast = data.teamsWithoutForecast;
-		this.selectionMode = data.selectionMode;
-		this.concurrencyToken = data.concurrencyToken;
-		this.featureBreakdown = data.featureBreakdown;
-		this.whenDistribution = data.whenDistribution;
-		this.rules = data.rules;
-		this.mode = data.mode.toLowerCase() === "or" ? "or" : "and";
-		this.metricSnapshotCount = data.metricSnapshotCount;
-	}
+	private constructor(data: IArchivedDelivery) {}
 
 	static fromParsed(data: IArchivedDelivery): ArchivedDelivery {
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find role="button" and name `/Autumn Launch/`

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] EqualityOperator
src/models/Delivery/ArchivedDelivery.ts:108:15
 		this.featureBreakdown = data.featureBreakdown;
 		this.whenDistribution = data.whenDistribution;
 		this.rules = data.rules;
-		this.mode = data.mode.toLowerCase() === "or" ? "or" : "and";
+		this.mode = data.mode.toLowerCase() !== "or" ? "or" : "and";
 		this.metricSnapshotCount = data.metricSnapshotCount;
 	}
killedBy: ArchivedDelivery keeps the rule the Delivery was picking its Features by
statusReason: expected 'and' to be 'or' // Object.is equality

[Killed] MethodExpression
src/models/Delivery/ArchivedDelivery.ts:108:15
 		this.featureBreakdown = data.featureBreakdown;
 		this.whenDistribution = data.whenDistribution;
 		this.rules = data.rules;
-		this.mode = data.mode.toLowerCase() === "or" ? "or" : "and";
+		this.mode = data.mode.toUpperCase() === "or" ? "or" : "and";
 		this.metricSnapshotCount = data.metricSnapshotCount;
 	}
killedBy: ArchivedDelivery keeps the rule the Delivery was picking its Features by
statusReason: expected 'and' to be 'or' // Object.is equality

[Killed] BlockStatement
src/models/Delivery/ArchivedDelivery.ts:112:63
 		this.metricSnapshotCount = data.metricSnapshotCount;
 	}
 
-	static fromParsed(data: IArchivedDelivery): ArchivedDelivery {
-		return new ArchivedDelivery(data);
-	}
+	static fromParsed(data: IArchivedDelivery): ArchivedDelivery {}
 
 	get isRuleBased(): boolean {
killedBy: ArchivedDelivery reads every number the server wrote down at closure
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/models/Delivery/ArchivedDelivery.ts:116:29
 		return new ArchivedDelivery(data);
 	}
 
-	get isRuleBased(): boolean {
-		return (
-			this.selectionMode === DeliverySelectionMode.RuleBased ||
-			this.selectionMode === "RuleBased"
-		);
-	}
+	get isRuleBased(): boolean {}
 
 	getFormattedDate(): string {
killedBy: ArchivedDelivery keeps the rule the Delivery was picking its Features by
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/models/Delivery/ArchivedDelivery.ts:118:4
 
 	get isRuleBased(): boolean {
 		return (
-			this.selectionMode === DeliverySelectionMode.RuleBased ||
-			this.selectionMode === "RuleBased"
+			false
 		);
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] LogicalOperator
src/models/Delivery/ArchivedDelivery.ts:118:4
 
 	get isRuleBased(): boolean {
 		return (
-			this.selectionMode === DeliverySelectionMode.RuleBased ||
-			this.selectionMode === "RuleBased"
+			this.selectionMode === DeliverySelectionMode.RuleBased && this.selectionMode === "RuleBased"
 		);
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
src/models/Delivery/ArchivedDelivery.ts:119:4
 	get isRuleBased(): boolean {
 		return (
 			this.selectionMode === DeliverySelectionMode.RuleBased ||
-			this.selectionMode === "RuleBased"
+			false
 		);
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] EqualityOperator
src/models/Delivery/ArchivedDelivery.ts:119:4
 	get isRuleBased(): boolean {
 		return (
 			this.selectionMode === DeliverySelectionMode.RuleBased ||
-			this.selectionMode === "RuleBased"
+			this.selectionMode !== "RuleBased"
 		);
 	}
killedBy: Reading a retired Delivery as the record it was still says the Features were picked by a rule, and which rule
statusReason: Unable to find a label with the text of: /tag equals autumn/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BlockStatement
src/models/Delivery/ArchivedDelivery.ts:123:29
 		);
 	}
 
-	getFormattedDate(): string {
-		return ArchivedDelivery.formatUtcDay(this.date);
-	}
+	getFormattedDate(): string {}
 
 	getFormattedArchivedOn(): string {
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/models/Delivery/ArchivedDelivery.ts:127:35
 		return ArchivedDelivery.formatUtcDay(this.date);
 	}
 
-	getFormattedArchivedOn(): string {
-		return ArchivedDelivery.formatUtcDay(this.archivedOn);
-	}
+	getFormattedArchivedOn(): string {}
 
 	// Both days are read in UTC, so the day a Delivery closed reads the same to everyone looking
killedBy: ArchivedDelivery formats both dates in UTC, so the closing day reads the same everywhere
statusReason: expected undefined to be '8/20/2026' // Object.is equality

[Killed] BlockStatement
src/models/Delivery/ArchivedDelivery.ts:133:53
 
 	// Both days are read in UTC, so the day a Delivery closed reads the same to everyone looking
 	// at the same record from a different offset.
-	private static formatUtcDay(value: string): string {
-		return new Date(value).toLocaleDateString(undefined, { timeZone: "UTC" });
-	}
+	private static formatUtcDay(value: string): string {}
 }
 
killedBy: ArchivedDeliveriesSection shows the name, the date and the numbers that were written down once opened
statusReason: Cannot read properties of undefined (reading 'replace')
