[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/ArchiveConfirmationDialog.tsx:55:28
 					writes down the numbers it shows right now, so they stay as they stand
 					today.
 				</DialogContentText>
-				<DialogContentText sx={{ mt: 2 }}>
+				<DialogContentText sx={{}}>
 					You can bring it back at any time. Archiving is not the same as
 					deleting, and it does not stand in the way of deleting either — an
