[Killed] StringLiteral
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:57:17
 			},
 			{
 				field: "name",
-				headerName: `${featureTerm} Name`,
+				headerName: ``,
 				hideable: false,
 				minWidth: 160,
killedBy: ArchivedFeatureGrid carries only the columns the record held
statusReason: Unable to find an element with the text: Feature Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:67:17
 				headerName: "Completion",
 				minWidth: 110,
 				flex: 0.4,
-				renderCell: ({ row }) => (
-					<Typography variant="body2">
-						{`${Math.round(row.completion)}%`}
-					</Typography>
-				),
+				renderCell: () => undefined,
 			},
 			{
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an element with the text: 60%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--P

[Killed] StringLiteral
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:69:8
 				flex: 0.4,
 				renderCell: ({ row }) => (
 					<Typography variant="body2">
-						{`${Math.round(row.completion)}%`}
+						{``}
 					</Typography>
 				),
killedBy: Reading a retired Delivery as the record it was shows the Feature rows that were written down
statusReason: Unable to find an element with the text: 60%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--P

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:78:17
 				headerName: "Likelihood",
 				minWidth: 120,
 				flex: 0.4,
-				renderCell: ({ row }) => (
-					<Typography variant="body2">
-						{row.likelihood === null
-							? CANNOT_FORECAST_SHORT
-							: formatLikelihood(row.likelihood, {
-									hasRemainingWork: row.completion < 100,
-									precision: "round",
-								})}
-					</Typography>
-				),
+				renderCell: () => undefined,
 			},
 			{
killedBy: ArchivedFeatureGrid shows each row's totals as they were noted
statusReason: Unable to find an element with the text: 72%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:80:8
 				flex: 0.4,
 				renderCell: ({ row }) => (
 					<Typography variant="body2">
-						{row.likelihood === null
+						{false
 							? CANNOT_FORECAST_SHORT
 							: formatLikelihood(row.likelihood, {
killedBy: ArchivedFeatureGrid says a Feature could not be forecast rather than showing a blank chance
statusReason: Unable to find an element with the text: Cannot forecast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:80:8
 				flex: 0.4,
 				renderCell: ({ row }) => (
 					<Typography variant="body2">
-						{row.likelihood === null
+						{true
 							? CANNOT_FORECAST_SHORT
 							: formatLikelihood(row.likelihood, {
killedBy: ArchivedFeatureGrid shows each row's totals as they were noted
statusReason: Unable to find an element with the text: 72%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:89:4
 					</Typography>
 				),
 			},
-			{
-				field: "totalItems",
-				headerName: workItemsTerm,
-				minWidth: 100,
-				flex: 0.3,
-				renderCell: ({ row }) => (
-					<Typography variant="body2">
-						{row.totalItems ?? NOT_RECORDED}
-					</Typography>
-				),
-			},
+			{},
 			{
 				field: "isUsingDefaultSize",
killedBy: ArchivedFeatureGrid shows each row's totals as they were noted
statusReason: Unable to find an element with the text: 20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:94:17
 				headerName: workItemsTerm,
 				minWidth: 100,
 				flex: 0.3,
-				renderCell: ({ row }) => (
-					<Typography variant="body2">
-						{row.totalItems ?? NOT_RECORDED}
-					</Typography>
-				),
+				renderCell: () => undefined,
 			},
 			{
killedBy: ArchivedFeatureGrid shows a dash where a row recorded before sizes were kept has no count
statusReason: Unable to find an element with the text: —. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:96:8
 				flex: 0.3,
 				renderCell: ({ row }) => (
 					<Typography variant="body2">
-						{row.totalItems ?? NOT_RECORDED}
+						{row.totalItems && NOT_RECORDED}
 					</Typography>
 				),
killedBy: ArchivedFeatureGrid shows each row's totals as they were noted
statusReason: Unable to find an element with the text: 20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:100:4
 					</Typography>
 				),
 			},
-			{
-				field: "isUsingDefaultSize",
-				headerName: "Size",
-				minWidth: 110,
-				flex: 0.3,
-				sortable: false,
-				renderCell: ({ row }) =>
-					row.isUsingDefaultSize === true ? (
-						<Tooltip
-							title={`No child ${workItemsTerm} were found for this ${featureTerm}, so the count is the configured default size rather than a measurement.`}
-						>
-							<Typography variant="body2" color="text.secondary">
-								Estimated
-							</Typography>
-						</Tooltip>
-					) : null,
-			},
+			{},
 		],
 		[featureTerm, workItemsTerm],
killedBy: ArchivedFeatureGrid marks the Feature whose size was a default rather than a count
statusReason: Unable to find an element with the text: Estimated. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ArrowFunction
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:106:17
 				minWidth: 110,
 				flex: 0.3,
 				sortable: false,
-				renderCell: ({ row }) =>
-					row.isUsingDefaultSize === true ? (
-						<Tooltip
-							title={`No child ${workItemsTerm} were found for this ${featureTerm}, so the count is the configured default size rather than a measurement.`}
-						>
-							<Typography variant="body2" color="text.secondary">
-								Estimated
-							</Typography>
-						</Tooltip>
-					) : null,
+				renderCell: () => undefined,
 			},
 		],
killedBy: ArchivedFeatureGrid marks the Feature whose size was a default rather than a count
statusReason: Unable to find an element with the text: Estimated. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:107:6
 				flex: 0.3,
 				sortable: false,
 				renderCell: ({ row }) =>
-					row.isUsingDefaultSize === true ? (
+					false ? (
 						<Tooltip
 							title={`No child ${workItemsTerm} were found for this ${featureTerm}, so the count is the configured default size rather than a measurement.`}
killedBy: ArchivedFeatureGrid marks the Feature whose size was a default rather than a count
statusReason: Unable to find an element with the text: Estimated. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-yj9vk9"
    >

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:107:6
 				flex: 0.3,
 				sortable: false,
 				renderCell: ({ row }) =>
-					row.isUsingDefaultSize === true ? (
+					true ? (
 						<Tooltip
 							title={`No child ${workItemsTerm} were found for this ${featureTerm}, so the count is the configured default size rather than a measurement.`}
killedBy: ArchivedFeatureGrid marks the Feature whose size was a default rather than a count
statusReason: Found multiple elements with the text: Estimated

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  aria-label="No child Work Items were found for this Feature, so the count is the configured default size rather than a measurement."
  class="MuiTypography-root MuiTypography-body2 css-7ctihp-MuiTypography-root"

[Killed] BooleanLiteral
Detail/Components/DeliveryGrid/ArchivedFeatureGrid.tsx:130:20
 					idField="referenceId"
 					storageKey={`archived-delivery-features-${deliveryId}`}
 					emptyStateMessage={`No ${featuresTerm} in this record`}
-					enableExport={true}
+					enableExport={false}
 					exportFileName={exportFileName}
 					exportTable={exportTable}
killedBy: Reading a retired Delivery as the record it was takes the numbers that were written down into a report
statusReason: Unable to find an element by: [data-testid="export-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-ahmwxy-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"
