[Killed] ArrowFunction
src/components/UsageData/UsageDataDialog.tsx:137:15
 
 			<DialogActions>
 				<Button
-					onClick={() => onDecision("declined")}
+					onClick={() => undefined}
 					color="inherit"
 					disabled={administratorDisabled}
killedBy: UsageDataAsk > asks once even when the browser will not remember being asked
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] StringLiteral
src/components/UsageData/UsageDataDialog.tsx:137:32
 
 			<DialogActions>
 				<Button
-					onClick={() => onDecision("declined")}
+					onClick={() => onDecision("")}
 					color="inherit"
 					disabled={administratorDisabled}
killedBy: UsageDataDialog > reports a refusal when the reader declines
statusReason: expected "vi.fn()" to be called with arguments: [ 'declined' ]

Received:

  1st vi.fn() call:

  [
-   "declined",

[Killed] ArrowFunction
src/components/UsageData/UsageDataDialog.tsx:144:15
 					No, thank you
 				</Button>
 				<Button
-					onClick={() => onDecision("granted")}
+					onClick={() => undefined}
 					variant="contained"
 					disabled={administratorDisabled}
killedBy: UsageDataDialog > reports a grant when the reader agrees
statusReason: expected "vi.fn()" to be called with arguments: [ 'granted' ]

Number of calls: 0
