[Killed] StringLiteral
src/components/UsageData/UsageDataIndicator.tsx:40:2
 // Not-sending with a subject. Somebody who agreed and was then overruled sees the same silence a
 // refusal produces, and the only thing that tells them apart is this sentence naming who did it.
 const STOPPED_BY_ADMINISTRATOR_LABEL =
-	"Usage data: not being sent, stopped by an administrator";
+	"";
 
 export const UsageDataIndicator = ({
killedBy: UsageDataIndicator, where an administrator has stopped usage data > says nothing is being sent, and says who stopped it
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: not being sent, stopped by an administrator
Received:

[Killed] ConditionalExpression
src/components/UsageData/UsageDataIndicator.tsx:48:20
 }: UsageDataIndicatorProps): React.ReactElement => {
 	const theme = useTheme();
 
-	const isSending = state === "sending";
+	const isSending = true;
 	const Icon = isSending ? CloudUploadIcon : CloudOffIcon;
 
killedBy: UsageDataIndicator > says it is not sending, in words rather than as a symbol to interpret
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: not being sent
Received:
  Usage data: being sent from this browser

[Killed] ConditionalExpression
src/components/UsageData/UsageDataIndicator.tsx:48:20
 }: UsageDataIndicatorProps): React.ReactElement => {
 	const theme = useTheme();
 
-	const isSending = state === "sending";
+	const isSending = false;
 	const Icon = isSending ? CloudUploadIcon : CloudOffIcon;
 
killedBy: UsageDataIndicator > says it is sending, in words rather than as a symbol to interpret
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: being sent from this browser
Received:
  Usage data: not being sent

[Killed] ConditionalExpression
src/components/UsageData/UsageDataIndicator.tsx:53:6
 
 	let label = NOT_SENDING_LABEL;
 
-	if (isSending) {
+	if (true) {
 		label = SENDING_LABEL;
 	} else if (state === "disabled-by-administrator") {
killedBy: UsageDataIndicator > says it is not sending, in words rather than as a symbol to interpret
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: not being sent
Received:
  Usage data: being sent from this browser

[Killed] BlockStatement
src/components/UsageData/UsageDataIndicator.tsx:53:17
 
 	let label = NOT_SENDING_LABEL;
 
-	if (isSending) {
-		label = SENDING_LABEL;
-	} else if (state === "disabled-by-administrator") {
+	if (isSending) {} else if (state === "disabled-by-administrator") {
 		label = STOPPED_BY_ADMINISTRATOR_LABEL;
 	}
killedBy: UsageDataIndicator > says it is sending, in words rather than as a symbol to interpret
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: being sent from this browser
Received:
  Usage data: not being sent

[Killed] ConditionalExpression
src/components/UsageData/UsageDataIndicator.tsx:55:13
 
 	if (isSending) {
 		label = SENDING_LABEL;
-	} else if (state === "disabled-by-administrator") {
+	} else if (true) {
 		label = STOPPED_BY_ADMINISTRATOR_LABEL;
 	}
killedBy: UsageDataIndicator > says it is not sending, in words rather than as a symbol to interpret
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: not being sent
Received:
  Usage data: not being sent, stopped by an administrator

[Killed] EqualityOperator
src/components/UsageData/UsageDataIndicator.tsx:55:13
 
 	if (isSending) {
 		label = SENDING_LABEL;
-	} else if (state === "disabled-by-administrator") {
+	} else if (state !== "disabled-by-administrator") {
 		label = STOPPED_BY_ADMINISTRATOR_LABEL;
 	}
killedBy: UsageDataIndicator > says it is not sending, in words rather than as a symbol to interpret
statusReason: expect(element).toHaveAccessibleName()

Expected element to have accessible name:
  Usage data: not being sent
Received:
  Usage data: not being sent, stopped by an administrator
