[Killed] BlockStatement
src/hooks/useUsageDataConsent.tsx:112:7
 
 	const refresh = useCallback(async () => {
-		try {
-			const state = await usageDataService.getState(
-				readUsageDataConsentToken(),
-			);
-			// Asked in this order deliberately. Somebody whose instance was stopped after they
-			// agreed is not sending either, and reading their own decision first would show them
-			// the same words a refusal shows - which is the one thing the fourth state exists to
-			// prevent.
-			if (state.administratorDisabled) {
-				setIndicatorState("disabled-by-administrator");
-			} else {
-				setIndicatorState(state.sending ? "sending" : "not-sending");
-			}
-
-			setAdministratorDisabled(state.administratorDisabled);
-			setMayAsk(state.mayAsk);
-			setReAskAfterDays(state.reAskAfterDays);
-			setDecision(state.decision);
-		} catch {
+		try {} catch {
 			// Not knowing whether to ask means not asking. A dialog opened because a request failed
 			// would arrive for people the administrator had stopped usage data for.
killedBy: useUsageDataConsent > says an administrator stopped it, rather than showing the silence of a refusal
statusReason: expected 'unknown' to be 'disabled-by-administrator' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useUsageDataConsent.tsx:120:8
 			// agreed is not sending either, and reading their own decision first would show them
 			// the same words a refusal shows - which is the one thing the fourth state exists to
 			// prevent.
-			if (state.administratorDisabled) {
+			if (true) {
 				setIndicatorState("disabled-by-administrator");
 			} else {
killedBy: useUsageDataConsent > says nobody stopped anything when nobody has
statusReason: expected 'disabled-by-administrator' to be 'sending' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useUsageDataConsent.tsx:120:8
 			// agreed is not sending either, and reading their own decision first would show them
 			// the same words a refusal shows - which is the one thing the fourth state exists to
 			// prevent.
-			if (state.administratorDisabled) {
+			if (false) {
 				setIndicatorState("disabled-by-administrator");
 			} else {
killedBy: useUsageDataConsent > says an administrator stopped it, rather than showing the silence of a refusal
statusReason: expected 'not-sending' to be 'disabled-by-administrator' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
src/hooks/useUsageDataConsent.tsx:121:23
 			// the same words a refusal shows - which is the one thing the fourth state exists to
 			// prevent.
 			if (state.administratorDisabled) {
-				setIndicatorState("disabled-by-administrator");
+				setIndicatorState("");
 			} else {
 				setIndicatorState(state.sending ? "sending" : "not-sending");
killedBy: useUsageDataConsent > says an administrator stopped it, rather than showing the silence of a refusal
statusReason: expected '' to be 'disabled-by-administrator' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useUsageDataConsent.tsx:122:11
 			// prevent.
 			if (state.administratorDisabled) {
 				setIndicatorState("disabled-by-administrator");
-			} else {
-				setIndicatorState(state.sending ? "sending" : "not-sending");
-			}
+			} else {}
 
 			setAdministratorDisabled(state.administratorDisabled);
killedBy: useUsageDataConsent > says nobody stopped anything when nobody has
statusReason: expected 'unknown' to be 'sending' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useUsageDataConsent.tsx:133:14
 		} catch {
 			// Not knowing whether to ask means not asking. A dialog opened because a request failed
 			// would arrive for people the administrator had stopped usage data for.
-			setMayAsk(false);
+			setMayAsk(true);
 			// The indicator fails closed. Guessing "sending" when we cannot tell would be alarming
 			// and wrong; guessing "not sending" is only wrong. It must not guess that an
killedBy: useUsageDataConsent > stops claiming to know once the state can no longer be fetched
statusReason: expected true to be false // Object.is equality
