[Killed] ArrowFunction
src/services/UsageData/usageDataAdminVetoCopy.ts:24:47
  * telling them at that moment what their organisation could buy answers a question they did not
  * ask.
  */
-export const administratorStoppedItSentence = (): string =>
-	"Usage data is not being sent from this instance. An administrator has stopped it for everyone here.";
+export const administratorStoppedItSentence = () => undefined;
 
 /**
killedBy: UsageDataDialog, where an administrator has stopped usage data > says why the buttons cannot be used, rather than leaving them dead
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /administrator/i
Received:

[Killed] ArrowFunction
src/services/UsageData/usageDataAdminVetoCopy.ts:36:43
  * It names where the control is on purpose. A reader who can reach it should not have to search,
  * and a reader who cannot now knows what to ask for.
  */
-export const theVetoIsAvailableSentence = (): string =>
-	"If you administer this instance, a Premium licence lets you switch usage data off for everyone on it, under Settings → Configuration → Behaviour Settings.";
+export const theVetoIsAvailableSentence = () => undefined;
 
killedBy: UsageDataDialog, where an administrator has stopped usage data > tells everybody the switch exists, whatever this instance's licence is
statusReason: expected 'May Lighthouse send usage data?Lighth…' to match /premium/i
