[Survived] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:40:8
 		sx={{ p: 2, borderRadius: 2, height: "100%" }}
 	>
 		<CardContent
-			sx={{ height: "100%", display: "flex", flexDirection: "column" }}
+			sx={{}}
 		>
 			<Typography variant="h6">{title}</Typography>

[Survived] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:40:18
 		sx={{ p: 2, borderRadius: 2, height: "100%" }}
 	>
 		<CardContent
-			sx={{ height: "100%", display: "flex", flexDirection: "column" }}
+			sx={{ height: "", display: "flex", flexDirection: "column" }}
 		>
 			<Typography variant="h6">{title}</Typography>

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:56:35
 	const theme = useTheme();
 	const title = `${featuresTerm} over Time`;
 
-	if (history.points.length === 0) {
-		return (
-			<ChartCard title={title}>
-				<Typography variant="body2" color="text.secondary" sx={{ mt: 2 }}>
-					{FORWARD_ONLY_EMPTY_STATE}
-				</Typography>
-			</ChartCard>
-		);
-	}
+	if (history.points.length === 0) {}
 
 	const dataset = history.points.map((point) => ({
killedBy: DeliveryEpicSizeChart count line tells the forecaster the chart builds forward when nothing is recorded yet (AC-1.2)
statusReason: Unable to find an element with the text: /builds forward from today — no snapshots recorded yet/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-

[Killed] EqualityOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:56:6
 	const theme = useTheme();
 	const title = `${featuresTerm} over Time`;
 
-	if (history.points.length === 0) {
+	if (history.points.length !== 0) {
 		return (
 			<ChartCard title={title}>
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: expected [] to deeply equal [ 7, 7, 9 ]

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:66:37
 		);
 	}
 
-	const dataset = history.points.map((point) => ({
-		[LABEL_DATA_KEY]: point.date.toLocaleDateString(),
-		[COUNT_DATA_KEY]: point.featureBreakdown.length,
-	}));
+	const dataset = history.points.map(() => undefined);
 
 	return (
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot read properties of undefined (reading 'epicCount')

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:66:49
 		);
 	}
 
-	const dataset = history.points.map((point) => ({
-		[LABEL_DATA_KEY]: point.date.toLocaleDateString(),
-		[COUNT_DATA_KEY]: point.featureBreakdown.length,
-	}));
+	const dataset = history.points.map((point) => ({}));
 
 	return (
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 7, 7, 9 ]

[Killed] ArrayDeclaration
components/Common/Charts/DeliveryEpicSizeChart.tsx:75:12
 		<ChartCard title={title}>
 			<ChartsContainer
 				dataset={dataset}
-				xAxis={[{ scaleType: "band", dataKey: LABEL_DATA_KEY }]}
+				xAxis={[]}
 				yAxis={[{ id: COUNT_AXIS_ID, position: "right" }]}
 				series={[
killedBy: DeliveryEpicSizeChart count line labels each plotted point with the day it was recorded (AC-1.1)
statusReason: expected undefined to be truthy

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:76:13
 			<ChartsContainer
 				dataset={dataset}
 				xAxis={[{ scaleType: "band", dataKey: LABEL_DATA_KEY }]}
-				yAxis={[{ id: COUNT_AXIS_ID, position: "right" }]}
+				yAxis={[{}]}
 				series={[
 					{
killedBy: DeliveryEpicSizeChart count line draws the count against its own right-hand scale so sizes can share the chart (ADR-122)
statusReason: expected undefined to be 'right' // Object.is equality

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:80:13
 				series={[
 					{
 						id: COUNT_SERIES_ID,
-						type: "line",
+						type: "",
 						dataKey: COUNT_DATA_KEY,
 						label: COUNT_AXIS_LABEL,
killedBy: DeliveryEpicSizeChart count line renders the count as a line and nothing else until sizes ship (DDD-8)
statusReason: expected '' to be 'line' // Object.is equality
