[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:577:37
 	);
 };
 
-export const METRICS_GRID_COLUMNS = { xs: "1fr", lg: "1fr 1fr" };
+export const METRICS_GRID_COLUMNS = {};
 
 interface MetricsTabProps {
killedBy: DeliverySection Metrics tab layout pairs the cards on a wide screen and stacks them on a narrow one (AC-1.4)
statusReason: expected {} to deeply equal { xs: '1fr', lg: '1fr 1fr' }

[Killed] ConditionalExpression
Detail/Components/DeliveryGrid/DeliverySection.tsx:590:6
 	history,
 	featuresTerm,
 }) => {
-	if (isLoading || history === null) {
+	if (false) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
killedBy: DeliverySection Metrics tab shows a loading placeholder while the metrics history is still in flight
statusReason: Unable to find an element with the text: Loading metrics.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"

[Killed] LogicalOperator
Detail/Components/DeliveryGrid/DeliverySection.tsx:590:6
 	history,
 	featuresTerm,
 }) => {
-	if (isLoading || history === null) {
+	if (isLoading && history === null) {
 		return (
 			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
killedBy: DeliverySection Metrics tab layout keeps the placeholder up when the delivery has no metrics to show
statusReason: Unable to find an element with the text: Loading metrics.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-xgmlck-MuiPaper-root"

[Survived] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:592:59
 }) => {
 	if (isLoading || history === null) {
 		return (
-			<Typography variant="body2" color="text.secondary" sx={{ p: 2 }}>
+			<Typography variant="body2" color="text.secondary" sx={{}}>
 				Loading metrics...
 			</Typography>

[Killed] ObjectLiteral
Detail/Components/DeliveryGrid/DeliverySection.tsx:601:8
 	return (
 		<Box
 			data-testid="delivery-metrics-grid"
-			sx={{
-				mx: 2,
-				mb: 2,
-				mt: 2,
-				display: "grid",
-				gap: 2,
-				gridTemplateColumns: METRICS_GRID_COLUMNS,
-			}}
+			sx={{}}
 		>
 			<EnlargeableChart
killedBy: DeliverySection Metrics tab layout gives each of the four cards its own cell so none spans the whole row (AC-1.3)
statusReason: expected 'block' to be 'grid' // Object.is equality
