[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:38:77
 
 class BoundaryError extends Error {}
 
-function asObject(value: unknown, context: string): Record<string, unknown> {
-	if (value === null || typeof value !== "object" || Array.isArray(value)) {
-		throw new BoundaryError(`Expected an object for ${context}`);
-	}
-	return value as Record<string, unknown>;
-}
+function asObject(value: unknown, context: string): Record<string, unknown> {}
 
 function asNumber(value: unknown, context: string): number {
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot read properties of undefined (reading 'points')

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:39:6
 class BoundaryError extends Error {}
 
 function asObject(value: unknown, context: string): Record<string, unknown> {
-	if (value === null || typeof value !== "object" || Array.isArray(value)) {
+	if (true) {
 		throw new BoundaryError(`Expected an object for ${context}`);
 	}
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Expected an object for metrics-history response

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:39:6
 class BoundaryError extends Error {}
 
 function asObject(value: unknown, context: string): Record<string, unknown> {
-	if (value === null || typeof value !== "object" || Array.isArray(value)) {
+	if (value !== null || typeof value !== "object" || Array.isArray(value)) {
 		throw new BoundaryError(`Expected an object for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected an object for metrics-history response

[Killed] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:40:27
 
 function asObject(value: unknown, context: string): Record<string, unknown> {
 	if (value === null || typeof value !== "object" || Array.isArray(value)) {
-		throw new BoundaryError(`Expected an object for ${context}`);
+		throw new BoundaryError(``);
 	}
 	return value as Record<string, unknown>;
killedBy: parseDeliveryMetricsHistory rejects a response that is not an object
statusReason: expected [Function] to throw error including 'metrics-history response' but got ''

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:45:60
 	return value as Record<string, unknown>;
 }
 
-function asNumber(value: unknown, context: string): number {
-	if (typeof value !== "number" || Number.isNaN(value)) {
-		throw new BoundaryError(`Expected a number for ${context}`);
-	}
-	return value;
-}
+function asNumber(value: unknown, context: string): number {}
 
 function asNullableNumber(value: unknown, context: string): number | null {
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:46:6
 }
 
 function asNumber(value: unknown, context: string): number {
-	if (typeof value !== "number" || Number.isNaN(value)) {
+	if (false) {
 		throw new BoundaryError(`Expected a number for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory names the offending field point.totalWork in the boundary error
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:46:6
 }
 
 function asNumber(value: unknown, context: string): number {
-	if (typeof value !== "number" || Number.isNaN(value)) {
+	if (false || Number.isNaN(value)) {
 		throw new BoundaryError(`Expected a number for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory names the offending field point.totalWork in the boundary error
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:52:75
 	return value;
 }
 
-function asNullableNumber(value: unknown, context: string): number | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
-	return asNumber(value, context);
-}
+function asNullableNumber(value: unknown, context: string): number | null {}
 
 function asNullableBoolean(value: unknown, context: string): boolean | null {
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: expected undefined to be 25 // Object.is equality

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:53:45
 }
 
 function asNullableNumber(value: unknown, context: string): number | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
+	if (value === null || value === undefined) {}
 	return asNumber(value, context);
 }
killedBy: parseDeliveryMetricsHistory maps each when-distribution entry's probability and expected date
statusReason: Expected a number for point.estimatedItemCount

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:53:24
 }
 
 function asNullableNumber(value: unknown, context: string): number | null {
-	if (value === null || value === undefined) {
+	if (value === null || value !== undefined) {
 		return null;
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: expected null to be 25 // Object.is equality

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:59:77
 	return asNumber(value, context);
 }
 
-function asNullableBoolean(value: unknown, context: string): boolean | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
-	if (typeof value !== "boolean") {
-		throw new BoundaryError(`Expected a boolean for ${context}`);
-	}
-	return value;
-}
+function asNullableBoolean(value: unknown, context: string): boolean | null {}
 
 function asString(value: unknown, context: string): string {
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:60:45
 }
 
 function asNullableBoolean(value: unknown, context: string): boolean | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
+	if (value === null || value === undefined) {}
 	if (typeof value !== "boolean") {
 		throw new BoundaryError(`Expected a boolean for ${context}`);
killedBy: parseDeliveryMetricsHistory feature breakdown still reads an epic recorded before sizes were ever written
statusReason: Expected a boolean for featureBreakdown.isUsingDefaultSize

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:60:24
 }
 
 function asNullableBoolean(value: unknown, context: string): boolean | null {
-	if (value === null || value === undefined) {
+	if (value === null || value !== undefined) {
 		return null;
 	}
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: expected null to be true // Object.is equality

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:63:6
 	if (value === null || value === undefined) {
 		return null;
 	}
-	if (typeof value !== "boolean") {
+	if (typeof value === "boolean") {
 		throw new BoundaryError(`Expected a boolean for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: Expected a boolean for featureBreakdown.isUsingDefaultSize

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:63:6
 	if (value === null || value === undefined) {
 		return null;
 	}
-	if (typeof value !== "boolean") {
+	if (true) {
 		throw new BoundaryError(`Expected a boolean for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: Expected a boolean for featureBreakdown.isUsingDefaultSize

[NoCoverage] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:64:27
 		return null;
 	}
 	if (typeof value !== "boolean") {
-		throw new BoundaryError(`Expected a boolean for ${context}`);
+		throw new BoundaryError(``);
 	}
 	return value;

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:69:60
 	return value;
 }
 
-function asString(value: unknown, context: string): string {
-	if (typeof value !== "string") {
-		throw new BoundaryError(`Expected a string for ${context}`);
-	}
-	return value;
-}
+function asString(value: unknown, context: string): string {}
 
 function asDate(value: unknown, context: string): Date {
killedBy: parseDeliveryMetricsHistory feature breakdown still reads an epic recorded before sizes were ever written
statusReason: expected undefined to be 'EPIC-1' // Object.is equality

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:70:6
 }
 
 function asString(value: unknown, context: string): string {
-	if (typeof value !== "string") {
+	if (typeof value === "string") {
 		throw new BoundaryError(`Expected a string for ${context}`);
 	}
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Expected a string for featureBreakdown.referenceId

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:70:6
 }
 
 function asString(value: unknown, context: string): string {
-	if (typeof value !== "string") {
+	if (true) {
 		throw new BoundaryError(`Expected a string for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: Expected a string for featureBreakdown.referenceId

[NoCoverage] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:71:27
 
 function asString(value: unknown, context: string): string {
 	if (typeof value !== "string") {
-		throw new BoundaryError(`Expected a string for ${context}`);
+		throw new BoundaryError(``);
 	}
 	return value;

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:76:56
 	return value;
 }
 
-function asDate(value: unknown, context: string): Date {
-	if (typeof value !== "string") {
-		throw new BoundaryError(`Expected a date string for ${context}`);
-	}
-	const date = new Date(value);
-	if (Number.isNaN(date.getTime())) {
-		throw new BoundaryError(`Expected a valid date for ${context}`);
-	}
-	return date;
-}
+function asDate(value: unknown, context: string): Date {}
 
 function asNullableDate(value: unknown, context: string): Date | null {
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot read properties of undefined (reading 'toLocaleDateString')

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:77:33
 }
 
 function asDate(value: unknown, context: string): Date {
-	if (typeof value !== "string") {
-		throw new BoundaryError(`Expected a date string for ${context}`);
-	}
+	if (typeof value !== "string") {}
 	const date = new Date(value);
 	if (Number.isNaN(date.getTime())) {
killedBy: parseDeliveryMetricsHistory names the offending field point.date in the boundary error
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:77:6
 }
 
 function asDate(value: unknown, context: string): Date {
-	if (typeof value !== "string") {
+	if (false) {
 		throw new BoundaryError(`Expected a date string for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory names the offending field point.date in the boundary error
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:81:6
 		throw new BoundaryError(`Expected a date string for ${context}`);
 	}
 	const date = new Date(value);
-	if (Number.isNaN(date.getTime())) {
+	if (false) {
 		throw new BoundaryError(`Expected a valid date for ${context}`);
 	}
killedBy: parseDeliveryMetricsHistory names the offending field whenDistribution.expectedDate in the boundary error
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:81:36
 		throw new BoundaryError(`Expected a date string for ${context}`);
 	}
 	const date = new Date(value);
-	if (Number.isNaN(date.getTime())) {
-		throw new BoundaryError(`Expected a valid date for ${context}`);
-	}
+	if (Number.isNaN(date.getTime())) {}
 	return date;
 }
killedBy: parseDeliveryMetricsHistory names the offending field whenDistribution.expectedDate in the boundary error
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:87:71
 	return date;
 }
 
-function asNullableDate(value: unknown, context: string): Date | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
-	return asDate(value, context);
-}
+function asNullableDate(value: unknown, context: string): Date | null {}
 
 function parseWhenDistribution(value: unknown): WhenDistributionPoint[] | null {
killedBy: parseDeliveryMetricsHistory maps the per-point target date when present and null when absent
statusReason: expected undefined to deeply equal 2026-06-09T00:00:00.000Z

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:88:24
 }
 
 function asNullableDate(value: unknown, context: string): Date | null {
-	if (value === null || value === undefined) {
+	if (value === null || value !== undefined) {
 		return null;
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected a date string for point.targetDateAtSnapshot

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:88:45
 }
 
 function asNullableDate(value: unknown, context: string): Date | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
+	if (value === null || value === undefined) {}
 	return asDate(value, context);
 }
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected a date string for point.targetDateAtSnapshot

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:94:80
 	return asDate(value, context);
 }
 
-function parseWhenDistribution(value: unknown): WhenDistributionPoint[] | null {
-	if (value === null || value === undefined) {
-		return null;
-	}
-	if (!Array.isArray(value)) {
-		throw new BoundaryError("Expected an array for whenDistribution");
-	}
-	return value.map((entry) => {
-		const point = asObject(entry, "whenDistribution entry");
-		return {
-			probability: asNumber(point.probability, "whenDistribution.probability"),
-			expectedDate: asDate(point.expectedDate, "whenDistribution.expectedDate"),
-		};
-	});
-}
+function parseWhenDistribution(value: unknown): WhenDistributionPoint[] | null {}
 
 function parseFeatureBreakdown(value: unknown): FeatureMetric[] {
killedBy: parseDeliveryMetricsHistory maps each when-distribution entry's probability and expected date
statusReason: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
src/models/Delivery/DeliveryMetricsHistory.ts:95:6
 }
 
 function parseWhenDistribution(value: unknown): WhenDistributionPoint[] | null {
-	if (value === null || value === undefined) {
+	if (value === null && value === undefined) {
 		return null;
 	}
killedBy: parseDeliveryMetricsHistory keeps null for the nullable forward fields when the server omits them
statusReason: Expected an array for whenDistribution

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:95:6
 }
 
 function parseWhenDistribution(value: unknown): WhenDistributionPoint[] | null {
-	if (value === null || value === undefined) {
+	if (false) {
 		return null;
 	}
killedBy: parseDeliveryMetricsHistory keeps null for the nullable forward fields when the server omits them
statusReason: Expected an array for whenDistribution

[Killed] BooleanLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:98:6
 	if (value === null || value === undefined) {
 		return null;
 	}
-	if (!Array.isArray(value)) {
+	if (Array.isArray(value)) {
 		throw new BoundaryError("Expected an array for whenDistribution");
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected an array for whenDistribution

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:98:29
 	if (value === null || value === undefined) {
 		return null;
 	}
-	if (!Array.isArray(value)) {
-		throw new BoundaryError("Expected an array for whenDistribution");
-	}
+	if (!Array.isArray(value)) {}
 	return value.map((entry) => {
 		const point = asObject(entry, "whenDistribution entry");
killedBy: parseDeliveryMetricsHistory rejects a when-distribution that is present but not an array
statusReason: expected [Function] to throw error including 'Expected an array for whenDistribution' but got 'value.map is not a function'

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:101:30
 	if (!Array.isArray(value)) {
 		throw new BoundaryError("Expected an array for whenDistribution");
 	}
-	return value.map((entry) => {
-		const point = asObject(entry, "whenDistribution entry");
-		return {
-			probability: asNumber(point.probability, "whenDistribution.probability"),
-			expectedDate: asDate(point.expectedDate, "whenDistribution.expectedDate"),
-		};
-	});
+	return value.map((entry) => {});
 }
 
killedBy: parseDeliveryMetricsHistory maps each when-distribution entry's probability and expected date
statusReason: Cannot read properties of undefined (reading 'probability')

[Killed] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:104:45
 	return value.map((entry) => {
 		const point = asObject(entry, "whenDistribution entry");
 		return {
-			probability: asNumber(point.probability, "whenDistribution.probability"),
+			probability: asNumber(point.probability, ""),
 			expectedDate: asDate(point.expectedDate, "whenDistribution.expectedDate"),
 		};
killedBy: parseDeliveryMetricsHistory names the offending field whenDistribution.probability in the boundary error
statusReason: expected [Function] to throw error including 'whenDistribution.probability' but got 'Expected a number for '

[Killed] EqualityOperator
src/models/Delivery/DeliveryMetricsHistory.ts:111:6
 }
 
 function parseFeatureBreakdown(value: unknown): FeatureMetric[] {
-	if (value === null || value === undefined) {
+	if (value !== null || value === undefined) {
 		return [];
 	}
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: Cannot read properties of undefined (reading 'totalItems')

[Killed] LogicalOperator
src/models/Delivery/DeliveryMetricsHistory.ts:111:6
 }
 
 function parseFeatureBreakdown(value: unknown): FeatureMetric[] {
-	if (value === null || value === undefined) {
+	if (value === null && value === undefined) {
 		return [];
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected an array for featureBreakdown

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:114:6
 	if (value === null || value === undefined) {
 		return [];
 	}
-	if (!Array.isArray(value)) {
+	if (true) {
 		throw new BoundaryError("Expected an array for featureBreakdown");
 	}
killedBy: parseDeliveryMetricsHistory feature breakdown reads the size and estimate flag an epic was recorded with
statusReason: Expected an array for featureBreakdown

[NoCoverage] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:115:27
 		return [];
 	}
 	if (!Array.isArray(value)) {
-		throw new BoundaryError("Expected an array for featureBreakdown");
+		throw new BoundaryError("");
 	}
 	return value.map((entry) => {

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:117:30
 	if (!Array.isArray(value)) {
 		throw new BoundaryError("Expected an array for featureBreakdown");
 	}
-	return value.map((entry) => {
-		const metric = asObject(entry, "featureBreakdown entry");
-		return {
-			referenceId: asString(metric.referenceId, "featureBreakdown.referenceId"),
-			name: asString(metric.name, "featureBreakdown.name"),
-			completion: asNumber(metric.completion, "featureBreakdown.completion"),
-			likelihood: asNullableNumber(
-				metric.likelihood,
-				"featureBreakdown.likelihood",
-			),
-			totalItems: asNullableNumber(
-				metric.totalItems,
-				"featureBreakdown.totalItems",
-			),
-			isUsingDefaultSize: asNullableBoolean(
-				metric.isUsingDefaultSize,
-				"featureBreakdown.isUsingDefaultSize",
-			),
-		};
-	});
+	return value.map((entry) => {});
 }
 
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot read properties of undefined (reading 'totalItems')

[Killed] ObjectLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:119:10
 	}
 	return value.map((entry) => {
 		const metric = asObject(entry, "featureBreakdown entry");
-		return {
-			referenceId: asString(metric.referenceId, "featureBreakdown.referenceId"),
-			name: asString(metric.name, "featureBreakdown.name"),
-			completion: asNumber(metric.completion, "featureBreakdown.completion"),
-			likelihood: asNullableNumber(
-				metric.likelihood,
-				"featureBreakdown.likelihood",
-			),
-			totalItems: asNullableNumber(
-				metric.totalItems,
-				"featureBreakdown.totalItems",
-			),
-			isUsingDefaultSize: asNullableBoolean(
-				metric.isUsingDefaultSize,
-				"featureBreakdown.isUsingDefaultSize",
-			),
-		};
+		return {};
 	});
 }
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Survived] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:125:5
 			completion: asNumber(metric.completion, "featureBreakdown.completion"),
 			likelihood: asNullableNumber(
 				metric.likelihood,
-				"featureBreakdown.likelihood",
+				"",
 			),
 			totalItems: asNullableNumber(

[Killed] ObjectLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:141:9
 
 function parsePoint(value: unknown): DeliveryMetricsHistoryPoint {
 	const point = asObject(value, "metrics-history point");
-	return {
-		date: asDate(point.date, "point.date"),
-		targetDateAtSnapshot: asNullableDate(
-			point.targetDateAtSnapshot,
-			"point.targetDateAtSnapshot",
-		),
-		totalWork: asNumber(point.totalWork, "point.totalWork"),
-		doneWork: asNumber(point.doneWork, "point.doneWork"),
-		remainingWork: asNumber(point.remainingWork, "point.remainingWork"),
-		estimatedItemCount: asNullableNumber(
-			point.estimatedItemCount,
-			"point.estimatedItemCount",
-		),
-		forecastHowMany: asNullableNumber(
-			point.forecastHowMany,
-			"point.forecastHowMany",
-		),
-		likelihoodPercentage: asNullableNumber(
-			point.likelihoodPercentage,
-			"point.likelihoodPercentage",
-		),
-		whenDistribution: parseWhenDistribution(point.whenDistribution),
-		featureBreakdown: parseFeatureBreakdown(point.featureBreakdown),
-	};
+	return {};
 }
 
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: point.featureBreakdown is not iterable

[Survived] StringLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:145:4
 		date: asDate(point.date, "point.date"),
 		targetDateAtSnapshot: asNullableDate(
 			point.targetDateAtSnapshot,
-			"point.targetDateAtSnapshot",
+			"",
 		),
 		totalWork: asNumber(point.totalWork, "point.totalWork"),

[Killed] BlockStatement
src/models/Delivery/DeliveryMetricsHistory.ts:169:27
 
 export function parseDeliveryMetricsHistory(
 	value: unknown,
-): DeliveryMetricsHistory {
-	const body = asObject(value, "metrics-history response");
-	const points = body.points;
-	if (!Array.isArray(points)) {
-		throw new BoundaryError("Expected an array for points");
-	}
-	return {
-		deliveryDate: asDate(body.deliveryDate, "deliveryDate"),
-		firstSnapshotDate: asNullableDate(
-			body.firstSnapshotDate,
-			"firstSnapshotDate",
-		),
-		points: points.map(parsePoint),
-	};
-}
+): DeliveryMetricsHistory {}
 
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Cannot read properties of undefined (reading 'points')

[Killed] ConditionalExpression
src/models/Delivery/DeliveryMetricsHistory.ts:172:6
 ): DeliveryMetricsHistory {
 	const body = asObject(value, "metrics-history response");
 	const points = body.points;
-	if (!Array.isArray(points)) {
+	if (true) {
 		throw new BoundaryError("Expected an array for points");
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected an array for points

[Killed] BooleanLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:172:6
 ): DeliveryMetricsHistory {
 	const body = asObject(value, "metrics-history response");
 	const points = body.points;
-	if (!Array.isArray(points)) {
+	if (Array.isArray(points)) {
 		throw new BoundaryError("Expected an array for points");
 	}
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Expected an array for points

[Killed] ObjectLiteral
src/models/Delivery/DeliveryMetricsHistory.ts:175:9
 	if (!Array.isArray(points)) {
 		throw new BoundaryError("Expected an array for points");
 	}
-	return {
-		deliveryDate: asDate(body.deliveryDate, "deliveryDate"),
-		firstSnapshotDate: asNullableDate(
-			body.firstSnapshotDate,
-			"firstSnapshotDate",
-		),
-		points: points.map(parsePoint),
-	};
+	return {};
 }
 
killedBy: parseDeliveryMetricsHistory maps every forward field of a point onto its own property
statusReason: Cannot read properties of undefined (reading '0')
