[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:31:24
 const COUNT_AXIS_LABEL = "Count";
 const COUNT_SERIES_ID = "epic-count";
 const COUNT_DATA_KEY = "epicCount";
-const LABEL_DATA_KEY = "label";
+const LABEL_DATA_KEY = "";
 
 const ITEMS_AXIS_ID = "items";
killedBy: DeliveryEpicSizeChart count line labels each plotted point with the day it was recorded (AC-1.1)
statusReason: expected '' to be truthy

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:33:23
 const COUNT_DATA_KEY = "epicCount";
 const LABEL_DATA_KEY = "label";
 
-const ITEMS_AXIS_ID = "items";
+const ITEMS_AXIS_ID = "";
 const ITEMS_AXIS_LABEL = "Items";
 const ITEMS_STACK_ID = "epic-size";
killedBy: DeliveryEpicSizeChart size bars sizes the bars on their own left-hand scale, apart from the count (ADR-122)
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:47:35
 const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {
 	const sizes = new Map<string, number>();
 	for (const metric of point.featureBreakdown) {
-		if (metric.totalItems !== null) {
-			sizes.set(metric.referenceId, metric.totalItems);
-		}
+		if (metric.totalItems !== null) {}
 	}
 	return sizes;
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ null ] to deeply equal [ 8 ]

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:61:36
 	const namesByReferenceId = new Map<string, string>();
 	for (const point of history.points) {
 		for (const metric of point.featureBreakdown) {
-			if (metric.totalItems !== null) {
-				namesByReferenceId.set(metric.referenceId, metric.name);
-			}
+			if (metric.totalItems !== null) {}
 		}
 	}
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrayDeclaration
components/Common/Charts/DeliveryEpicSizeChart.tsx:67:9
 		}
 	}
 
-	return [...namesByReferenceId]
+	return []
 		.map(([referenceId, name]) => ({ referenceId, name }))
 		.sort((left, right) =>
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:71:18
 		.map(([referenceId, name]) => ({ referenceId, name }))
 		.sort((left, right) =>
 			left.referenceId.localeCompare(right.referenceId, undefined, {
-				sensitivity: "base",
+				sensitivity: "",
 			}),
 		);
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Value  out of range for String.prototype.localeCompare options property sensitivity

[Survived] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:88:35
 		sx={{ p: 2, borderRadius: 2, height: "100%" }}
 	>
 		<CardContent
-			sx={{ height: "100%", display: "flex", flexDirection: "column" }}
+			sx={{ height: "100%", display: "", flexDirection: "column" }}
 		>
 			<Typography variant="h6">{title}</Typography>

[Survived] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:116:13
 
 	const epics = collectSizedEpics(history);
 	const colorByReferenceId = getColorMapForKeys(
-		epics.map((epic) => epic.referenceId),
+		epics.map(() => undefined),
 	);
 	const hasSizes = epics.length > 0;

[Killed] EqualityOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:118:19
 	const colorByReferenceId = getColorMapForKeys(
 		epics.map((epic) => epic.referenceId),
 	);
-	const hasSizes = epics.length > 0;
+	const hasSizes = epics.length <= 0;
 
 	const dataset = history.points.map((point) => {
killedBy: DeliveryEpicSizeChart size bars sizes the bars on their own left-hand scale, apart from the count (ADR-122)
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:118:19
 	const colorByReferenceId = getColorMapForKeys(
 		epics.map((epic) => epic.referenceId),
 	);
-	const hasSizes = epics.length > 0;
+	const hasSizes = false;
 
 	const dataset = history.points.map((point) => {
killedBy: DeliveryEpicSizeChart size bars sizes the bars on their own left-hand scale, apart from the count (ADR-122)
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:122:55
 
 	const dataset = history.points.map((point) => {
 		const sizes = sizesOn(point);
-		const row: Record<string, string | number | null> = {
-			[LABEL_DATA_KEY]: point.date.toLocaleDateString(),
-			[COUNT_DATA_KEY]: point.featureBreakdown.length,
-		};
+		const row: Record<string, string | number | null> = {};
 
 		// D7: a departed epic gets an explicit null, so its segments stop instead of vanishing.
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 7, 7, 9 ]

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:135:31
 		return row;
 	});
 
-	const sizeSeries = epics.map((epic) => ({
-		id: epic.referenceId,
-		type: "bar" as const,
-		dataKey: sizeDataKey(epic.referenceId),
-		label: epic.name,
-		yAxisId: ITEMS_AXIS_ID,
-		stack: ITEMS_STACK_ID,
-		color: colorByReferenceId[epic.referenceId],
-	}));
+	const sizeSeries = epics.map(() => undefined);
 
 	const itemsAxis = hasSizes
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:153:13
 		<ChartCard title={title}>
 			<ChartsContainer
 				dataset={dataset}
-				xAxis={[{ scaleType: "band", dataKey: LABEL_DATA_KEY }]}
+				xAxis={[{}]}
 				yAxis={[...itemsAxis, { id: COUNT_AXIS_ID, position: "right" }]}
 				series={[
killedBy: DeliveryEpicSizeChart count line labels each plotted point with the day it was recorded (AC-1.1)
statusReason: expected undefined to be truthy

[Killed] ArrayDeclaration
components/Common/Charts/DeliveryEpicSizeChart.tsx:154:12
 			<ChartsContainer
 				dataset={dataset}
 				xAxis={[{ scaleType: "band", dataKey: LABEL_DATA_KEY }]}
-				yAxis={[...itemsAxis, { id: COUNT_AXIS_ID, position: "right" }]}
+				yAxis={[]}
 				series={[
 					...sizeSeries,
killedBy: DeliveryEpicSizeChart count line draws the count against its own right-hand scale so sizes can share the chart (ADR-122)
statusReason: expected undefined to be 'right' // Object.is equality

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:157:6
 				yAxis={[...itemsAxis, { id: COUNT_AXIS_ID, position: "right" }]}
 				series={[
 					...sizeSeries,
-					{
-						id: COUNT_SERIES_ID,
-						type: "line",
-						dataKey: COUNT_DATA_KEY,
-						label: COUNT_AXIS_LABEL,
-						yAxisId: COUNT_AXIS_ID,
-						color: theme.palette.primary.main,
-					},
+					{},
 				]}
 				height={height}
killedBy: DeliveryEpicSizeChart count line draws the count against its own right-hand scale so sizes can share the chart (ADR-122)
statusReason: expected undefined to be 'count' // Object.is equality
