[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:33:24
 const COUNT_AXIS_ID = "count";
 const COUNT_AXIS_LABEL = "Count";
 const COUNT_SERIES_ID = "epic-count";
-const COUNT_DATA_KEY = "epicCount";
+const COUNT_DATA_KEY = "";
 const LABEL_DATA_KEY = "label";
 
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 7, 7, 9 ]

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:37:26
 const LABEL_DATA_KEY = "label";
 
 const ITEMS_AXIS_ID = "items";
-const ITEMS_AXIS_LABEL = "Items";
+const ITEMS_AXIS_LABEL = "";
 const ITEMS_STACK_ID = "epic-size";
 
killedBy: DeliveryEpicSizeChart size bars scales and labels the bars on an items axis of their own
statusReason: expect(element).toHaveAttribute("data-label", "Items") // element.getAttribute("data-label") === "Items"

Expected the element to have attribute:
  data-label="Items"
Received:
  data-label=""

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:38:24
 
 const ITEMS_AXIS_ID = "items";
 const ITEMS_AXIS_LABEL = "Items";
-const ITEMS_STACK_ID = "epic-size";
+const ITEMS_STACK_ID = "";
 
 const HATCH_TILE = 8;
killedBy: DeliveryEpicSizeChart size bars stacks the day's epics into one bar rather than standing them side by side (AC-2.5)
statusReason: expected '' to be truthy

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:44:27
 const HATCH_STROKE_WIDTH = 3;
 const HATCH_STROKE_OPACITY = 0.6;
 // Terse on purpose: the sentence DISCUSS AC-3.3 suggested overran the tooltip row (review 2026-08-02).
-const DEFAULT_SIZE_NOTE = "(estimated)";
+const DEFAULT_SIZE_NOTE = "";
 
 interface EpicSeriesDescriptor {
killedBy: DeliveryEpicSizeChart estimate hatching says in the tooltip that a hatched size is a default (AC-3.3)
statusReason: expected '8 ' to match /^8 \(estimated\)$/

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:51:21
 	name: string;
 }
 
-const sizeDataKey = (referenceId: string): string => `items:${referenceId}`;
+const sizeDataKey = () => undefined;
 
 // Null, not "": ChartsAxisTooltipContent drops a row whose formattedValue is null, which is how an
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ undefined ] to deeply equal [ 8 ]

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:51:54
 	name: string;
 }
 
-const sizeDataKey = (referenceId: string): string => `items:${referenceId}`;
+const sizeDataKey = (referenceId: string): string => ``;
 
 // Null, not "": ChartsAxisTooltipContent drops a row whose formattedValue is null, which is how an
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ 3 ] to deeply equal [ 8 ]

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:58:21
 const formatSize = (
 	value: number | null,
 	usesDefaultSize: boolean,
-): string | null => {
-	if (value === null) {
-		return null;
-	}
-
-	return usesDefaultSize ? `${value} ${DEFAULT_SIZE_NOTE}` : `${value}`;
-};
+): string | null => {};
 
 const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {
killedBy: DeliveryEpicSizeChart size bars leaves an epic out of the day's tooltip when it was not in the delivery yet
statusReason: expected undefined to be null

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:59:6
 	value: number | null,
 	usesDefaultSize: boolean,
 ): string | null => {
-	if (value === null) {
+	if (false) {
 		return null;
 	}
killedBy: DeliveryEpicSizeChart size bars leaves an epic out of the day's tooltip when it was not in the delivery yet
statusReason: expected 'null' to be null

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:59:22
 	value: number | null,
 	usesDefaultSize: boolean,
 ): string | null => {
-	if (value === null) {
-		return null;
-	}
+	if (value === null) {}
 
 	return usesDefaultSize ? `${value} ${DEFAULT_SIZE_NOTE}` : `${value}`;
killedBy: DeliveryEpicSizeChart size bars leaves an epic out of the day's tooltip when it was not in the delivery yet
statusReason: expected 'null' to be null

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:63:61
 		return null;
 	}
 
-	return usesDefaultSize ? `${value} ${DEFAULT_SIZE_NOTE}` : `${value}`;
+	return usesDefaultSize ? `${value} ${DEFAULT_SIZE_NOTE}` : ``;
 };
 
killedBy: DeliveryEpicSizeChart size bars leaves an epic out of the day's tooltip when it was not in the delivery yet
statusReason: expected '' to contain '3'

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:66:78
 	return usesDefaultSize ? `${value} ${DEFAULT_SIZE_NOTE}` : `${value}`;
 };
 
-const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {
-	const sizes = new Map<string, number>();
-	for (const metric of point.featureBreakdown) {
-		if (metric.totalItems !== null) {
-			sizes.set(metric.referenceId, metric.totalItems);
-		}
-	}
-	return sizes;
-};
+const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {};
 
 // AC-3.5: only a recorded flag makes an epic a guess. Every snapshot taken before slice 02 carries no
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:68:47
 
 const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {
 	const sizes = new Map<string, number>();
-	for (const metric of point.featureBreakdown) {
-		if (metric.totalItems !== null) {
-			sizes.set(metric.referenceId, metric.totalItems);
-		}
-	}
+	for (const metric of point.featureBreakdown) {}
 	return sizes;
 };
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ null ] to deeply equal [ 8 ]

[Killed] EqualityOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:69:7
 const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {
 	const sizes = new Map<string, number>();
 	for (const metric of point.featureBreakdown) {
-		if (metric.totalItems !== null) {
+		if (metric.totalItems === null) {
 			sizes.set(metric.referenceId, metric.totalItems);
 		}
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ null ] to deeply equal [ 8 ]

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:69:7
 const sizesOn = (point: DeliveryMetricsHistoryPoint): Map<string, number> => {
 	const sizes = new Map<string, number>();
 	for (const metric of point.featureBreakdown) {
-		if (metric.totalItems !== null) {
+		if (false) {
 			sizes.set(metric.referenceId, metric.totalItems);
 		}
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ null ] to deeply equal [ 8 ]

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:78:77
 
 // AC-3.5: only a recorded flag makes an epic a guess. Every snapshot taken before slice 02 carries no
 // flag at all, so reading absence as "estimated" would hatch the whole back-history.
-const defaultSizedOn = (point: DeliveryMetricsHistoryPoint): Set<string> => {
-	const estimated = new Set<string>();
-	for (const metric of point.featureBreakdown) {
-		if (metric.isUsingDefaultSize) {
-			estimated.add(metric.referenceId);
-		}
-	}
-	return estimated;
-};
+const defaultSizedOn = (point: DeliveryMetricsHistoryPoint): Set<string> => {};
 
 // The props MUI-X hands a bar slot (ADR-119). Declared here rather than imported: the acceptance test
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: expected '' to match /^url\(#/

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:80:47
 // flag at all, so reading absence as "estimated" would hatch the whole back-history.
 const defaultSizedOn = (point: DeliveryMetricsHistoryPoint): Set<string> => {
 	const estimated = new Set<string>();
-	for (const metric of point.featureBreakdown) {
-		if (metric.isUsingDefaultSize) {
-			estimated.add(metric.referenceId);
-		}
-	}
+	for (const metric of point.featureBreakdown) {}
 	return estimated;
 };
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: expected '' to match /^url\(#/

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:81:7
 const defaultSizedOn = (point: DeliveryMetricsHistoryPoint): Set<string> => {
 	const estimated = new Set<string>();
 	for (const metric of point.featureBreakdown) {
-		if (metric.isUsingDefaultSize) {
+		if (true) {
 			estimated.add(metric.referenceId);
 		}
killedBy: DeliveryEpicSizeChart estimate hatching leaves a broken-down epic solid, in its own colour (AC-3.2)
statusReason: expected 'url(#hatch-r12-0)' to be '#123456' // Object.is equality

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:81:7
 const defaultSizedOn = (point: DeliveryMetricsHistoryPoint): Set<string> => {
 	const estimated = new Set<string>();
 	for (const metric of point.featureBreakdown) {
-		if (metric.isUsingDefaultSize) {
+		if (false) {
 			estimated.add(metric.referenceId);
 		}
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: expected '' to match /^url\(#/

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:104:30
 // Sorted so an epic keeps its band and its colour from day to day (DESIGN OQ-4).
 const collectSizedEpics = (
 	history: DeliveryMetricsHistory,
-): EpicSeriesDescriptor[] => {
-	const namesByReferenceId = new Map<string, string>();
-	for (const point of history.points) {
-		for (const metric of point.featureBreakdown) {
-			if (metric.totalItems !== null) {
-				namesByReferenceId.set(metric.referenceId, metric.name);
-			}
-		}
-	}
-
-	return [...namesByReferenceId]
-		.map(([referenceId, name]) => ({ referenceId, name }))
-		.sort((left, right) =>
-			left.referenceId.localeCompare(right.referenceId, undefined, {
-				sensitivity: "base",
-			}),
-		);
-};
+): EpicSeriesDescriptor[] => {};
 
 interface EpicHatch {
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:106:38
 	history: DeliveryMetricsHistory,
 ): EpicSeriesDescriptor[] => {
 	const namesByReferenceId = new Map<string, string>();
-	for (const point of history.points) {
-		for (const metric of point.featureBreakdown) {
-			if (metric.totalItems !== null) {
-				namesByReferenceId.set(metric.referenceId, metric.name);
-			}
-		}
-	}
+	for (const point of history.points) {}
 
 	return [...namesByReferenceId]
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:107:48
 ): EpicSeriesDescriptor[] => {
 	const namesByReferenceId = new Map<string, string>();
 	for (const point of history.points) {
-		for (const metric of point.featureBreakdown) {
-			if (metric.totalItems !== null) {
-				namesByReferenceId.set(metric.referenceId, metric.name);
-			}
-		}
+		for (const metric of point.featureBreakdown) {}
 	}
 
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:108:8
 	const namesByReferenceId = new Map<string, string>();
 	for (const point of history.points) {
 		for (const metric of point.featureBreakdown) {
-			if (metric.totalItems !== null) {
+			if (true) {
 				namesByReferenceId.set(metric.referenceId, metric.name);
 			}
killedBy: DeliveryEpicSizeChart size bars draws no bar for a day recorded before sizes were written (AC-2.5)
statusReason: expected [ { id: 'EPIC-1', …(7) }, …(6) ] to have a length of +0 but got 7

[Killed] MethodExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:114:9
 		}
 	}
 
-	return [...namesByReferenceId]
-		.map(([referenceId, name]) => ({ referenceId, name }))
-		.sort((left, right) =>
-			left.referenceId.localeCompare(right.referenceId, undefined, {
-				sensitivity: "base",
-			}),
-		);
+	return [...namesByReferenceId].map(([referenceId, name]) => ({
+  referenceId,
+  name
+}));
 };
 
killedBy: DeliveryEpicSizeChart size bars orders the stack by epic so the bars do not reshuffle between days
statusReason: expected [ 'EPIC-B', 'EPIC-A' ] to deeply equal [ 'EPIC-A', 'EPIC-B' ]

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:115:8
 	}
 
 	return [...namesByReferenceId]
-		.map(([referenceId, name]) => ({ referenceId, name }))
+		.map(() => undefined)
 		.sort((left, right) =>
 			left.referenceId.localeCompare(right.referenceId, undefined, {
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'referenceId')

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:115:34
 	}
 
 	return [...namesByReferenceId]
-		.map(([referenceId, name]) => ({ referenceId, name }))
+		.map(([referenceId, name]) => ({}))
 		.sort((left, right) =>
 			left.referenceId.localeCompare(right.referenceId, undefined, {
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:116:9
 
 	return [...namesByReferenceId]
 		.map(([referenceId, name]) => ({ referenceId, name }))
-		.sort((left, right) =>
-			left.referenceId.localeCompare(right.referenceId, undefined, {
-				sensitivity: "base",
-			}),
+		.sort(() => undefined,
 		);
 };
killedBy: DeliveryEpicSizeChart size bars orders the stack by epic so the bars do not reshuffle between days
statusReason: expected [ 'EPIC-B', 'EPIC-A' ] to deeply equal [ 'EPIC-A', 'EPIC-B' ]

[Survived] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:117:65
 	return [...namesByReferenceId]
 		.map(([referenceId, name]) => ({ referenceId, name }))
 		.sort((left, right) =>
-			left.referenceId.localeCompare(right.referenceId, undefined, {
-				sensitivity: "base",
-			}),
+			left.referenceId.localeCompare(right.referenceId, undefined, {}),
 		);
 };

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:131:23
 
 // The stroke is derived from the segment's own colour: the epic ramp runs green to teal and a fixed
 // white or black hatch vanishes at one end of it.
-const EpicHatchDefs = ({ hatches }: { hatches: EpicHatch[] }): ReactElement => (
-	<defs>
-		{hatches.map((hatch) => (
-			<pattern
-				key={hatch.referenceId}
-				id={hatch.id}
-				patternUnits="userSpaceOnUse"
-				patternTransform="rotate(45)"
-				width={HATCH_TILE}
-				height={HATCH_TILE}
-			>
-				<rect width={HATCH_TILE} height={HATCH_TILE} fill={hatch.color} />
-				<line
-					x1={0}
-					y1={0}
-					x2={0}
-					y2={HATCH_TILE}
-					stroke={getContrastText(hatch.color)}
-					strokeOpacity={HATCH_STROKE_OPACITY}
-					strokeWidth={HATCH_STROKE_WIDTH}
-				/>
-			</pattern>
-		))}
-	</defs>
-);
+const EpicHatchDefs = () => undefined;
 
 const ChartCard = ({
killedBy: DeliveryEpicSizeChart estimate hatching builds a pattern id that is safe inside url(#...)
statusReason: expected '' to match /^hatch-[a-zA-Z0-9]+-\d+$/

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:133:16
 // white or black hatch vanishes at one end of it.
 const EpicHatchDefs = ({ hatches }: { hatches: EpicHatch[] }): ReactElement => (
 	<defs>
-		{hatches.map((hatch) => (
-			<pattern
-				key={hatch.referenceId}
-				id={hatch.id}
-				patternUnits="userSpaceOnUse"
-				patternTransform="rotate(45)"
-				width={HATCH_TILE}
-				height={HATCH_TILE}
-			>
-				<rect width={HATCH_TILE} height={HATCH_TILE} fill={hatch.color} />
-				<line
-					x1={0}
-					y1={0}
-					x2={0}
-					y2={HATCH_TILE}
-					stroke={getContrastText(hatch.color)}
-					strokeOpacity={HATCH_STROKE_OPACITY}
-					strokeWidth={HATCH_STROKE_WIDTH}
-				/>
-			</pattern>
-		))}
+		{hatches.map(() => undefined)}
 	</defs>
 );
killedBy: DeliveryEpicSizeChart estimate hatching builds a pattern id that is safe inside url(#...)
statusReason: expected '' to match /^hatch-[a-zA-Z0-9]+-\d+$/

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:157:19
 	</defs>
 );
 
-const ChartCard = ({
-	title,
-	children,
-}: {
-	title: string;
-	children: ReactNode;
-}): ReactElement => (
-	<Card
-		data-testid="delivery-epic-size-chart"
-		sx={{ p: 2, borderRadius: 2, height: "100%" }}
-	>
-		<CardContent
-			sx={{ height: "100%", display: "flex", flexDirection: "column" }}
-		>
-			<Typography variant="h6">{title}</Typography>
-			{children}
-		</CardContent>
-	</Card>
-);
+const ChartCard = () => undefined;
 
 const DeliveryEpicSizeChart = ({
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: expected [] to deeply equal [ 7, 7, 9 ]

[Survived] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:166:40
 }): ReactElement => (
 	<Card
 		data-testid="delivery-epic-size-chart"
-		sx={{ p: 2, borderRadius: 2, height: "100%" }}
+		sx={{ p: 2, borderRadius: 2, height: "" }}
 	>
 		<CardContent

[Survived] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:166:7
 }): ReactElement => (
 	<Card
 		data-testid="delivery-epic-size-chart"
-		sx={{ p: 2, borderRadius: 2, height: "100%" }}
+		sx={{}}
 	>
 		<CardContent

[Survived] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:169:58
 		sx={{ p: 2, borderRadius: 2, height: "100%" }}
 	>
 		<CardContent
-			sx={{ height: "100%", display: "flex", flexDirection: "column" }}
+			sx={{ height: "100%", display: "flex", flexDirection: "" }}
 		>
 			<Typography variant="h6">{title}</Typography>

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:179:17
 
 const DeliveryEpicSizeChart = ({
 	history,
-	featuresTerm = "Epics",
+	featuresTerm = "",
 	height = 320,
 }: DeliveryEpicSizeChartProps): ReactElement => {
killedBy: DeliveryEpicSizeChart count line still names itself when the caller supplies no term
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /Epics over Time/
Received:
  over Time

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:188:6
 	const instanceId = useId().replace(/[^a-zA-Z0-9]/g, "");
 	const { selected, isVisible, toggle, showAll } = useLegendFilter();
 
-	if (history.points.length === 0) {
+	if (false) {
 		return (
 			<ChartCard title={title}>
killedBy: DeliveryEpicSizeChart count line tells the forecaster the chart builds forward when nothing is recorded yet (AC-1.2)
statusReason: Unable to find an element with the text: /builds forward from today — no snapshots recorded yet/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:188:6
 	const instanceId = useId().replace(/[^a-zA-Z0-9]/g, "");
 	const { selected, isVisible, toggle, showAll } = useLegendFilter();
 
-	if (history.points.length === 0) {
+	if (true) {
 		return (
 			<ChartCard title={title}>
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: expected [] to deeply equal [ 7, 7, 9 ]

[Survived] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:191:60
 	if (history.points.length === 0) {
 		return (
 			<ChartCard title={title}>
-				<Typography variant="body2" color="text.secondary" sx={{ mt: 2 }}>
+				<Typography variant="body2" color="text.secondary" sx={{}}>
 					{FORWARD_ONLY_EMPTY_STATE}
 				</Typography>

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:202:36
 	// Every recorded epic, not just the sized ones: the fever chart beside this one shares the map.
 	const colorByReferenceId = deliveryEpicColors(history);
 	// AC-4.5 / D8: only the stacked sizes are filtered — the count line below is a delivery-level fact.
-	const visibleEpics = epics.filter((epic) => isVisible(epic.referenceId));
+	const visibleEpics = epics.filter(() => undefined);
 	const hasSizes = visibleEpics.length > 0;
 
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:202:23
 	// Every recorded epic, not just the sized ones: the fever chart beside this one shares the map.
 	const colorByReferenceId = deliveryEpicColors(history);
 	// AC-4.5 / D8: only the stacked sizes are filtered — the count line below is a delivery-level fact.
-	const visibleEpics = epics.filter((epic) => isVisible(epic.referenceId));
+	const visibleEpics = epics;
 	const hasSizes = visibleEpics.length > 0;
 
killedBy: DeliveryEpicSizeChart legend filtering leaves only the chosen epic's bars when one is picked (AC-4.2)
statusReason: expected [ 'EPIC-A', 'EPIC-B' ] to deeply equal [ 'EPIC-B' ]

[Killed] EqualityOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:203:19
 	const colorByReferenceId = deliveryEpicColors(history);
 	// AC-4.5 / D8: only the stacked sizes are filtered — the count line below is a delivery-level fact.
 	const visibleEpics = epics.filter((epic) => isVisible(epic.referenceId));
-	const hasSizes = visibleEpics.length > 0;
+	const hasSizes = visibleEpics.length >= 0;
 
 	const estimatedByDay = history.points.map(defaultSizedOn);
killedBy: DeliveryEpicSizeChart size bars declares no items scale when there is nothing to size against it
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:203:19
 	const colorByReferenceId = deliveryEpicColors(history);
 	// AC-4.5 / D8: only the stacked sizes are filtered — the count line below is a delivery-level fact.
 	const visibleEpics = epics.filter((epic) => isVisible(epic.referenceId));
-	const hasSizes = visibleEpics.length > 0;
+	const hasSizes = visibleEpics.length <= 0;
 
 	const estimatedByDay = history.points.map(defaultSizedOn);
killedBy: DeliveryEpicSizeChart size bars declares no items scale when there is nothing to size against it
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:206:26
 	const hasSizes = visibleEpics.length > 0;
 
 	const estimatedByDay = history.points.map(defaultSizedOn);
-	const usesDefaultSize = (referenceId: string, dataIndex: number): boolean =>
-		estimatedByDay[dataIndex]?.has(referenceId) ?? false;
+	const usesDefaultSize = () => undefined;
 
 	// Ids are instance-scoped so two deliveries expanded on the same page cannot reuse each other's
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: expected '' to match /^url\(#/

[Killed] OptionalChaining
components/Common/Charts/DeliveryEpicSizeChart.tsx:207:3
 
 	const estimatedByDay = history.points.map(defaultSizedOn);
 	const usesDefaultSize = (referenceId: string, dataIndex: number): boolean =>
-		estimatedByDay[dataIndex]?.has(referenceId) ?? false;
+		estimatedByDay[dataIndex].has(referenceId) ?? false;
 
 	// Ids are instance-scoped so two deliveries expanded on the same page cannot reuse each other's
killedBy: DeliveryEpicSizeChart estimate hatching reads an epic as broken down on a day the window never recorded
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BooleanLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:207:50
 
 	const estimatedByDay = history.points.map(defaultSizedOn);
 	const usesDefaultSize = (referenceId: string, dataIndex: number): boolean =>
-		estimatedByDay[dataIndex]?.has(referenceId) ?? false;
+		estimatedByDay[dataIndex]?.has(referenceId) ?? true;
 
 	// Ids are instance-scoped so two deliveries expanded on the same page cannot reuse each other's
killedBy: DeliveryEpicSizeChart estimate hatching reads an epic as broken down on a day the window never recorded
statusReason: expected '8 (estimated)' to be '8' // Object.is equality

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:211:41
 
 	// Ids are instance-scoped so two deliveries expanded on the same page cannot reuse each other's
 	// pattern def (AC-3.6).
-	const hatches: EpicHatch[] = epics.map((epic, index) => ({
-		referenceId: epic.referenceId,
-		id: `hatch-${instanceId}-${index}`,
-		color: colorByReferenceId[epic.referenceId],
-	}));
+	const hatches: EpicHatch[] = epics.map(() => undefined);
 	const hatchIdByReferenceId: Record<string, string> = Object.fromEntries(
 		hatches.map((hatch) => [hatch.referenceId, hatch.id]),
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'referenceId')

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:217:15
 		color: colorByReferenceId[epic.referenceId],
 	}));
 	const hatchIdByReferenceId: Record<string, string> = Object.fromEntries(
-		hatches.map((hatch) => [hatch.referenceId, hatch.id]),
+		hatches.map(() => undefined),
 	);
 
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:220:63
 		hatches.map((hatch) => [hatch.referenceId, hatch.id]),
 	);
 
-	const renderEpicBar = (props: EpicBarProps): ReactElement => {
-		const referenceId = `${props.seriesId}`;
-		const hatch = usesDefaultSize(referenceId, props.dataIndex)
-			? hatchIdByReferenceId[referenceId]
-			: undefined;
-
-		return (
-			<rect
-				x={props.x}
-				y={props.y}
-				width={props.width}
-				height={props.height}
-				className={props.className}
-				style={props.style}
-				opacity={props.ownerState?.isFaded ? 0.3 : 1}
-				filter={
-					props.ownerState?.isHighlighted ? "brightness(120%)" : undefined
-				}
-				fill={hatch ? `url(#${hatch})` : (props.fill ?? props.color)}
-			/>
-		);
-	};
+	const renderEpicBar = (props: EpicBarProps): ReactElement => {};
 
 	// BarPlot routes the slot down to each bar. ChartsContainer's own `slots` knows only the material
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: expected '' to match /^url\(#/

[Killed] OptionalChaining
components/Common/Charts/DeliveryEpicSizeChart.tsx:234:14
 				height={props.height}
 				className={props.className}
 				style={props.style}
-				opacity={props.ownerState?.isFaded ? 0.3 : 1}
+				opacity={props.ownerState.isFaded ? 0.3 : 1}
 				filter={
 					props.ownerState?.isHighlighted ? "brightness(120%)" : undefined
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: Cannot read properties of undefined (reading 'isFaded')

[Killed] OptionalChaining
components/Common/Charts/DeliveryEpicSizeChart.tsx:236:6
 				style={props.style}
 				opacity={props.ownerState?.isFaded ? 0.3 : 1}
 				filter={
-					props.ownerState?.isHighlighted ? "brightness(120%)" : undefined
+					props.ownerState.isHighlighted ? "brightness(120%)" : undefined
 				}
 				fill={hatch ? `url(#${hatch})` : (props.fill ?? props.color)}
killedBy: DeliveryEpicSizeChart estimate hatching hatches a segment whose size is the portfolio default (AC-3.2)
statusReason: Cannot read properties of undefined (reading 'isHighlighted')

[NoCoverage] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:236:40
 				style={props.style}
 				opacity={props.ownerState?.isFaded ? 0.3 : 1}
 				filter={
-					props.ownerState?.isHighlighted ? "brightness(120%)" : undefined
+					props.ownerState?.isHighlighted ? "" : undefined
 				}
 				fill={hatch ? `url(#${hatch})` : (props.fill ?? props.color)}

[Killed] LogicalOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:238:39
 				filter={
 					props.ownerState?.isHighlighted ? "brightness(120%)" : undefined
 				}
-				fill={hatch ? `url(#${hatch})` : (props.fill ?? props.color)}
+				fill={hatch ? `url(#${hatch})` : (props.fill && props.color)}
 			/>
 		);
killedBy: DeliveryEpicSizeChart estimate hatching leaves a broken-down epic solid, in its own colour (AC-3.2)
statusReason: expected null to be '#123456' // Object.is equality
