[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:247:48
 	// slots and ignores a `bar` key, so it must NOT be configured there.
 	const barSlots = { bar: renderEpicBar };
 
-	const dataset = history.points.map((point) => {
-		const sizes = sizesOn(point);
-		const row: Record<string, string | number | null> = {
-			[LABEL_DATA_KEY]: point.date.toLocaleDateString(),
-			[COUNT_DATA_KEY]: point.featureBreakdown.length,
-		};
-
-		// D7: a departed epic gets an explicit null, so its segments stop instead of vanishing.
-		for (const epic of epics) {
-			row[sizeDataKey(epic.referenceId)] = sizes.get(epic.referenceId) ?? null;
-		}
-
-		return row;
-	});
+	const dataset = history.points.map((point) => {});
 
 	const sizeSeries = visibleEpics.map((epic) => ({
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot read properties of undefined (reading 'epicCount')

[Killed] BlockStatement
components/Common/Charts/DeliveryEpicSizeChart.tsx:255:29
 		};
 
 		// D7: a departed epic gets an explicit null, so its segments stop instead of vanishing.
-		for (const epic of epics) {
-			row[sizeDataKey(epic.referenceId)] = sizes.get(epic.referenceId) ?? null;
-		}
+		for (const epic of epics) {}
 
 		return row;
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ undefined ] to deeply equal [ 8 ]

[Killed] LogicalOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:256:41
 
 		// D7: a departed epic gets an explicit null, so its segments stop instead of vanishing.
 		for (const epic of epics) {
-			row[sizeDataKey(epic.referenceId)] = sizes.get(epic.referenceId) ?? null;
+			row[sizeDataKey(epic.referenceId)] = sizes.get(epic.referenceId) && null;
 		}
 
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [ null ] to deeply equal [ 8 ]

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:262:38
 		return row;
 	});
 
-	const sizeSeries = visibleEpics.map((epic) => ({
-		id: epic.referenceId,
-		type: "bar" as const,
-		dataKey: sizeDataKey(epic.referenceId),
-		label: epic.name,
-		yAxisId: ITEMS_AXIS_ID,
-		stack: ITEMS_STACK_ID,
-		color: colorByReferenceId[epic.referenceId],
-		valueFormatter: (value: number | null, context: { dataIndex: number }) =>
-			formatSize(value, usesDefaultSize(epic.referenceId, context.dataIndex)),
-	}));
+	const sizeSeries = visibleEpics.map(() => undefined);
 
 	const itemsAxis = hasSizes
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:262:49
 		return row;
 	});
 
-	const sizeSeries = visibleEpics.map((epic) => ({
-		id: epic.referenceId,
-		type: "bar" as const,
-		dataKey: sizeDataKey(epic.referenceId),
-		label: epic.name,
-		yAxisId: ITEMS_AXIS_ID,
-		stack: ITEMS_STACK_ID,
-		color: colorByReferenceId[epic.referenceId],
-		valueFormatter: (value: number | null, context: { dataIndex: number }) =>
-			formatSize(value, usesDefaultSize(epic.referenceId, context.dataIndex)),
-	}));
+	const sizeSeries = visibleEpics.map((epic) => ({}));
 
 	const itemsAxis = hasSizes
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:270:19
 		yAxisId: ITEMS_AXIS_ID,
 		stack: ITEMS_STACK_ID,
 		color: colorByReferenceId[epic.referenceId],
-		valueFormatter: (value: number | null, context: { dataIndex: number }) =>
-			formatSize(value, usesDefaultSize(epic.referenceId, context.dataIndex)),
+		valueFormatter: () => undefined,
 	}));
 
killedBy: DeliveryEpicSizeChart size bars leaves an epic out of the day's tooltip when it was not in the delivery yet
statusReason: expected undefined to be null

[Killed] ArrayDeclaration
components/Common/Charts/DeliveryEpicSizeChart.tsx:275:5
 	}));
 
 	const itemsAxis = hasSizes
-		? [{ id: ITEMS_AXIS_ID, position: "left" as const }]
+		? []
 		: [];
 
killedBy: DeliveryEpicSizeChart size bars sizes the bars on their own left-hand scale, apart from the count (ADR-122)
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] StringLiteral
components/Common/Charts/DeliveryEpicSizeChart.tsx:282:26
 		<ChartCard title={title}>
 			<ChartsContainer
 				dataset={dataset}
-				xAxis={[{ scaleType: "band", dataKey: LABEL_DATA_KEY }]}
+				xAxis={[{ scaleType: "", dataKey: LABEL_DATA_KEY }]}
 				yAxis={[
 					...itemsAxis,
killedBy: DeliveryEpicSizeChart count line spaces the days evenly rather than by calendar distance (ADR-122)
statusReason: expected '' to be 'band' // Object.is equality

[Killed] ArrayDeclaration
components/Common/Charts/DeliveryEpicSizeChart.tsx:283:12
 			<ChartsContainer
 				dataset={dataset}
 				xAxis={[{ scaleType: "band", dataKey: LABEL_DATA_KEY }]}
-				yAxis={[
-					...itemsAxis,
-					// From zero always: an axis starting at the window's lowest count reads as a cliff.
-					{ id: COUNT_AXIS_ID, position: "right", min: 0 },
-				]}
+				yAxis={[]}
 				series={[
 					...sizeSeries,
killedBy: DeliveryEpicSizeChart count line draws the count against its own right-hand scale so sizes can share the chart (ADR-122)
statusReason: expected undefined to be 'right' // Object.is equality

[Killed] LogicalOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:308:6
 				<LinePlot />
 				<MarkPlot />
 				<ChartsXAxis />
-				{hasSizes && (
-					<ChartsYAxis axisId={ITEMS_AXIS_ID} label={ITEMS_AXIS_LABEL} />
-				)}
+				{hasSizes || <ChartsYAxis axisId={ITEMS_AXIS_ID} label={ITEMS_AXIS_LABEL} />}
 				<ChartsYAxis axisId={COUNT_AXIS_ID} label={COUNT_AXIS_LABEL} />
 				<ChartsTooltip />
killedBy: DeliveryEpicSizeChart size bars declares no items scale when there is nothing to size against it
statusReason: expected SVGGElement{ …(2), [Symbol(impl)]: SVGGElementImpl{ …(33), …(2) } } to be null

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:308:6
 				<LinePlot />
 				<MarkPlot />
 				<ChartsXAxis />
-				{hasSizes && (
-					<ChartsYAxis axisId={ITEMS_AXIS_ID} label={ITEMS_AXIS_LABEL} />
-				)}
+				{false}
 				<ChartsYAxis axisId={COUNT_AXIS_ID} label={COUNT_AXIS_LABEL} />
 				<ChartsTooltip />
killedBy: DeliveryEpicSizeChart size bars scales and labels the bars on an items axis of their own
statusReason: Unable to find an element by: [data-testid="mock-y-axis-items"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 MuiCard-root css-y91b3y-MuiPaper-root-MuiCard-root"
      data-testid="delivery-epic-size-chart"

[Killed] EqualityOperator
components/Common/Charts/DeliveryEpicSizeChart.tsx:314:5
 				<ChartsYAxis axisId={COUNT_AXIS_ID} label={COUNT_AXIS_LABEL} />
 				<ChartsTooltip />
 			</ChartsContainer>
-			{epics.length > 0 && (
+			{epics.length >= 0 && (
 				<ChartLegend
 					items={epics.map((epic) => ({
killedBy: DeliveryEpicSizeChart legend filtering offers no legend at all when there is nothing to filter
statusReason: expected <button …(4)>…(1)</button> to be null

[Killed] ConditionalExpression
components/Common/Charts/DeliveryEpicSizeChart.tsx:314:5
 				<ChartsYAxis axisId={COUNT_AXIS_ID} label={COUNT_AXIS_LABEL} />
 				<ChartsTooltip />
 			</ChartsContainer>
-			{epics.length > 0 && (
-				<ChartLegend
-					items={epics.map((epic) => ({
-						id: epic.referenceId,
-						label: epic.name,
-						color: colorByReferenceId[epic.referenceId],
-					}))}
-					selected={selected}
-					onToggle={toggle}
-					onShowAll={showAll}
-				/>
-			)}
+			{true}
 		</ChartCard>
 	);
killedBy: DeliveryEpicSizeChart legend filtering lists every epic in the window once, including one that has left (AC-4.1)
statusReason: Unable to find an accessible element with the role "button" and name `/legend/i`

Here are the accessible roles:

  heading:

  Name "Epics over Time":
  <h6

[Killed] ArrowFunction
components/Common/Charts/DeliveryEpicSizeChart.tsx:316:23
 			</ChartsContainer>
 			{epics.length > 0 && (
 				<ChartLegend
-					items={epics.map((epic) => ({
-						id: epic.referenceId,
-						label: epic.name,
-						color: colorByReferenceId[epic.referenceId],
-					}))}
+					items={epics.map(() => undefined)}
 					selected={selected}
 					onToggle={toggle}
killedBy: DeliveryEpicSizeChart legend filtering lists every epic in the window once, including one that has left (AC-4.1)
statusReason: Cannot read properties of undefined (reading 'id')
