[Killed] ArrowFunction
components/Common/Charts/ChartLegend.tsx:37:12
 	<Box
 		component="button"
 		type="button"
-		onClick={() => onToggle(item.id)}
+		onClick={() => undefined}
 		aria-pressed={visible}
 		sx={{
killedBy: DeliveryEpicSizeChart legend filtering leaves only the chosen epic's bars when one is picked (AC-4.2)
statusReason: expected [ 'EPIC-A', 'EPIC-B' ] to deeply equal [ 'EPIC-B' ]

[Killed] BooleanLiteral
components/Common/Charts/ChartLegend.tsx:73:43
 	onToggle,
 	onShowAll,
 }: ChartLegendProps): ReactElement => {
-	const [expanded, setExpanded] = useState(false);
+	const [expanded, setExpanded] = useState(true);
 
 	return (
killedBy: DeliveryEpicSizeChart legend filtering keeps the legend out of the way until the forecaster wants it
statusReason: expected <button …(3)>…(2)</button> to be null

[Survived] ObjectLiteral
components/Common/Charts/ChartLegend.tsx:76:12
 	const [expanded, setExpanded] = useState(false);
 
 	return (
-		<Box sx={{ mt: 1 }}>
+		<Box sx={{}}>
 			<Box sx={{ display: "flex", alignItems: "center", gap: 1 }}>
 				<Button

[Survived] StringLiteral
components/Common/Charts/ChartLegend.tsx:77:44
 
 	return (
 		<Box sx={{ mt: 1 }}>
-			<Box sx={{ display: "flex", alignItems: "center", gap: 1 }}>
+			<Box sx={{ display: "flex", alignItems: "", gap: 1 }}>
 				<Button
 					size="small"

[Survived] StringLiteral
components/Common/Charts/ChartLegend.tsx:77:24
 
 	return (
 		<Box sx={{ mt: 1 }}>
-			<Box sx={{ display: "flex", alignItems: "center", gap: 1 }}>
+			<Box sx={{ display: "", alignItems: "center", gap: 1 }}>
 				<Button
 					size="small"

[Killed] ArrowFunction
components/Common/Charts/ChartLegend.tsx:83:33
 					variant="text"
 					aria-expanded={expanded}
 					endIcon={expanded ? <ExpandLessIcon /> : <ExpandMoreIcon />}
-					onClick={() => setExpanded((previous) => !previous)}
+					onClick={() => setExpanded(() => undefined)}
 				>
 					{`Legend (${items.length})`}
killedBy: DeliveryEpicSizeChart legend filtering lists every epic in the window once, including one that has left (AC-4.1)
statusReason: Unable to find an accessible element with the role "button" and name "Epic EPIC-A"

Here are the accessible roles:

  heading:

  Name "Epics over Time":
  <h6

[Killed] BooleanLiteral
components/Common/Charts/ChartLegend.tsx:83:47
 					variant="text"
 					aria-expanded={expanded}
 					endIcon={expanded ? <ExpandLessIcon /> : <ExpandMoreIcon />}
-					onClick={() => setExpanded((previous) => !previous)}
+					onClick={() => setExpanded((previous) => previous)}
 				>
 					{`Legend (${items.length})`}
killedBy: DeliveryEpicSizeChart legend filtering lists every epic in the window once, including one that has left (AC-4.1)
statusReason: Unable to find an accessible element with the role "button" and name "Epic EPIC-A"

Here are the accessible roles:

  heading:

  Name "Epics over Time":
  <h6

[Killed] EqualityOperator
components/Common/Charts/ChartLegend.tsx:87:6
 				>
 					{`Legend (${items.length})`}
 				</Button>
-				{selected.size > 0 && (
+				{selected.size <= 0 && (
 					<Button size="small" variant="text" onClick={onShowAll}>
 						Show all
killedBy: ChartLegend clears the whole selection in one action (AC-4.4)
statusReason: Unable to find an accessible element with the role "button" and name `/show all/i`

Here are the accessible roles:

  button:

  Name "Legend (3)":
  <button

[Killed] ConditionalExpression
components/Common/Charts/ChartLegend.tsx:87:6
 				>
 					{`Legend (${items.length})`}
 				</Button>
-				{selected.size > 0 && (
-					<Button size="small" variant="text" onClick={onShowAll}>
-						Show all
-					</Button>
-				)}
+				{true}
 			</Box>
 			{expanded && (
killedBy: DeliveryEpicSizeChart legend filtering clears the whole filter in one action (AC-4.4)
statusReason: Unable to find an accessible element with the role "button" and name `/show all/i`

Here are the accessible roles:

  heading:

  Name "Epics over Time":
  <h6

[Killed] ConditionalExpression
components/Common/Charts/ChartLegend.tsx:93:5
 					</Button>
 				)}
 			</Box>
-			{expanded && (
-				<Box sx={{ display: "flex", flexWrap: "wrap", gap: 1.5, mt: 1 }}>
-					{items.map((item) => (
-						<ChartLegendEntry
-							key={item.id}
-							item={item}
-							visible={isShown(selected, item.id)}
-							onToggle={onToggle}
-						/>
-					))}
-				</Box>
-			)}
+			{true}
 		</Box>
 	);
killedBy: ChartLegend lists one entry per item once opened
statusReason: Unable to find an accessible element with the role "button" and name "Checkout"

Here are the accessible roles:

  button:

  Name "Legend (3)":
  <button

[Killed] ConditionalExpression
components/Common/Charts/ChartLegend.tsx:93:5
 					</Button>
 				)}
 			</Box>
-			{expanded && (
-				<Box sx={{ display: "flex", flexWrap: "wrap", gap: 1.5, mt: 1 }}>
-					{items.map((item) => (
-						<ChartLegendEntry
-							key={item.id}
-							item={item}
-							visible={isShown(selected, item.id)}
-							onToggle={onToggle}
-						/>
-					))}
-				</Box>
-			)}
+			{false}
 		</Box>
 	);
killedBy: ChartLegend lists one entry per item once opened
statusReason: Unable to find an accessible element with the role "button" and name "Checkout"

Here are the accessible roles:

  button:

  Name "Legend (3)":
  <button

[Killed] ArrowFunction
components/Common/Charts/ChartLegend.tsx:95:17
 			</Box>
 			{expanded && (
 				<Box sx={{ display: "flex", flexWrap: "wrap", gap: 1.5, mt: 1 }}>
-					{items.map((item) => (
-						<ChartLegendEntry
-							key={item.id}
-							item={item}
-							visible={isShown(selected, item.id)}
-							onToggle={onToggle}
-						/>
-					))}
+					{items.map(() => undefined)}
 				</Box>
 			)}
killedBy: DeliveryEpicSizeChart legend filtering lists every epic in the window once, including one that has left (AC-4.1)
statusReason: Unable to find an accessible element with the role "button" and name "Epic EPIC-A"

Here are the accessible roles:

  heading:

  Name "Epics over Time":
  <h6
