[Killed] BlockStatement
components/Common/Charts/DeliveryFeverChart.tsx:48:7
 
 const FeverZoneBands: React.FC<{ colors: Record<FeverZone, string> }> = ({
 	colors,
-}) => {
-	const xScale = useXScale();
-	const yScale = useYScale();
-	return (
-		<g>
-			{feverZonePolygons().map((polygon) => (
-				<path
-					key={polygon.zone}
-					d={zoneBandPath(polygon.points, xScale, yScale)}
-					fill={colors[polygon.zone]}
-					fillOpacity={ZONE_FILL_OPACITY}
-				/>
-			))}
-		</g>
-	);
-};
+}) => {};
 
 const DeliveryFeverChart: React.FC<DeliveryFeverChartProps> = ({
killedBy: DeliveryFeverChart paints the three fever zones behind the bubbles
statusReason: expected [] to deeply equal [ '#4caf50', '#ff9800', '#f44336' ]

[Killed] ArrowFunction
components/Common/Charts/DeliveryFeverChart.tsx:53:29
 	const yScale = useYScale();
 	return (
 		<g>
-			{feverZonePolygons().map((polygon) => (
-				<path
-					key={polygon.zone}
-					d={zoneBandPath(polygon.points, xScale, yScale)}
-					fill={colors[polygon.zone]}
-					fillOpacity={ZONE_FILL_OPACITY}
-				/>
-			))}
+			{feverZonePolygons().map(() => undefined)}
 		</g>
 	);
killedBy: DeliveryFeverChart paints the three fever zones behind the bubbles
statusReason: expected [] to deeply equal [ '#4caf50', '#ff9800', '#f44336' ]

[Killed] MethodExpression
components/Common/Charts/DeliveryFeverChart.tsx:74:25
 	const { selected, isVisible, toggle, showAll } = useLegendFilter();
 	const chart = deriveFeatureFeverChart(history);
 	const maxLength = chart.features.reduce(
-		(longest, feature) => Math.max(longest, feature.points.length),
+		(longest, feature) => Math.min(longest, feature.points.length),
 		0,
 	);
killedBy: DeliveryFeverChart moves a single bubble per feature during the animation, never a growing trail
statusReason: Unable to find an accessible element with the role "button" and name "Run"

Here are the accessible roles:

  heading:

  Name "Delivery Progress":
  <h6

[Killed] ArrowFunction
components/Common/Charts/DeliveryFeverChart.tsx:74:3
 	const { selected, isVisible, toggle, showAll } = useLegendFilter();
 	const chart = deriveFeatureFeverChart(history);
 	const maxLength = chart.features.reduce(
-		(longest, feature) => Math.max(longest, feature.points.length),
+		() => undefined,
 		0,
 	);
killedBy: DeliveryFeverChart moves a single bubble per feature during the animation, never a growing trail
statusReason: Unable to find an accessible element with the role "button" and name "Run"

Here are the accessible roles:

  heading:

  Name "Delivery Progress":
  <h6

[Killed] ConditionalExpression
components/Common/Charts/DeliveryFeverChart.tsx:79:6
 	);
 	const { frame, isRunning, run } = useFeatureFeverReveal(maxLength);
 
-	if (chart.empty) {
+	if (true) {
 		return (
 			<Card sx={{ p: 2, borderRadius: 2 }}>
killedBy: DeliveryFeverChart shows a single bubble per feature at its latest snapshot by default
statusReason: expected undefined to deeply equal [ { x: 60, y: 5, id: +0 } ]

[Killed] BlockStatement
components/Common/Charts/DeliveryFeverChart.tsx:79:19
 	);
 	const { frame, isRunning, run } = useFeatureFeverReveal(maxLength);
 
-	if (chart.empty) {
-		return (
-			<Card sx={{ p: 2, borderRadius: 2 }}>
-				<CardContent>
-					<Typography variant="h6">{title}</Typography>
-					<Typography variant="body2" color="text.secondary" sx={{ mt: 2 }}>
-						{FORWARD_ONLY_EMPTY_STATE}
-					</Typography>
-				</CardContent>
-			</Card>
-		);
-	}
+	if (chart.empty) {}
 
 	// Shared with the size chart on the same tab, so an epic is one colour across the tab.
killedBy: DeliveryFeverChart shows the forward-only empty state and no chart when no feature was recorded
statusReason: Unable to find an element with the text: /no feature snapshots recorded yet/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 MuiCard-r

[Survived] ObjectLiteral
components/Common/Charts/DeliveryFeverChart.tsx:81:14
 
 	if (chart.empty) {
 		return (
-			<Card sx={{ p: 2, borderRadius: 2 }}>
+			<Card sx={{}}>
 				<CardContent>
 					<Typography variant="h6">{title}</Typography>

[Survived] ObjectLiteral
components/Common/Charts/DeliveryFeverChart.tsx:84:61
 			<Card sx={{ p: 2, borderRadius: 2 }}>
 				<CardContent>
 					<Typography variant="h6">{title}</Typography>
-					<Typography variant="body2" color="text.secondary" sx={{ mt: 2 }}>
+					<Typography variant="body2" color="text.secondary" sx={{}}>
 						{FORWARD_ONLY_EMPTY_STATE}
 					</Typography>

[Killed] ArrowFunction
components/Common/Charts/DeliveryFeverChart.tsx:94:65
 
 	// Shared with the size chart on the same tab, so an epic is one colour across the tab.
 	const colorByReferenceId = deliveryEpicColors(history);
-	const colouredFeatures: ColouredFeature[] = chart.features.map((feature) => ({
-		...feature,
-		color: colorByReferenceId[feature.referenceId],
-	}));
+	const colouredFeatures: ColouredFeature[] = chart.features.map(() => undefined);
 
 	const legendItems: ChartLegendItem[] = colouredFeatures.map((feature) => ({
killedBy: DeliveryFeverChart shows a single bubble per feature at its latest snapshot by default
statusReason: Cannot read properties of undefined (reading 'referenceId')

[Killed] ArrowFunction
components/Common/Charts/DeliveryFeverChart.tsx:99:62
 		color: colorByReferenceId[feature.referenceId],
 	}));
 
-	const legendItems: ChartLegendItem[] = colouredFeatures.map((feature) => ({
-		id: feature.referenceId,
-		label: feature.name,
-		color: feature.color,
-	}));
+	const legendItems: ChartLegendItem[] = colouredFeatures.map(() => undefined);
 
 	const series = colouredFeatures
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
components/Common/Charts/DeliveryFeverChart.tsx:105:17
 		color: feature.color,
 	}));
 
-	const series = colouredFeatures
-		.filter((feature) => isVisible(feature.referenceId))
+	const series = colouredFeatures
 		.map((feature) => ({
 			id: feature.referenceId,
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: expected { id: 'F-2', label: 'Search', …(4) } to be undefined

[Killed] ArrowFunction
components/Common/Charts/DeliveryFeverChart.tsx:106:11
 	}));
 
 	const series = colouredFeatures
-		.filter((feature) => isVisible(feature.referenceId))
+		.filter(() => undefined)
 		.map((feature) => ({
 			id: feature.referenceId,
killedBy: DeliveryFeverChart shows a single bubble per feature at its latest snapshot by default
statusReason: expected undefined to deeply equal [ { x: 60, y: 5, id: +0 } ]

[Killed] ArrowFunction
components/Common/Charts/DeliveryFeverChart.tsx:107:8
 
 	const series = colouredFeatures
 		.filter((feature) => isVisible(feature.referenceId))
-		.map((feature) => ({
-			id: feature.referenceId,
-			label: feature.name,
-			color: feature.color,
-			markerSize: 7,
-			valueFormatter: likelihoodTooltip,
-			data: visiblePoints(feature, frame),
-		}));
+		.map(() => undefined);
 
 	const canAnimate = maxLength > 1;
killedBy: DeliveryFeverChart shows a single bubble per feature at its latest snapshot by default
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
components/Common/Charts/DeliveryFeverChart.tsx:116:21
 			data: visiblePoints(feature, frame),
 		}));
 
-	const canAnimate = maxLength > 1;
+	const canAnimate = false;
 
 	return (
killedBy: DeliveryFeverChart moves a single bubble per feature during the animation, never a growing trail
statusReason: Unable to find an accessible element with the role "button" and name "Run"

Here are the accessible roles:

  heading:

  Name "Delivery Progress":
  <h6

[Killed] EqualityOperator
components/Common/Charts/DeliveryFeverChart.tsx:116:21
 			data: visiblePoints(feature, frame),
 		}));
 
-	const canAnimate = maxLength > 1;
+	const canAnimate = maxLength <= 1;
 
 	return (
killedBy: DeliveryFeverChart moves a single bubble per feature during the animation, never a growing trail
statusReason: Unable to find an accessible element with the role "button" and name "Run"

Here are the accessible roles:

  heading:

  Name "Delivery Progress":
  <h6

[Killed] StringLiteral
components/Common/Charts/DeliveryFeverChart.tsx:146:41
 					) : null}
 				</Box>
 				<ScatterChart
-					xAxis={[{ min: 0, max: 100, label: "Completion Rate (%)" }]}
+					xAxis={[{ min: 0, max: 100, label: "" }]}
 					yAxis={[{ min: 0, max: 100, label: "Chance of Being Late (%)" }]}
 					series={series}
killedBy: DeliveryFeverChart labels the axes as completion rate and chance of being late on a 0-100 scale
statusReason: expected '' to match /completion/i
