[Killed] ArrowFunction
components/Common/Charts/deliveryEpicColors.ts:11:35
  * un-forecastable epics and the size chart drops sizeless ones, so a per-chart map would paint the
  * same epic two different colours on the same tab.
  */
-export const deliveryEpicColors = (
-	history: DeliveryMetricsHistory,
-): Record<string, string> =>
-	getColorMapForKeys(
-		history.points.flatMap((point) =>
-			point.featureBreakdown.map((metric) => metric.referenceId),
-		),
-	);
+export const deliveryEpicColors = () => undefined;
 
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'EPIC-A')

[Killed] ArrowFunction
components/Common/Charts/deliveryEpicColors.ts:15:26
 	history: DeliveryMetricsHistory,
 ): Record<string, string> =>
 	getColorMapForKeys(
-		history.points.flatMap((point) =>
-			point.featureBreakdown.map((metric) => metric.referenceId),
+		history.points.flatMap(() => undefined,
 		),
 	);
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ArrowFunction
components/Common/Charts/deliveryEpicColors.ts:16:31
 ): Record<string, string> =>
 	getColorMapForKeys(
 		history.points.flatMap((point) =>
-			point.featureBreakdown.map((metric) => metric.referenceId),
+			point.featureBreakdown.map(() => undefined),
 		),
 	);
killedBy: DeliveryFeverChart labels each feature series with its name and a distinct colour
statusReason: expected undefined not to be undefined // Object.is equality
