[Killed] ArrowFunction
components/Common/Charts/useLegendFilter.ts:12:24
 
 // An empty selection means "show everything" (AC-4.3): the forecaster has not filtered yet, so
 // unpicking the last entry has to land back on the unfiltered chart rather than on an empty one.
-export const isShown = (selected: ReadonlySet<string>, id: string): boolean =>
-	selected.size === 0 || selected.has(id);
+export const isShown = () => undefined;
 
 // AC-4.6: one instance per chart, so two expanded deliveries filter independently.
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
components/Common/Charts/useLegendFilter.ts:13:2
 // An empty selection means "show everything" (AC-4.3): the forecaster has not filtered yet, so
 // unpicking the last entry has to land back on the unfiltered chart rather than on an empty one.
 export const isShown = (selected: ReadonlySet<string>, id: string): boolean =>
-	selected.size === 0 || selected.has(id);
+	true;
 
 // AC-4.6: one instance per chart, so two expanded deliveries filter independently.
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: expected { id: 'F-2', label: 'Search', …(4) } to be undefined

[Killed] EqualityOperator
components/Common/Charts/useLegendFilter.ts:13:2
 // An empty selection means "show everything" (AC-4.3): the forecaster has not filtered yet, so
 // unpicking the last entry has to land back on the unfiltered chart rather than on an empty one.
 export const isShown = (selected: ReadonlySet<string>, id: string): boolean =>
-	selected.size === 0 || selected.has(id);
+	selected.size !== 0 || selected.has(id);
 
 // AC-4.6: one instance per chart, so two expanded deliveries filter independently.
killedBy: DeliveryFeverChart shows a single bubble per feature at its latest snapshot by default
statusReason: expected undefined to deeply equal [ { x: 60, y: 5, id: +0 } ]

[Killed] BlockStatement
components/Common/Charts/useLegendFilter.ts:16:52
 	selected.size === 0 || selected.has(id);
 
 // AC-4.6: one instance per chart, so two expanded deliveries filter independently.
-export const useLegendFilter = (): LegendFilter => {
-	const [selected, setSelected] = useState<ReadonlySet<string>>(new Set());
-
-	const toggle = useCallback((id: string) => {
-		setSelected((previous) => {
-			const next = new Set(previous);
-			if (next.has(id)) {
-				next.delete(id);
-			} else {
-				next.add(id);
-			}
-			return next;
-		});
-	}, []);
-
-	const showAll = useCallback(() => setSelected(new Set()), []);
-
-	const isVisible = useCallback(
-		(id: string) => isShown(selected, id),
-		[selected],
-	);
-
-	return { selected, isVisible, toggle, showAll };
-};
+export const useLegendFilter = (): LegendFilter => {};
 
killedBy: DeliveryEpicSizeChart count line plots one point per recorded day whose value is that day's epic count (AC-1.1)
statusReason: Cannot destructure property 'selected' of 'useLegendFilter(...)' as it is undefined.

[Killed] BlockStatement
components/Common/Charts/useLegendFilter.ts:19:45
 export const useLegendFilter = (): LegendFilter => {
 	const [selected, setSelected] = useState<ReadonlySet<string>>(new Set());
 
-	const toggle = useCallback((id: string) => {
-		setSelected((previous) => {
-			const next = new Set(previous);
-			if (next.has(id)) {
-				next.delete(id);
-			} else {
-				next.add(id);
-			}
-			return next;
-		});
-	}, []);
+	const toggle = useCallback((id: string) => {}, []);
 
 	const showAll = useCallback(() => setSelected(new Set()), []);
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: expected { id: 'F-2', label: 'Search', …(4) } to be undefined

[Killed] BlockStatement
components/Common/Charts/useLegendFilter.ts:20:29
 	const [selected, setSelected] = useState<ReadonlySet<string>>(new Set());
 
 	const toggle = useCallback((id: string) => {
-		setSelected((previous) => {
-			const next = new Set(previous);
-			if (next.has(id)) {
-				next.delete(id);
-			} else {
-				next.add(id);
-			}
-			return next;
-		});
+		setSelected((previous) => {});
 	}, []);
 
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] ConditionalExpression
components/Common/Charts/useLegendFilter.ts:22:8
 	const toggle = useCallback((id: string) => {
 		setSelected((previous) => {
 			const next = new Set(previous);
-			if (next.has(id)) {
+			if (true) {
 				next.delete(id);
 			} else {
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: expected { id: 'F-2', label: 'Search', …(4) } to be undefined

[Killed] BlockStatement
components/Common/Charts/useLegendFilter.ts:22:22
 	const toggle = useCallback((id: string) => {
 		setSelected((previous) => {
 			const next = new Set(previous);
-			if (next.has(id)) {
-				next.delete(id);
-			} else {
+			if (next.has(id)) {} else {
 				next.add(id);
 			}
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: expected undefined to be defined

[Killed] BlockStatement
components/Common/Charts/useLegendFilter.ts:24:11
 			const next = new Set(previous);
 			if (next.has(id)) {
 				next.delete(id);
-			} else {
-				next.add(id);
-			}
+			} else {}
 			return next;
 		});
killedBy: DeliveryFeverChart leaves only the picked feature on the chart, and restores the rest when it is unpicked
statusReason: expected { id: 'F-2', label: 'Search', …(4) } to be undefined

[Killed] ArrowFunction
components/Common/Charts/useLegendFilter.ts:31:30
 		});
 	}, []);
 
-	const showAll = useCallback(() => setSelected(new Set()), []);
+	const showAll = useCallback(() => undefined, []);
 
 	const isVisible = useCallback(
killedBy: DeliveryEpicSizeChart legend filtering clears the whole filter in one action (AC-4.4)
statusReason: expected [ 'EPIC-B' ] to deeply equal [ 'EPIC-A', 'EPIC-B' ]

[Killed] ArrowFunction
components/Common/Charts/useLegendFilter.ts:34:3
 	const showAll = useCallback(() => setSelected(new Set()), []);
 
 	const isVisible = useCallback(
-		(id: string) => isShown(selected, id),
+		() => undefined,
 		[selected],
 	);
killedBy: DeliveryEpicSizeChart size bars gives every epic on a day its own segment, sized by its items (AC-2.5)
statusReason: expected [] to have a length of 2 but got +0
