[Killed] BlockStatement
pages/Common/MetricsView/BaseMetricsView.tsx:1228:55
 	// A date the browser could not parse is still a Date object, and an object is
 	// truthy, so a plain null check lets it through into state and into the URL,
 	// where it turns into NaN and takes the page down on the next render.
-	const handleStartDateChange = (date: Date | null) => {
-		if (!isValidDate(date)) return;
-		setStartDate(date);
-		updateDateParams(date, endDate);
-	};
+	const handleStartDateChange = (date: Date | null) => {};
 
 	const handleEndDateChange = (date: Date | null) => {
killedBy: BaseMetricsView component updates data when start date changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
pages/Common/MetricsView/BaseMetricsView.tsx:1229:7
 	// truthy, so a plain null check lets it through into state and into the URL,
 	// where it turns into NaN and takes the page down on the next render.
 	const handleStartDateChange = (date: Date | null) => {
-		if (!isValidDate(date)) return;
+		if (false) return;
 		setStartDate(date);
 		updateDateParams(date, endDate);
killedBy: BaseMetricsView component Unusable dates never reach the dashboard state leaves the window untouched when the picker fires pick-unusable-start-date
statusReason: formatLocalDate cannot encode Invalid Date as a calendar day.

[Killed] BooleanLiteral
pages/Common/MetricsView/BaseMetricsView.tsx:1229:7
 	// truthy, so a plain null check lets it through into state and into the URL,
 	// where it turns into NaN and takes the page down on the next render.
 	const handleStartDateChange = (date: Date | null) => {
-		if (!isValidDate(date)) return;
+		if (isValidDate(date)) return;
 		setStartDate(date);
 		updateDateParams(date, endDate);
killedBy: BaseMetricsView component updates data when start date changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
pages/Common/MetricsView/BaseMetricsView.tsx:1234:53
 		updateDateParams(date, endDate);
 	};
 
-	const handleEndDateChange = (date: Date | null) => {
-		if (!isValidDate(date)) return;
-		setEndDate(date);
-		updateDateParams(startDate, date);
-	};
+	const handleEndDateChange = (date: Date | null) => {};
 
 	const ownerType: "team" | "portfolio" =
killedBy: BaseMetricsView component uses selected end date as load balance matrix today point
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2026-08-06T08:37:02.767Z
Received:
  2026-09-05T08:37:02.767Z

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
pages/Common/MetricsView/BaseMetricsView.tsx:1235:7
 	};
 
 	const handleEndDateChange = (date: Date | null) => {
-		if (!isValidDate(date)) return;
+		if (true) return;
 		setEndDate(date);
 		updateDateParams(startDate, date);
killedBy: BaseMetricsView component uses selected end date as load balance matrix today point
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2026-08-06T08:37:07.918Z
Received:
  2026-09-05T08:37:07.918Z

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
pages/Common/MetricsView/BaseMetricsView.tsx:1235:7
 	};
 
 	const handleEndDateChange = (date: Date | null) => {
-		if (!isValidDate(date)) return;
+		if (isValidDate(date)) return;
 		setEndDate(date);
 		updateDateParams(startDate, date);
killedBy: BaseMetricsView component uses selected end date as load balance matrix today point
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2026-08-06T08:37:05.349Z
Received:
  2026-09-05T08:37:05.349Z

Ignored nodes: comments, script, style
