[Killed] ObjectLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:9:49
 import { useEffect, useRef, useState } from "react";
 import { isValidDate } from "../../../utils/date/isValidDate";
 
-const DATE_FNS_TOKENS: Record<string, string> = {
-	day: "dd",
-	month: "MM",
-	year: "yyyy",
-};
+const DATE_FNS_TOKENS: Record<string, string> = {};
 
 const getLocaleDateFormat = (): string =>
killedBy: DateRangeSelector date format orders the field's sections the way the viewer's own locale writes a date
statusReason: expected [ 'Empty', 'Empty' ] to deeply equal [ 'Day', 'Month', 'Year' ]

[Killed] StringLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:12:8
 const DATE_FNS_TOKENS: Record<string, string> = {
 	day: "dd",
 	month: "MM",
-	year: "yyyy",
+	year: "",
 };
 
killedBy: DateRangeSelector date format orders the field's sections the way the viewer's own locale writes a date
statusReason: expected [ 'Day', 'Month', 'Day' ] to deeply equal [ 'Day', 'Month', 'Year' ]

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:15:29
 	year: "yyyy",
 };
 
-const getLocaleDateFormat = (): string =>
-	new Intl.DateTimeFormat()
-		.formatToParts(new Date(2000, 0, 2))
-		.map((part) => DATE_FNS_TOKENS[part.type] ?? part.value)
-		.join("");
+const getLocaleDateFormat = () => undefined;
 
 interface BoundedDatePickerProps {
killedBy: DateRangeSelector date format orders the field's sections the way the viewer's own locale writes a date
statusReason: expected [ 'Month', 'Day', 'Year' ] to deeply equal [ 'Day', 'Month', 'Year' ]

[Killed] LogicalOperator
components/Common/DateRangeSelector/DateRangeSelector.tsx:18:18
 const getLocaleDateFormat = (): string =>
 	new Intl.DateTimeFormat()
 		.formatToParts(new Date(2000, 0, 2))
-		.map((part) => DATE_FNS_TOKENS[part.type] ?? part.value)
+		.map((part) => DATE_FNS_TOKENS[part.type] && part.value)
 		.join("");
 
killedBy: DateRangeSelector date format orders the field's sections the way the viewer's own locale writes a date
statusReason: expected [ 'Empty', 'Empty' ] to deeply equal [ 'Day', 'Month', 'Year' ]

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:18:8
 const getLocaleDateFormat = (): string =>
 	new Intl.DateTimeFormat()
 		.formatToParts(new Date(2000, 0, 2))
-		.map((part) => DATE_FNS_TOKENS[part.type] ?? part.value)
+		.map(() => undefined)
 		.join("");
 
killedBy: DateRangeSelector date format orders the field's sections the way the viewer's own locale writes a date
statusReason: Cannot read properties of null (reading 'map')

[Killed] StringLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:19:9
 	new Intl.DateTimeFormat()
 		.formatToParts(new Date(2000, 0, 2))
 		.map((part) => DATE_FNS_TOKENS[part.type] ?? part.value)
-		.join("");
+		.join("Stryker was here!");
 
 interface BoundedDatePickerProps {
killedBy: DateRangeSelector date format orders the field's sections the way the viewer's own locale writes a date
statusReason: expected [ 'Meridiem', 'Seconds', 'Week day' ] to deeply equal [ 'Day', 'Month', 'Year' ]

[Killed] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:53:51
 }) => {
 	const theme = useTheme();
 	const [draft, setDraft] = useState<Date | null>(value);
-	const [calendarOpen, setCalendarOpen] = useState(false);
+	const [calendarOpen, setCalendarOpen] = useState(true);
 
 	useEffect(() => {
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: Found multiple elements with the role "dialog"

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="MuiPopper-root MuiPickerPopper-root css-18ultcs-MuiPopper-root-MuiPickerPopper-root"
  data-popper-escaped=""

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:55:18
 	const [draft, setDraft] = useState<Date | null>(value);
 	const [calendarOpen, setCalendarOpen] = useState(false);
 
-	useEffect(() => {
-		setDraft((current) =>
-			current?.getTime() === value.getTime() ? current : value,
-		);
-	}, [value]);
+	useEffect(() => {}, [value]);
 
 	const isReportableChange = (candidate: Date | null): candidate is Date => {
killedBy: DateRangeSelector when the range moves underneath it shows the new start date when nobody was editing the field
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  09
Received:
  15

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:56:12
 	const [calendarOpen, setCalendarOpen] = useState(false);
 
 	useEffect(() => {
-		setDraft((current) =>
-			current?.getTime() === value.getTime() ? current : value,
+		setDraft(() => undefined,
 		);
 	}, [value]);
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: expected "vi.fn()" to be called with arguments: [ 2026-07-04T22:00:00.000Z ]

Received:

  1st vi.fn() call:

  [
-   2026-07-04T22:00:00.000Z,

[Killed] EqualityOperator
components/Common/DateRangeSelector/DateRangeSelector.tsx:57:4
 
 	useEffect(() => {
 		setDraft((current) =>
-			current?.getTime() === value.getTime() ? current : value,
+			current?.getTime() !== value.getTime() ? current : value,
 		);
 	}, [value]);
killedBy: DateRangeSelector when the range moves underneath it shows the new start date when nobody was editing the field
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  09
Received:
  15

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:57:4
 
 	useEffect(() => {
 		setDraft((current) =>
-			current?.getTime() === value.getTime() ? current : value,
+			true ? current : value,
 		);
 	}, [value]);
killedBy: DateRangeSelector when the range moves underneath it shows the new start date when nobody was editing the field
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  09
Received:
  15

[Killed] ArrayDeclaration
components/Common/DateRangeSelector/DateRangeSelector.tsx:59:5
 		setDraft((current) =>
 			current?.getTime() === value.getTime() ? current : value,
 		);
-	}, [value]);
+	}, []);
 
 	const isReportableChange = (candidate: Date | null): candidate is Date => {
killedBy: DateRangeSelector when the range moves underneath it shows the new start date when nobody was editing the field
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  09
Received:
  15

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:61:76
 		);
 	}, [value]);
 
-	const isReportableChange = (candidate: Date | null): candidate is Date => {
-		if (!isValidDate(candidate)) {
-			return false;
-		}
-
-		if (minDate && candidate < minDate) {
-			return false;
-		}
-
-		if (maxDate && candidate > maxDate) {
-			return false;
-		}
-
-		return candidate.getTime() !== value.getTime();
-	};
+	const isReportableChange = (candidate: Date | null): candidate is Date => {};
 
 	const finishEdit = (candidate: Date | null) => {
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:62:7
 	}, [value]);
 
 	const isReportableChange = (candidate: Date | null): candidate is Date => {
-		if (!isValidDate(candidate)) {
+		if (false) {
 			return false;
 		}
killedBy: DateRangeSelector keyboard entry keeps the previously working date when an edit finishes on an unusable keystroke
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Date { NaN },

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:62:32
 	}, [value]);
 
 	const isReportableChange = (candidate: Date | null): candidate is Date => {
-		if (!isValidDate(candidate)) {
-			return false;
-		}
+		if (!isValidDate(candidate)) {}
 
 		if (minDate && candidate < minDate) {
killedBy: DateRangeSelector keyboard entry keeps the previously working date when an edit finishes on an unusable keystroke
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Date { NaN },

[Killed] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:63:11
 
 	const isReportableChange = (candidate: Date | null): candidate is Date => {
 		if (!isValidDate(candidate)) {
-			return false;
+			return true;
 		}
 
killedBy: DateRangeSelector keyboard entry keeps the previously working date when an edit finishes on an unusable keystroke
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Date { NaN },

[Killed] LogicalOperator
components/Common/DateRangeSelector/DateRangeSelector.tsx:66:7
 			return false;
 		}
 
-		if (minDate && candidate < minDate) {
+		if (minDate || candidate < minDate) {
 			return false;
 		}
killedBy: DateRangeSelector keyboard entry reports a typed end date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:66:18
 			return false;
 		}
 
-		if (minDate && candidate < minDate) {
+		if (minDate && true) {
 			return false;
 		}
killedBy: DateRangeSelector keyboard entry reports a typed end date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:67:11
 		}
 
 		if (minDate && candidate < minDate) {
-			return false;
+			return true;
 		}
 
killedBy: DateRangeSelector keyboard entry rejects a finished date before the start of the range
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      2019-12-31T23:00:00.000Z,

[Killed] LogicalOperator
components/Common/DateRangeSelector/DateRangeSelector.tsx:70:7
 			return false;
 		}
 
-		if (maxDate && candidate > maxDate) {
+		if (maxDate || candidate > maxDate) {
 			return false;
 		}
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:70:18
 			return false;
 		}
 
-		if (maxDate && candidate > maxDate) {
+		if (maxDate && true) {
 			return false;
 		}
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:71:11
 		}
 
 		if (maxDate && candidate > maxDate) {
-			return false;
+			return true;
 		}
 
killedBy: DateRangeSelector keyboard entry rejects a finished date beyond the end of the range
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      2026-08-31T22:00:00.000Z,

[Killed] EqualityOperator
components/Common/DateRangeSelector/DateRangeSelector.tsx:74:10
 			return false;
 		}
 
-		return candidate.getTime() !== value.getTime();
+		return candidate.getTime() === value.getTime();
 	};
 
killedBy: DashboardHeader date range popover keeps a date typed into the popover after Escape closes it
statusReason: expected "vi.fn()" to be called with arguments: [ 2026-07-04T22:00:00.000Z ]

Received:

  1st vi.fn() call:

  [
-   2026-07-04T22:00:00.000Z,

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:74:10
 			return false;
 		}
 
-		return candidate.getTime() !== value.getTime();
+		return false;
 	};
 
killedBy: DashboardHeader date range popover keeps a date typed into the popover after Escape closes it
statusReason: expected "vi.fn()" to be called with arguments: [ 2026-07-04T22:00:00.000Z ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:77:49
 		return candidate.getTime() !== value.getTime();
 	};
 
-	const finishEdit = (candidate: Date | null) => {
-		if (isReportableChange(candidate)) {
-			onValueChange(candidate);
-		} else {
-			setDraft(value);
-		}
-	};
+	const finishEdit = (candidate: Date | null) => {};
 
 	// This field lives inside a popover, and clicking the backdrop tears it down
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:78:7
 	};
 
 	const finishEdit = (candidate: Date | null) => {
-		if (isReportableChange(candidate)) {
+		if (false) {
 			onValueChange(candidate);
 		} else {
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:78:7
 	};
 
 	const finishEdit = (candidate: Date | null) => {
-		if (isReportableChange(candidate)) {
+		if (true) {
 			onValueChange(candidate);
 		} else {
killedBy: DateRangeSelector keyboard entry keeps the previously working date when an edit finishes on an unusable keystroke
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Date { NaN },

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:80:10
 	const finishEdit = (candidate: Date | null) => {
 		if (isReportableChange(candidate)) {
 			onValueChange(candidate);
-		} else {
-			setDraft(value);
-		}
+		} else {}
 	};
 
killedBy: DateRangeSelector keyboard entry puts the last working date back in the field when an edit finishes on an unusable keystroke
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  15
Received:
  00

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:91:18
 	// and the dashboard silently ignores what they typed.
 	const flushOnUnmount = useRef<() => void>(() => {});
 
-	useEffect(() => {
-		flushOnUnmount.current = () => {
-			if (isReportableChange(draft)) {
-				onValueChange(draft);
-			}
-		};
-	});
+	useEffect(() => {});
 
 	useEffect(() => () => flushOnUnmount.current(), []);
killedBy: DateRangeSelector keyboard entry reports a finished date when the popover closes instead of blurring
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:92:34
 	const flushOnUnmount = useRef<() => void>(() => {});
 
 	useEffect(() => {
-		flushOnUnmount.current = () => {
-			if (isReportableChange(draft)) {
-				onValueChange(draft);
-			}
-		};
+		flushOnUnmount.current = () => {};
 	});
 
killedBy: DateRangeSelector keyboard entry reports a finished date when the popover closes instead of blurring
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:93:8
 
 	useEffect(() => {
 		flushOnUnmount.current = () => {
-			if (isReportableChange(draft)) {
+			if (false) {
 				onValueChange(draft);
 			}
killedBy: DateRangeSelector keyboard entry reports a finished date when the popover closes instead of blurring
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:93:35
 
 	useEffect(() => {
 		flushOnUnmount.current = () => {
-			if (isReportableChange(draft)) {
-				onValueChange(draft);
-			}
+			if (isReportableChange(draft)) {}
 		};
 	});
killedBy: DateRangeSelector keyboard entry reports a finished date when the popover closes instead of blurring
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:99:18
 		};
 	});
 
-	useEffect(() => () => flushOnUnmount.current(), []);
+	useEffect(() => () => undefined, []);
 
 	return (
killedBy: DateRangeSelector keyboard entry reports a finished date when the popover closes instead of blurring
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:99:12
 		};
 	});
 
-	useEffect(() => () => flushOnUnmount.current(), []);
+	useEffect(() => undefined, []);
 
 	return (
killedBy: DateRangeSelector keyboard entry reports a finished date when the popover closes instead of blurring
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] StringLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:106:23
 			<Typography
 				variant="subtitle2"
 				color="text.primary"
-				sx={{ fontWeight: "medium" }}
+				sx={{ fontWeight: "" }}
 			>
 				{label}

[Survived] ObjectLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:106:9
 			<Typography
 				variant="subtitle2"
 				color="text.primary"
-				sx={{ fontWeight: "medium" }}
+				sx={{}}
 			>
 				{label}

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:112:15
 			</Typography>
 			<DatePicker
 				value={draft}
-				onChange={(newValue) => setDraft(newValue as Date | null)}
+				onChange={() => undefined}
 				open={calendarOpen}
 				onOpen={() => setCalendarOpen(true)}
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:114:13
 				value={draft}
 				onChange={(newValue) => setDraft(newValue as Date | null)}
 				open={calendarOpen}
-				onOpen={() => setCalendarOpen(true)}
+				onOpen={() => undefined}
 				onClose={() => setCalendarOpen(false)}
 				onAccept={(newValue) => {
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: Unable to find role="gridcell" and name "5"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1esitpu"
    >

[Killed] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:114:35
 				value={draft}
 				onChange={(newValue) => setDraft(newValue as Date | null)}
 				open={calendarOpen}
-				onOpen={() => setCalendarOpen(true)}
+				onOpen={() => setCalendarOpen(false)}
 				onClose={() => setCalendarOpen(false)}
 				onAccept={(newValue) => {
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: Unable to find role="gridcell" and name "5"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1esitpu"
    >

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:115:14
 				onChange={(newValue) => setDraft(newValue as Date | null)}
 				open={calendarOpen}
 				onOpen={() => setCalendarOpen(true)}
-				onClose={() => setCalendarOpen(false)}
+				onClose={() => undefined}
 				onAccept={(newValue) => {
 					if (calendarOpen) {
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="MuiPopper-root MuiPickerPopper-root css-18ultcs-MuiPopper-root-MuiPickerPopper-root"
  data-popper-escaped=""
  data-popper-placement="bottom-start"
  data-popper-reference-hidden=""
  role="dialog"

[Killed] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:115:36
 				onChange={(newValue) => setDraft(newValue as Date | null)}
 				open={calendarOpen}
 				onOpen={() => setCalendarOpen(true)}
-				onClose={() => setCalendarOpen(false)}
+				onClose={() => setCalendarOpen(true)}
 				onAccept={(newValue) => {
 					if (calendarOpen) {
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="MuiPopper-root MuiPickerPopper-root css-18ultcs-MuiPopper-root-MuiPickerPopper-root"
  data-popper-escaped=""
  data-popper-placement="bottom-start"
  data-popper-reference-hidden=""
  role="dialog"

[Killed] BlockStatement
components/Common/DateRangeSelector/DateRangeSelector.tsx:116:29
 				open={calendarOpen}
 				onOpen={() => setCalendarOpen(true)}
 				onClose={() => setCalendarOpen(false)}
-				onAccept={(newValue) => {
-					if (calendarOpen) {
-						finishEdit(newValue as Date | null);
-					}
-				}}
+				onAccept={(newValue) => {}}
 				format={format}
 				sx={{
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:117:10
 				onOpen={() => setCalendarOpen(true)}
 				onClose={() => setCalendarOpen(false)}
 				onAccept={(newValue) => {
-					if (calendarOpen) {
+					if (true) {
 						finishEdit(newValue as Date | null);
 					}
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 4 times

[Killed] ConditionalExpression
components/Common/DateRangeSelector/DateRangeSelector.tsx:117:10
 				onOpen={() => setCalendarOpen(true)}
 				onClose={() => setCalendarOpen(false)}
 				onAccept={(newValue) => {
-					if (calendarOpen) {
+					if (false) {
 						finishEdit(newValue as Date | null);
 					}
killedBy: DateRangeSelector keyboard entry reports a date picked from the calendar once, then closes the calendar
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] ObjectLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:122:9
 					}
 				}}
 				format={format}
-				sx={{
-					width: "100%",
-					"& .MuiInputBase-root": {
-						borderColor: theme.palette.primary.main,
-					},
-				}}
+				sx={{}}
 				slotProps={{
 					textField: {

[Survived] StringLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:123:13
 				}}
 				format={format}
 				sx={{
-					width: "100%",
+					width: "",
 					"& .MuiInputBase-root": {
 						borderColor: theme.palette.primary.main,

[Survived] BooleanLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:131:18
 				slotProps={{
 					textField: {
 						size: "small",
-						fullWidth: true,
+						fullWidth: false,
 						onBlur: () => finishEdit(draft),
 					},

[Killed] ArrowFunction
components/Common/DateRangeSelector/DateRangeSelector.tsx:132:15
 					textField: {
 						size: "small",
 						fullWidth: true,
-						onBlur: () => finishEdit(draft),
+						onBlur: () => undefined,
 					},
 					day: {
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
components/Common/DateRangeSelector/DateRangeSelector.tsx:164:26
 	onEndDateChange,
 	_testLocalDateFormat,
 }) => {
-	const localDateFormat = _testLocalDateFormat ?? getLocaleDateFormat();
+	const localDateFormat = _testLocalDateFormat && getLocaleDateFormat();
 
 	return (
killedBy: DateRangeSelector keyboard entry reports a typed start date once, when the edit is finished
statusReason: expected "vi.fn()" to be called with arguments: [ 2026-07-04T22:00:00.000Z ]

Received:

  1st vi.fn() call:

  [
-   2026-07-04T22:00:00.000Z,

[Survived] ObjectLiteral
components/Common/DateRangeSelector/DateRangeSelector.tsx:170:9
 		<LocalizationProvider dateAdapter={AdapterDateFns}>
 			<Box
 				sx={{
-					p: { xs: 1.5, sm: 2 },
+					p: {},
 					display: "flex",
 					flexDirection: "column",
