[Killed] ArrowFunction
pages/Common/MetricsView/DashboardHeader.tsx:53:21
 
 	// date-fns throws on a date it cannot format, and a throw here takes the whole
 	// application down with it. A missing label is a far smaller loss than that.
-	const formatDate = (d: Date) =>
-		isValidDate(d) ? format(d, "dd MMM yyyy") : "—";
+	const formatDate = () => undefined;
 
 	return (
killedBy: DashboardHeader shows label and formatted date range and opens popover which calls handlers
statusReason: Unable to find an element with the text: /15 Jul 2025\s*→\s*14 Aug 2025/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-hsw09t"
    >

[Killed] StringLiteral
pages/Common/MetricsView/DashboardHeader.tsx:54:47
 	// date-fns throws on a date it cannot format, and a throw here takes the whole
 	// application down with it. A missing label is a far smaller loss than that.
 	const formatDate = (d: Date) =>
-		isValidDate(d) ? format(d, "dd MMM yyyy") : "—";
+		isValidDate(d) ? format(d, "dd MMM yyyy") : "";
 
 	return (
killedBy: DashboardHeader renders a placeholder for an unusable date and leaves the other one formatted
statusReason: Unable to find an element with the text: /—\s*→\s*14 Aug 2025/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-hsw09t"
    >
