[Killed] Regex
src/utils/date/localDate.ts:13:27
 
 import { isValidDate } from "./isValidDate";
 
-const DATE_ONLY_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
+const DATE_ONLY_PATTERN = /^\d-\d{2}-\d{2}$/;
 
 export function formatLocalDate(date: Date): string {
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] Regex
src/utils/date/localDate.ts:13:27
 
 import { isValidDate } from "./isValidDate";
 
-const DATE_ONLY_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
+const DATE_ONLY_PATTERN = /^\d{4}-\d{2}-\D{2}$/;
 
 export function formatLocalDate(date: Date): string {
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] BlockStatement
src/utils/date/localDate.ts:15:53
 
 const DATE_ONLY_PATTERN = /^\d{4}-\d{2}-\d{2}$/;
 
-export function formatLocalDate(date: Date): string {
-	// Without this the result is the string "NaN-NaN-NaN", which travels on as a
-	// URL param or a query string and looks like a day to everything it reaches.
-	if (!isValidDate(date)) {
-		throw new TypeError(
-			`formatLocalDate cannot encode ${String(date)} as a calendar day.`,
-		);
-	}
-
-	const year = date.getFullYear();
-	const month = String(date.getMonth() + 1).padStart(2, "0");
-	const day = String(date.getDate()).padStart(2, "0");
-	return `${year}-${month}-${day}`;
-}
+export function formatLocalDate(date: Date): string {}
 
 export function parseLocalDate(dateString: string): Date | null {
killedBy: formatLocalDate keeps the calendar day a local midnight date stands for
statusReason: expected undefined to be '2026-07-26' // Object.is equality

[Killed] ConditionalExpression
src/utils/date/localDate.ts:18:6
 export function formatLocalDate(date: Date): string {
 	// Without this the result is the string "NaN-NaN-NaN", which travels on as a
 	// URL param or a query string and looks like a day to everything it reaches.
-	if (!isValidDate(date)) {
+	if (false) {
 		throw new TypeError(
 			`formatLocalDate cannot encode ${String(date)} as a calendar day.`,
killedBy: formatLocalDate refuses a date that could not be parsed
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/utils/date/localDate.ts:18:26
 export function formatLocalDate(date: Date): string {
 	// Without this the result is the string "NaN-NaN-NaN", which travels on as a
 	// URL param or a query string and looks like a day to everything it reaches.
-	if (!isValidDate(date)) {
-		throw new TypeError(
-			`formatLocalDate cannot encode ${String(date)} as a calendar day.`,
-		);
-	}
+	if (!isValidDate(date)) {}
 
 	const year = date.getFullYear();
killedBy: formatLocalDate refuses a date that could not be parsed
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/utils/date/localDate.ts:25:23
 	}
 
 	const year = date.getFullYear();
-	const month = String(date.getMonth() + 1).padStart(2, "0");
+	const month = String(date.getMonth() - 1).padStart(2, "0");
 	const day = String(date.getDate()).padStart(2, "0");
 	return `${year}-${month}-${day}`;
killedBy: formatLocalDate keeps the calendar day a local midnight date stands for
statusReason: expected '2026-05-26' to be '2026-07-26' // Object.is equality

[Killed] StringLiteral
src/utils/date/localDate.ts:25:56
 	}
 
 	const year = date.getFullYear();
-	const month = String(date.getMonth() + 1).padStart(2, "0");
+	const month = String(date.getMonth() + 1).padStart(2, "");
 	const day = String(date.getDate()).padStart(2, "0");
 	return `${year}-${month}-${day}`;
killedBy: formatLocalDate keeps the calendar day a local midnight date stands for
statusReason: expected '2026-7-26' to be '2026-07-26' // Object.is equality

[Killed] StringLiteral
src/utils/date/localDate.ts:26:49
 
 	const year = date.getFullYear();
 	const month = String(date.getMonth() + 1).padStart(2, "0");
-	const day = String(date.getDate()).padStart(2, "0");
+	const day = String(date.getDate()).padStart(2, "");
 	return `${year}-${month}-${day}`;
 }
killedBy: formatLocalDate zero-pads month and day
statusReason: expected '2026-01-5' to be '2026-01-05' // Object.is equality

[Killed] BlockStatement
src/utils/date/localDate.ts:30:65
 	return `${year}-${month}-${day}`;
 }
 
-export function parseLocalDate(dateString: string): Date | null {
-	if (!DATE_ONLY_PATTERN.test(dateString)) {
-		return null;
-	}
-
-	const [year, month, day] = dateString.split("-").map(Number);
-	const parsed = new Date(year, month - 1, day);
-
-	// Rejects overflow dates such as 2026-07-99, which the Date constructor would
-	// silently roll forward into the next month.
-	const isTheDayItClaimsToBe =
-		parsed.getFullYear() === year &&
-		parsed.getMonth() === month - 1 &&
-		parsed.getDate() === day;
-
-	return isTheDayItClaimsToBe ? parsed : null;
-}
+export function parseLocalDate(dateString: string): Date | null {}
 
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected undefined to be 2026 // Object.is equality

[Killed] BlockStatement
src/utils/date/localDate.ts:31:43
 }
 
 export function parseLocalDate(dateString: string): Date | null {
-	if (!DATE_ONLY_PATTERN.test(dateString)) {
-		return null;
-	}
+	if (!DATE_ONLY_PATTERN.test(dateString)) {}
 
 	const [year, month, day] = dateString.split("-").map(Number);
killedBy: parseLocalDate returns null for a month or a day that is not zero-padded
statusReason: expected 2026-07-25T22:00:00.000Z to be null

[Killed] BooleanLiteral
src/utils/date/localDate.ts:31:6
 }
 
 export function parseLocalDate(dateString: string): Date | null {
-	if (!DATE_ONLY_PATTERN.test(dateString)) {
+	if (DATE_ONLY_PATTERN.test(dateString)) {
 		return null;
 	}
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] ArithmeticOperator
src/utils/date/localDate.ts:36:32
 	}
 
 	const [year, month, day] = dateString.split("-").map(Number);
-	const parsed = new Date(year, month - 1, day);
+	const parsed = new Date(year, month + 1, day);
 
 	// Rejects overflow dates such as 2026-07-99, which the Date constructor would
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] EqualityOperator
src/utils/date/localDate.ts:41:3
 	// Rejects overflow dates such as 2026-07-99, which the Date constructor would
 	// silently roll forward into the next month.
 	const isTheDayItClaimsToBe =
-		parsed.getFullYear() === year &&
+		parsed.getFullYear() !== year &&
 		parsed.getMonth() === month - 1 &&
 		parsed.getDate() === day;
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] LogicalOperator
src/utils/date/localDate.ts:41:3
 	// Rejects overflow dates such as 2026-07-99, which the Date constructor would
 	// silently roll forward into the next month.
 	const isTheDayItClaimsToBe =
-		parsed.getFullYear() === year &&
-		parsed.getMonth() === month - 1 &&
+		parsed.getFullYear() === year || parsed.getMonth() === month - 1 &&
 		parsed.getDate() === day;
 
killedBy: parseLocalDate returns null for a year JavaScript would move into the 1900s
statusReason: expected 1926-07-14T23:00:00.000Z to be null

[Killed] EqualityOperator
src/utils/date/localDate.ts:42:3
 	// silently roll forward into the next month.
 	const isTheDayItClaimsToBe =
 		parsed.getFullYear() === year &&
-		parsed.getMonth() === month - 1 &&
+		parsed.getMonth() !== month - 1 &&
 		parsed.getDate() === day;
 
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] ArithmeticOperator
src/utils/date/localDate.ts:42:25
 	// silently roll forward into the next month.
 	const isTheDayItClaimsToBe =
 		parsed.getFullYear() === year &&
-		parsed.getMonth() === month - 1 &&
+		parsed.getMonth() === month + 1 &&
 		parsed.getDate() === day;
 
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Killed] EqualityOperator
src/utils/date/localDate.ts:43:3
 	const isTheDayItClaimsToBe =
 		parsed.getFullYear() === year &&
 		parsed.getMonth() === month - 1 &&
-		parsed.getDate() === day;
+		parsed.getDate() !== day;
 
 	return isTheDayItClaimsToBe ? parsed : null;
killedBy: parseLocalDate anchors the parsed date at local midnight, not UTC midnight
statusReason: expected null not to be null

[Survived] ConditionalExpression
src/utils/date/localDate.ts:43:3
 	const isTheDayItClaimsToBe =
 		parsed.getFullYear() === year &&
 		parsed.getMonth() === month - 1 &&
-		parsed.getDate() === day;
+		true;
 
 	return isTheDayItClaimsToBe ? parsed : null;
