[Killed] ArithmeticOperator
pages/Common/MetricsView/blockedTrend.ts:6:20
 import type { TrendDirection, TrendPayload } from "./trendTypes";
 
 const METRIC_LABEL = "Blocked Items";
-const ONE_DAY_MS = 24 * 60 * 60 * 1000;
+const ONE_DAY_MS = 24 * 60 * 60 / 1000;
 
 const timeOf = (snapshot: BlockedCountSnapshot): number =>
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: expected '2026-07-01' to be '2026-06-30' // Object.is equality

[Killed] ArithmeticOperator
pages/Common/MetricsView/blockedTrend.ts:6:20
 import type { TrendDirection, TrendPayload } from "./trendTypes";
 
 const METRIC_LABEL = "Blocked Items";
-const ONE_DAY_MS = 24 * 60 * 60 * 1000;
+const ONE_DAY_MS = 24 * 60 / 60 * 1000;
 
 const timeOf = (snapshot: BlockedCountSnapshot): number =>
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: expected '2026-07-01' to be '2026-06-30' // Object.is equality

[Killed] ArrowFunction
pages/Common/MetricsView/blockedTrend.ts:8:16
 const METRIC_LABEL = "Blocked Items";
 const ONE_DAY_MS = 24 * 60 * 60 * 1000;
 
-const timeOf = (snapshot: BlockedCountSnapshot): number =>
-	new Date(snapshot.recordedAt).getTime();
+const timeOf = () => undefined;
 
 const latestAtOrBefore = (
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'none' to be 'up' // Object.is equality

[Killed] ArrowFunction
pages/Common/MetricsView/blockedTrend.ts:11:26
 const timeOf = (snapshot: BlockedCountSnapshot): number =>
 	new Date(snapshot.recordedAt).getTime();
 
-const latestAtOrBefore = (
-	history: BlockedCountSnapshot[],
-	cutoff: number,
-): BlockedCountSnapshot | undefined =>
-	history
-		.filter((snapshot) => timeOf(snapshot) <= cutoff)
-		.reduce<BlockedCountSnapshot | undefined>(
-			(latest, snapshot) =>
-				!latest || timeOf(snapshot) >= timeOf(latest) ? snapshot : latest,
-			undefined,
-		);
+const latestAtOrBefore = () => undefined;
 
 const directionOf = (current: number, previous: number): TrendDirection => {
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'none' to be 'up' // Object.is equality

[Killed] MethodExpression
pages/Common/MetricsView/blockedTrend.ts:15:2
 	history: BlockedCountSnapshot[],
 	cutoff: number,
 ): BlockedCountSnapshot | undefined =>
-	history
-		.filter((snapshot) => timeOf(snapshot) <= cutoff)
+	history
 		.reduce<BlockedCountSnapshot | undefined>(
 			(latest, snapshot) =>
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] EqualityOperator
pages/Common/MetricsView/blockedTrend.ts:16:25
 	cutoff: number,
 ): BlockedCountSnapshot | undefined =>
 	history
-		.filter((snapshot) => timeOf(snapshot) <= cutoff)
+		.filter((snapshot) => timeOf(snapshot) > cutoff)
 		.reduce<BlockedCountSnapshot | undefined>(
 			(latest, snapshot) =>
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'none' to be 'up' // Object.is equality

[Killed] ConditionalExpression
pages/Common/MetricsView/blockedTrend.ts:16:25
 	cutoff: number,
 ): BlockedCountSnapshot | undefined =>
 	history
-		.filter((snapshot) => timeOf(snapshot) <= cutoff)
+		.filter((snapshot) => true)
 		.reduce<BlockedCountSnapshot | undefined>(
 			(latest, snapshot) =>
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArrowFunction
pages/Common/MetricsView/blockedTrend.ts:18:4
 	history
 		.filter((snapshot) => timeOf(snapshot) <= cutoff)
 		.reduce<BlockedCountSnapshot | undefined>(
-			(latest, snapshot) =>
-				!latest || timeOf(snapshot) >= timeOf(latest) ? snapshot : latest,
+			() => undefined,
 			undefined,
 		);
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'none' to be 'up' // Object.is equality

[Killed] LogicalOperator
pages/Common/MetricsView/blockedTrend.ts:19:5
 		.filter((snapshot) => timeOf(snapshot) <= cutoff)
 		.reduce<BlockedCountSnapshot | undefined>(
 			(latest, snapshot) =>
-				!latest || timeOf(snapshot) >= timeOf(latest) ? snapshot : latest,
+				!latest && timeOf(snapshot) >= timeOf(latest) ? snapshot : latest,
 			undefined,
 		);
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: Cannot read properties of undefined (reading 'recordedAt')

[Killed] BooleanLiteral
pages/Common/MetricsView/blockedTrend.ts:19:5
 		.filter((snapshot) => timeOf(snapshot) <= cutoff)
 		.reduce<BlockedCountSnapshot | undefined>(
 			(latest, snapshot) =>
-				!latest || timeOf(snapshot) >= timeOf(latest) ? snapshot : latest,
+				latest || timeOf(snapshot) >= timeOf(latest) ? snapshot : latest,
 			undefined,
 		);
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: Cannot read properties of undefined (reading 'recordedAt')

[Killed] BlockStatement
pages/Common/MetricsView/blockedTrend.ts:23:76
 			undefined,
 		);
 
-const directionOf = (current: number, previous: number): TrendDirection => {
-	if (current > previous) {
-		return "up";
-	}
-	if (current < previous) {
-		return "down";
-	}
-	return "flat";
-};
+const directionOf = (current: number, previous: number): TrendDirection => {};
 
 const signOf = (change: number): string => {
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected undefined to be 'up' // Object.is equality

[Killed] EqualityOperator
pages/Common/MetricsView/blockedTrend.ts:24:6
 		);
 
 const directionOf = (current: number, previous: number): TrendDirection => {
-	if (current > previous) {
+	if (current <= previous) {
 		return "up";
 	}
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] BlockStatement
pages/Common/MetricsView/blockedTrend.ts:24:26
 		);
 
 const directionOf = (current: number, previous: number): TrendDirection => {
-	if (current > previous) {
-		return "up";
-	}
+	if (current > previous) {}
 	if (current < previous) {
 		return "down";
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] StringLiteral
pages/Common/MetricsView/blockedTrend.ts:25:10
 
 const directionOf = (current: number, previous: number): TrendDirection => {
 	if (current > previous) {
-		return "up";
+		return "";
 	}
 	if (current < previous) {
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected '' to be 'up' // Object.is equality

[Killed] EqualityOperator
pages/Common/MetricsView/blockedTrend.ts:27:6
 	if (current > previous) {
 		return "up";
 	}
-	if (current < previous) {
+	if (current <= previous) {
 		return "down";
 	}
killedBy: computeBlockedTrend — previous-period trend reports flat when current equals the prior-period boundary
statusReason: expected 'down' to be 'flat' // Object.is equality

[Killed] ConditionalExpression
pages/Common/MetricsView/blockedTrend.ts:27:6
 	if (current > previous) {
 		return "up";
 	}
-	if (current < previous) {
+	if (false) {
 		return "down";
 	}
killedBy: computeBlockedTrend — previous-period trend reports a down/better direction when current is below the prior-period boundary
statusReason: expected 'flat' to be 'down' // Object.is equality

[Killed] StringLiteral
pages/Common/MetricsView/blockedTrend.ts:30:9
 	if (current < previous) {
 		return "down";
 	}
-	return "flat";
+	return "";
 };
 
killedBy: computeBlockedTrend — previous-period trend reports flat when current equals the prior-period boundary
statusReason: expected '' to be 'flat' // Object.is equality

[Killed] BlockStatement
pages/Common/MetricsView/blockedTrend.ts:33:44
 	return "flat";
 };
 
-const signOf = (change: number): string => {
-	if (change > 0) {
-		return "+";
-	}
-	if (change < 0) {
-		return "-";
-	}
-	return "";
-};
+const signOf = (change: number): string => {};
 
 const formatDelta = (current: number, previous: number): string | undefined => {
killedBy: computeBlockedTrend — previous-period trend signs a rise with a plus and names the metric
statusReason: expected 'undefined12.5%' to be '+12.5%' // Object.is equality

[Killed] BlockStatement
pages/Common/MetricsView/blockedTrend.ts:34:18
 };
 
 const signOf = (change: number): string => {
-	if (change > 0) {
-		return "+";
-	}
+	if (change > 0) {}
 	if (change < 0) {
 		return "-";
killedBy: computeBlockedTrend — previous-period trend signs a rise with a plus and names the metric
statusReason: expected '12.5%' to be '+12.5%' // Object.is equality

[Killed] ConditionalExpression
pages/Common/MetricsView/blockedTrend.ts:34:6
 };
 
 const signOf = (change: number): string => {
-	if (change > 0) {
+	if (true) {
 		return "+";
 	}
killedBy: computeBlockedTrend — previous-period trend signs a fall with a minus
statusReason: expected '+12.5%' to be '-12.5%' // Object.is equality

[Killed] BlockStatement
pages/Common/MetricsView/blockedTrend.ts:37:18
 	if (change > 0) {
 		return "+";
 	}
-	if (change < 0) {
-		return "-";
-	}
+	if (change < 0) {}
 	return "";
 };
killedBy: computeBlockedTrend — previous-period trend signs a fall with a minus
statusReason: expected '12.5%' to be '-12.5%' // Object.is equality

[Killed] EqualityOperator
pages/Common/MetricsView/blockedTrend.ts:37:6
 	if (change > 0) {
 		return "+";
 	}
-	if (change < 0) {
+	if (change <= 0) {
 		return "-";
 	}
killedBy: computeBlockedTrend — previous-period trend leaves an unchanged count unsigned rather than calling it a rise or a fall
statusReason: expected '-0.0%' to be '0.0%' // Object.is equality

[Killed] BlockStatement
pages/Common/MetricsView/blockedTrend.ts:43:80
 	return "";
 };
 
-const formatDelta = (current: number, previous: number): string | undefined => {
-	if (previous === 0) {
-		return undefined;
-	}
-	const change = ((current - previous) / previous) * 100;
-	return `${signOf(change)}${Math.abs(change).toFixed(1)}%`;
-};
+const formatDelta = (current: number, previous: number): string | undefined => {};
 
 const NO_BASELINE_HINT =
killedBy: computeBlockedTrend — previous-period trend signs a rise with a plus and names the metric
statusReason: expected undefined to be '+12.5%' // Object.is equality

[Killed] ConditionalExpression
pages/Common/MetricsView/blockedTrend.ts:44:6
 };
 
 const formatDelta = (current: number, previous: number): string | undefined => {
-	if (previous === 0) {
+	if (false) {
 		return undefined;
 	}
killedBy: computeBlockedTrend — absent baseline counts as zero omits the percentage delta when the baseline is zero, keeping the absolute values
statusReason: expected '+Infinity%' to be undefined

[Killed] ConditionalExpression
pages/Common/MetricsView/blockedTrend.ts:44:6
 };
 
 const formatDelta = (current: number, previous: number): string | undefined => {
-	if (previous === 0) {
+	if (true) {
 		return undefined;
 	}
killedBy: computeBlockedTrend — previous-period trend signs a rise with a plus and names the metric
statusReason: expected undefined to be '+12.5%' // Object.is equality

[Killed] ArithmeticOperator
pages/Common/MetricsView/blockedTrend.ts:47:18
 	if (previous === 0) {
 		return undefined;
 	}
-	const change = ((current - previous) / previous) * 100;
+	const change = ((current - previous) * previous) * 100;
 	return `${signOf(change)}${Math.abs(change).toFixed(1)}%`;
 };
killedBy: computeBlockedTrend — previous-period trend signs a rise with a plus and names the metric
statusReason: expected '+800.0%' to be '+12.5%' // Object.is equality

[Killed] ArithmeticOperator
pages/Common/MetricsView/blockedTrend.ts:47:17
 	if (previous === 0) {
 		return undefined;
 	}
-	const change = ((current - previous) / previous) * 100;
+	const change = (current - previous) / previous / 100;
 	return `${signOf(change)}${Math.abs(change).toFixed(1)}%`;
 };
killedBy: computeBlockedTrend — previous-period trend signs a rise with a plus and names the metric
statusReason: expected '+0.0%' to be '+12.5%' // Object.is equality

[Killed] ArrowFunction
pages/Common/MetricsView/blockedTrend.ts:60:25
  * recording instance legitimately has no snapshot before the previous-period boundary; surfacing the
  * hint keeps the widget from reading as inert without fabricating a zero-delta.
  */
-const noBaselineTrend = (): TrendPayload => ({
-	direction: "none",
-	metricLabel: METRIC_LABEL,
-	noBaseline: true,
-	hintText: NO_BASELINE_HINT,
-});
+const noBaselineTrend = () => undefined;
 
 /**
killedBy: computeBlockedTrend — absent baseline counts as zero does not fabricate a direction when the history holds nothing at or before the range end
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
pages/Common/MetricsView/blockedTrend.ts:63:14
 const noBaselineTrend = (): TrendPayload => ({
 	direction: "none",
 	metricLabel: METRIC_LABEL,
-	noBaseline: true,
+	noBaseline: false,
 	hintText: NO_BASELINE_HINT,
 });
killedBy: computeBlockedTrend — absent baseline counts as zero does not fabricate a direction when the history holds nothing at or before the range end
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
pages/Common/MetricsView/blockedTrend.ts:88:20
 	startDate: Date,
 	endDate: Date,
 ): TrendPayload | undefined {
-	const snapshots = history ?? [];
+	const snapshots = history && [];
 	const boundary = startDate.getTime() - ONE_DAY_MS;
 
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
pages/Common/MetricsView/blockedTrend.ts:89:19
 	endDate: Date,
 ): TrendPayload | undefined {
 	const snapshots = history ?? [];
-	const boundary = startDate.getTime() - ONE_DAY_MS;
+	const boundary = startDate.getTime() + ONE_DAY_MS;
 
 	const current = latestAtOrBefore(snapshots, endDate.getTime());
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: expected '2026-07-02' to be '2026-06-30' // Object.is equality

[Killed] ConditionalExpression
pages/Common/MetricsView/blockedTrend.ts:92:6
 	const boundary = startDate.getTime() - ONE_DAY_MS;
 
 	const current = latestAtOrBefore(snapshots, endDate.getTime());
-	if (!current && snapshots.length > 0) {
+	if (true) {
 		// Records exist but every one of them postdates the selected range, so recording
 		// demonstrably began after it ended. Nothing was measured at either end here, and
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'none' to be 'up' // Object.is equality

[Killed] BooleanLiteral
pages/Common/MetricsView/blockedTrend.ts:92:6
 	const boundary = startDate.getTime() - ONE_DAY_MS;
 
 	const current = latestAtOrBefore(snapshots, endDate.getTime());
-	if (!current && snapshots.length > 0) {
+	if (current && snapshots.length > 0) {
 		// Records exist but every one of them postdates the selected range, so recording
 		// demonstrably began after it ended. Nothing was measured at either end here, and
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'none' to be 'up' // Object.is equality

[Killed] OptionalChaining
pages/Common/MetricsView/blockedTrend.ts:101:23
 
 	const baseline = latestAtOrBefore(snapshots, boundary);
 
-	const currentCount = current?.blockedCount ?? 0;
+	const currentCount = current.blockedCount ?? 0;
 	const baselineCount = baseline?.blockedCount ?? 0;
 	const percentageDelta = formatDelta(currentCount, baselineCount);
killedBy: computeBlockedTrend — absent baseline counts as zero renders flat on an entirely empty history rather than a no-baseline placeholder
statusReason: Cannot read properties of undefined (reading 'blockedCount')

[Killed] LogicalOperator
pages/Common/MetricsView/blockedTrend.ts:101:23
 
 	const baseline = latestAtOrBefore(snapshots, boundary);
 
-	const currentCount = current?.blockedCount ?? 0;
+	const currentCount = current?.blockedCount && 0;
 	const baselineCount = baseline?.blockedCount ?? 0;
 	const percentageDelta = formatDelta(currentCount, baselineCount);
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected 'down' to be 'up' // Object.is equality

[Killed] LogicalOperator
pages/Common/MetricsView/blockedTrend.ts:102:24
 	const baseline = latestAtOrBefore(snapshots, boundary);
 
 	const currentCount = current?.blockedCount ?? 0;
-	const baselineCount = baseline?.blockedCount ?? 0;
+	const baselineCount = baseline?.blockedCount && 0;
 	const percentageDelta = formatDelta(currentCount, baselineCount);
 
killedBy: computeBlockedTrend — previous-period trend reports a down/better direction when current is below the prior-period boundary
statusReason: expected 'up' to be 'down' // Object.is equality

[Killed] OptionalChaining
pages/Common/MetricsView/blockedTrend.ts:102:24
 	const baseline = latestAtOrBefore(snapshots, boundary);
 
 	const currentCount = current?.blockedCount ?? 0;
-	const baselineCount = baseline?.blockedCount ?? 0;
+	const baselineCount = baseline.blockedCount ?? 0;
 	const percentageDelta = formatDelta(currentCount, baselineCount);
 
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: Cannot read properties of undefined (reading 'blockedCount')

[Killed] ObjectLiteral
pages/Common/MetricsView/blockedTrend.ts:105:9
 	const baselineCount = baseline?.blockedCount ?? 0;
 	const percentageDelta = formatDelta(currentCount, baselineCount);
 
-	return {
-		direction: directionOf(currentCount, baselineCount),
-		metricLabel: METRIC_LABEL,
-		currentLabel: current?.recordedAt ?? formatLocalDate(endDate),
-		currentValue: String(currentCount),
-		// Never a fabricated recordedAt: state the boundary day the zero stands for.
-		previousLabel: baseline?.recordedAt ?? formatLocalDate(new Date(boundary)),
-		previousValue: String(baselineCount),
-		...(percentageDelta ? { percentageDelta } : {}),
-	};
+	return {};
 }
 
killedBy: computeBlockedTrend — previous-period trend reports an up/worse direction when current exceeds the prior-period boundary
statusReason: expected undefined to be 'up' // Object.is equality

[Killed] LogicalOperator
pages/Common/MetricsView/blockedTrend.ts:108:17
 	return {
 		direction: directionOf(currentCount, baselineCount),
 		metricLabel: METRIC_LABEL,
-		currentLabel: current?.recordedAt ?? formatLocalDate(endDate),
+		currentLabel: current?.recordedAt && formatLocalDate(endDate),
 		currentValue: String(currentCount),
 		// Never a fabricated recordedAt: state the boundary day the zero stands for.
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: expected '2026-07-14' to be '2026-07-10' // Object.is equality

[Killed] OptionalChaining
pages/Common/MetricsView/blockedTrend.ts:108:17
 	return {
 		direction: directionOf(currentCount, baselineCount),
 		metricLabel: METRIC_LABEL,
-		currentLabel: current?.recordedAt ?? formatLocalDate(endDate),
+		currentLabel: current.recordedAt ?? formatLocalDate(endDate),
 		currentValue: String(currentCount),
 		// Never a fabricated recordedAt: state the boundary day the zero stands for.
killedBy: computeBlockedTrend — absent baseline counts as zero renders flat on an entirely empty history rather than a no-baseline placeholder
statusReason: Cannot read properties of undefined (reading 'recordedAt')

[Killed] LogicalOperator
pages/Common/MetricsView/blockedTrend.ts:111:18
 		currentLabel: current?.recordedAt ?? formatLocalDate(endDate),
 		currentValue: String(currentCount),
 		// Never a fabricated recordedAt: state the boundary day the zero stands for.
-		previousLabel: baseline?.recordedAt ?? formatLocalDate(new Date(boundary)),
+		previousLabel: baseline?.recordedAt && formatLocalDate(new Date(boundary)),
 		previousValue: String(baselineCount),
 		...(percentageDelta ? { percentageDelta } : {}),
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: expected undefined to be '2026-06-30' // Object.is equality

[Killed] OptionalChaining
pages/Common/MetricsView/blockedTrend.ts:111:18
 		currentLabel: current?.recordedAt ?? formatLocalDate(endDate),
 		currentValue: String(currentCount),
 		// Never a fabricated recordedAt: state the boundary day the zero stands for.
-		previousLabel: baseline?.recordedAt ?? formatLocalDate(new Date(boundary)),
+		previousLabel: baseline.recordedAt ?? formatLocalDate(new Date(boundary)),
 		previousValue: String(baselineCount),
 		...(percentageDelta ? { percentageDelta } : {}),
killedBy: computeBlockedTrend — absent baseline counts as zero labels each side with the day it was actually measured on, not the range edges
statusReason: Cannot read properties of undefined (reading 'recordedAt')
