[Killed] BlockStatement
pages/Common/MetricsView/usePbcOverTime.ts:30:11
 	metricType: ProcessBehaviorMetricType,
 	startDate: Date,
 	endDate: Date,
-): string {
-	return `${metricType}|${formatLocalDate(startDate)}|${formatLocalDate(endDate)}`;
-}
+): string {}
 
 export interface PbcOverTimeState {
killedBy: usePbcOverTime refetches when the range changes and never serves the previous range's limits
statusReason: expected [ { recordedAt: '2026-07-02', …(3) } ] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
pages/Common/MetricsView/usePbcOverTime.ts:60:18
 	const [cache, setCache] = useState<MetricTypeCache>({});
 	const key = cacheKey(metricType, startDate, endDate);
 
-	useEffect(() => {
-		// Already fetched for this family AND range — re-plot from the persisted
-		// series, no recompute. A range change is a different key, so it refetches
-		// instead of replaying a stale series.
-		if (cache[key] !== undefined) {
-			return;
-		}
-		let cancelled = false;
-		metricsService
-			.getProcessBehaviorOverTime(ownerId, metricType, startDate, endDate)
-			.then((data) => {
-				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
-				}
-			})
-			.catch((error) =>
-				console.error("Error fetching process behavior over time:", error),
-			);
-		return () => {
-			cancelled = true;
-		};
-	}, [ownerId, metricsService, metricType, startDate, endDate, key, cache]);
+	useEffect(() => {}, [ownerId, metricsService, metricType, startDate, endDate, key, cache]);
 
 	return { metricType, setMetricType, series: cache[key] ?? null };
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
pages/Common/MetricsView/usePbcOverTime.ts:64:7
 		// Already fetched for this family AND range — re-plot from the persisted
 		// series, no recompute. A range change is a different key, so it refetches
 		// instead of replaying a stale series.
-		if (cache[key] !== undefined) {
+		if (cache[key] === undefined) {
 			return;
 		}
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
pages/Common/MetricsView/usePbcOverTime.ts:64:7
 		// Already fetched for this family AND range — re-plot from the persisted
 		// series, no recompute. A range change is a different key, so it refetches
 		// instead of replaying a stale series.
-		if (cache[key] !== undefined) {
+		if (true) {
 			return;
 		}
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
pages/Common/MetricsView/usePbcOverTime.ts:70:20
 		let cancelled = false;
 		metricsService
 			.getProcessBehaviorOverTime(ownerId, metricType, startDate, endDate)
-			.then((data) => {
-				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
-				}
-			})
+			.then((data) => {})
 			.catch((error) =>
 				console.error("Error fetching process behavior over time:", error),
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
pages/Common/MetricsView/usePbcOverTime.ts:71:9
 		metricsService
 			.getProcessBehaviorOverTime(ownerId, metricType, startDate, endDate)
 			.then((data) => {
-				if (!cancelled) {
+				if (cancelled) {
 					setCache((previous) => ({ ...previous, [key]: data }));
 				}
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
pages/Common/MetricsView/usePbcOverTime.ts:71:21
 		metricsService
 			.getProcessBehaviorOverTime(ownerId, metricType, startDate, endDate)
 			.then((data) => {
-				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
-				}
+				if (!cancelled) {}
 			})
 			.catch((error) =>
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
pages/Common/MetricsView/usePbcOverTime.ts:72:15
 			.getProcessBehaviorOverTime(ownerId, metricType, startDate, endDate)
 			.then((data) => {
 				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
+					setCache(() => undefined);
 				}
 			})
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
pages/Common/MetricsView/usePbcOverTime.ts:75:11
 					setCache((previous) => ({ ...previous, [key]: data }));
 				}
 			})
-			.catch((error) =>
-				console.error("Error fetching process behavior over time:", error),
+			.catch(() => undefined,
 			);
 		return () => {
killedBy: usePbcOverTime when a response outlives the request that asked for it surfaces a failed request and leaves the widget with nothing to plot
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] StringLiteral
pages/Common/MetricsView/usePbcOverTime.ts:76:19
 				}
 			})
 			.catch((error) =>
-				console.error("Error fetching process behavior over time:", error),
+				console.error("", error),
 			);
 		return () => {

[Killed] BlockStatement
pages/Common/MetricsView/usePbcOverTime.ts:78:16
 			.catch((error) =>
 				console.error("Error fetching process behavior over time:", error),
 			);
-		return () => {
-			cancelled = true;
-		};
+		return () => {};
 	}, [ownerId, metricsService, metricType, startDate, endDate, key, cache]);
 
killedBy: usePbcOverTime when a response outlives the request that asked for it keeps the series of the owner now on screen when a superseded response lands late
statusReason: expected [ { recordedAt: '2026-07-02', …(3) } ] to deeply equal [ …(2) ]

[Killed] LogicalOperator
pages/Common/MetricsView/usePbcOverTime.ts:83:46
 		};
 	}, [ownerId, metricsService, metricType, startDate, endDate, key, cache]);
 
-	return { metricType, setMetricType, series: cache[key] ?? null };
+	return { metricType, setMetricType, series: cache[key] && null };
 }
 
killedBy: usePbcOverTime fetches once per family-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(3) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
