[Killed] BlockStatement
pages/Common/MetricsView/usePercentilesOverTime.ts:29:11
 	selection: PercentilesSelection,
 	startDate: Date,
 	endDate: Date,
-): string {
-	return `${selection}|${formatLocalDate(startDate)}|${formatLocalDate(endDate)}`;
-}
+): string {}
 
 export interface PercentilesOverTimeState {
killedBy: usePercentilesOverTime refetches when the range changes and never serves the previous range's series
statusReason: expected [ { recordedAt: '2026-07-02', …(5) } ] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
pages/Common/MetricsView/usePercentilesOverTime.ts:30:9
 	startDate: Date,
 	endDate: Date,
 ): string {
-	return `${selection}|${formatLocalDate(startDate)}|${formatLocalDate(endDate)}`;
+	return ``;
 }
 
killedBy: usePercentilesOverTime refetches when the range changes and never serves the previous range's series
statusReason: expected [ { recordedAt: '2026-07-02', …(5) } ] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
pages/Common/MetricsView/usePercentilesOverTime.ts:58:18
 	const [cache, setCache] = useState<SelectionCache>({});
 	const key = cacheKey(selection, startDate, endDate);
 
-	useEffect(() => {
-		// Already fetched for this selection AND range — re-plot from the persisted
-		// series, no recompute. A range change is a different key, so it refetches
-		// instead of replaying a stale series.
-		if (cache[key] !== undefined) {
-			return;
-		}
-		let cancelled = false;
-		metricsService
-			.getPercentilesOverTime(ownerId, selection, startDate, endDate)
-			.then((data) => {
-				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
-				}
-			})
-			.catch((error) =>
-				console.error("Error fetching percentiles over time:", error),
-			);
-		return () => {
-			cancelled = true;
-		};
-	}, [ownerId, metricsService, selection, startDate, endDate, key, cache]);
+	useEffect(() => {}, [ownerId, metricsService, selection, startDate, endDate, key, cache]);
 
 	return { selection, setSelection, series: cache[key] ?? null };
killedBy: usePercentilesOverTime fetches once per selection-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(5) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
pages/Common/MetricsView/usePercentilesOverTime.ts:68:20
 		let cancelled = false;
 		metricsService
 			.getPercentilesOverTime(ownerId, selection, startDate, endDate)
-			.then((data) => {
-				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
-				}
-			})
+			.then((data) => {})
 			.catch((error) =>
 				console.error("Error fetching percentiles over time:", error),
killedBy: usePercentilesOverTime fetches once per selection-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(5) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
pages/Common/MetricsView/usePercentilesOverTime.ts:69:9
 		metricsService
 			.getPercentilesOverTime(ownerId, selection, startDate, endDate)
 			.then((data) => {
-				if (!cancelled) {
+				if (false) {
 					setCache((previous) => ({ ...previous, [key]: data }));
 				}
killedBy: usePercentilesOverTime fetches once per selection-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(5) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Timeout] ObjectLiteral
pages/Common/MetricsView/usePercentilesOverTime.ts:70:30
 			.getPercentilesOverTime(ownerId, selection, startDate, endDate)
 			.then((data) => {
 				if (!cancelled) {
-					setCache((previous) => ({ ...previous, [key]: data }));
+					setCache((previous) => ({}));
 				}
 			})

[Killed] ArrowFunction
pages/Common/MetricsView/usePercentilesOverTime.ts:73:11
 					setCache((previous) => ({ ...previous, [key]: data }));
 				}
 			})
-			.catch((error) =>
-				console.error("Error fetching percentiles over time:", error),
+			.catch(() => undefined,
 			);
 		return () => {
killedBy: usePercentilesOverTime when a response outlives the request that asked for it surfaces a failed request and leaves the widget with nothing to plot
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
pages/Common/MetricsView/usePercentilesOverTime.ts:79:5
 		return () => {
 			cancelled = true;
 		};
-	}, [ownerId, metricsService, selection, startDate, endDate, key, cache]);
+	}, []);
 
 	return { selection, setSelection, series: cache[key] ?? null };
killedBy: usePercentilesOverTime refetches when the range changes and never serves the previous range's series
statusReason: expected null to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
pages/Common/MetricsView/usePercentilesOverTime.ts:81:44
 		};
 	}, [ownerId, metricsService, selection, startDate, endDate, key, cache]);
 
-	return { selection, setSelection, series: cache[key] ?? null };
+	return { selection, setSelection, series: cache[key] && null };
 }
 
killedBy: usePercentilesOverTime fetches once per selection-and-range pair and passes the range through
statusReason: expected null to deeply equal [ { recordedAt: '2026-07-02', …(5) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
