[Killed] LogicalOperator
components/Common/BaseSettings/GeneralSettingsComponent.tsx:56:3
 	// Every wizard reads through /wizards/*, which is System Admin only (ADR-126) — offering the
 	// button to anyone else only buys them a 403.
 	const availableWizards =
-		selectedWorkTrackingSystem && isSystemAdmin
+		selectedWorkTrackingSystem || isSystemAdmin
 			? getWizardsForSystem(
 					selectedWorkTrackingSystem.workTrackingSystem,
killedBy: GeneralSettingsComponent calls onSettingsChange with correct arguments when name changes
statusReason: Cannot read properties of null (reading 'workTrackingSystem')

[Killed] ConditionalExpression
components/Common/BaseSettings/GeneralSettingsComponent.tsx:56:3
 	// Every wizard reads through /wizards/*, which is System Admin only (ADR-126) — offering the
 	// button to anyone else only buys them a 403.
 	const availableWizards =
-		selectedWorkTrackingSystem && isSystemAdmin
+		true
 			? getWizardsForSystem(
 					selectedWorkTrackingSystem.workTrackingSystem,
killedBy: GeneralSettingsComponent calls onSettingsChange with correct arguments when name changes
statusReason: Cannot read properties of null (reading 'workTrackingSystem')

[Survived] ArrayDeclaration
components/Common/BaseSettings/GeneralSettingsComponent.tsx:61:6
 					selectedWorkTrackingSystem.workTrackingSystem,
 					settingsContext,
 				)
-			: [];
+			: ["Stryker was here"];
 
 	const handleWizardComplete = (boardInfo: IBoardInformation) => {

[Killed] OptionalChaining
components/Common/BaseSettings/GeneralSettingsComponent.tsx:172:20
 						rows={4}
 						fullWidth
 						margin="normal"
-						placeholder={schema?.placeholder ?? undefined}
+						placeholder={schema.placeholder ?? undefined}
 						helperText={schema?.helpText ?? undefined}
 						value={settings?.dataRetrievalValue ?? ""}
killedBy: GeneralSettingsComponent renders correctly with provided settings
statusReason: Cannot read properties of undefined (reading 'placeholder')

[Killed] LogicalOperator
components/Common/BaseSettings/GeneralSettingsComponent.tsx:172:20
 						rows={4}
 						fullWidth
 						margin="normal"
-						placeholder={schema?.placeholder ?? undefined}
+						placeholder={schema?.placeholder && undefined}
 						helperText={schema?.helpText ?? undefined}
 						value={settings?.dataRetrievalValue ?? ""}
killedBy: GeneralSettingsComponent telling a flow coach what the query field wants shows a worked example in the empty field and the guidance beneath it
statusReason: expect(element).toHaveAttribute("placeholder", "active=true^priority=1") // element.getAttribute("placeholder") === "active=true^priority=1"

Expected the element to have attribute:
  placeholder="active=true^priority=1"
Received:
  null

[Killed] OptionalChaining
components/Common/BaseSettings/GeneralSettingsComponent.tsx:173:19
 						fullWidth
 						margin="normal"
 						placeholder={schema?.placeholder ?? undefined}
-						helperText={schema?.helpText ?? undefined}
+						helperText={schema.helpText ?? undefined}
 						value={settings?.dataRetrievalValue ?? ""}
 						onChange={(e) =>
killedBy: GeneralSettingsComponent renders correctly with provided settings
statusReason: Cannot read properties of undefined (reading 'helpText')

[Killed] LogicalOperator
components/Common/BaseSettings/GeneralSettingsComponent.tsx:173:19
 						fullWidth
 						margin="normal"
 						placeholder={schema?.placeholder ?? undefined}
-						helperText={schema?.helpText ?? undefined}
+						helperText={schema?.helpText && undefined}
 						value={settings?.dataRetrievalValue ?? ""}
 						onChange={(e) =>
killedBy: GeneralSettingsComponent telling a flow coach what the query field wants shows a worked example in the empty field and the guidance beneath it
statusReason: 
Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] LogicalOperator
components/Common/BaseSettings/GeneralSettingsComponent.tsx:174:14
 						margin="normal"
 						placeholder={schema?.placeholder ?? undefined}
 						helperText={schema?.helpText ?? undefined}
-						value={settings?.dataRetrievalValue ?? ""}
+						value={settings?.dataRetrievalValue && ""}
 						onChange={(e) =>
 							onSettingsChange(
killedBy: GeneralSettingsComponent renders correctly with provided settings
statusReason: expect(element).toHaveValue(Test Query)

Expected the element to have value:
  Test Query
Received:

[Survived] OptionalChaining
components/Common/BaseSettings/GeneralSettingsComponent.tsx:174:14
 						margin="normal"
 						placeholder={schema?.placeholder ?? undefined}
 						helperText={schema?.helpText ?? undefined}
-						value={settings?.dataRetrievalValue ?? ""}
+						value={settings.dataRetrievalValue ?? ""}
 						onChange={(e) =>
 							onSettingsChange(
