[Killed] BlockStatement
src/hooks/useCreateWizard.ts:49:15
 const hasEveryConfigInput = (
 	base: WizardDtoBase,
 	schema: IDataRetrievalSchema | null,
-): boolean => {
-	if (!schema) return false;
-	const hasValidDataRetrieval =
-		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
-	const hasValidWorkItemTypes =
-		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
-	const hasAllStates =
-		base.toDoStates.length > 0 &&
-		base.doingStates.length > 0 &&
-		base.doneStates.length > 0;
-	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
-};
+): boolean => {};
 
 // A wizard fills in what it could work out and leaves the rest to whatever the user already typed.
killedBy: CreateTeamWizard Step 2: Load Data wizard complete + validation pass → jumps to Name & Create
statusReason: Unable to find a label with the text of: Team Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:50:6
 	base: WizardDtoBase,
 	schema: IDataRetrievalSchema | null,
 ): boolean => {
-	if (!schema) return false;
+	if (false) return false;
 	const hasValidDataRetrieval =
 		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
killedBy: useCreateWizard configInputsValid is false when the connection has no data retrieval schema
statusReason: Cannot read properties of null (reading 'isRequired')

[Killed] BooleanLiteral
src/hooks/useCreateWizard.ts:50:22
 	base: WizardDtoBase,
 	schema: IDataRetrievalSchema | null,
 ): boolean => {
-	if (!schema) return false;
+	if (!schema) return true;
 	const hasValidDataRetrieval =
 		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
killedBy: useCreateWizard configInputsValid is false when the connection has no data retrieval schema
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:52:3
 ): boolean => {
 	if (!schema) return false;
 	const hasValidDataRetrieval =
-		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
+		schema.isRequired !== false || base.dataRetrievalValue.trim() !== "";
 	const hasValidWorkItemTypes =
 		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
killedBy: useCreateWizard configInputsValid is false when the query is empty
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/hooks/useCreateWizard.ts:52:3
 ): boolean => {
 	if (!schema) return false;
 	const hasValidDataRetrieval =
-		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
+		schema.isRequired === false && base.dataRetrievalValue.trim() !== "";
 	const hasValidWorkItemTypes =
 		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
killedBy: useCreateWizard configInputsValid is true when all required fields are filled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:54:3
 	const hasValidDataRetrieval =
 		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
 	const hasValidWorkItemTypes =
-		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
+		false;
 	const hasAllStates =
 		base.toDoStates.length > 0 &&
killedBy: useCreateWizard configInputsValid is true when all required fields are filled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:54:3
 	const hasValidDataRetrieval =
 		schema.isRequired === false || base.dataRetrievalValue.trim() !== "";
 	const hasValidWorkItemTypes =
-		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
+		false || base.workItemTypes.length > 0;
 	const hasAllStates =
 		base.toDoStates.length > 0 &&
killedBy: useCreateWizard configInputsValid treats workItemTypes as optional when schema.isWorkItemTypesRequired=false
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/hooks/useCreateWizard.ts:56:3
 	const hasValidWorkItemTypes =
 		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
 	const hasAllStates =
-		base.toDoStates.length > 0 &&
-		base.doingStates.length > 0 &&
+		base.toDoStates.length > 0 || base.doingStates.length > 0 &&
 		base.doneStates.length > 0;
 	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
killedBy: useCreateWizard configInputsValid is false when nothing says where work starts
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:56:3
 	const hasValidWorkItemTypes =
 		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
 	const hasAllStates =
-		base.toDoStates.length > 0 &&
+		base.toDoStates.length >= 0 &&
 		base.doingStates.length > 0 &&
 		base.doneStates.length > 0;
killedBy: useCreateWizard configInputsValid is false when nothing says where work starts
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:57:3
 		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
 	const hasAllStates =
 		base.toDoStates.length > 0 &&
-		base.doingStates.length > 0 &&
+		base.doingStates.length <= 0 &&
 		base.doneStates.length > 0;
 	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
killedBy: useCreateWizard configInputsValid is true when all required fields are filled
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:57:3
 		schema.isWorkItemTypesRequired === false || base.workItemTypes.length > 0;
 	const hasAllStates =
 		base.toDoStates.length > 0 &&
-		base.doingStates.length > 0 &&
+		base.doingStates.length >= 0 &&
 		base.doneStates.length > 0;
 	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
killedBy: useCreateWizard configInputsValid is false when nothing says work is under way
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:58:3
 	const hasAllStates =
 		base.toDoStates.length > 0 &&
 		base.doingStates.length > 0 &&
-		base.doneStates.length > 0;
+		base.doneStates.length >= 0;
 	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
 };
killedBy: useCreateWizard configInputsValid is false when nothing says where work ends
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:58:3
 	const hasAllStates =
 		base.toDoStates.length > 0 &&
 		base.doingStates.length > 0 &&
-		base.doneStates.length > 0;
+		base.doneStates.length <= 0;
 	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
 };
killedBy: useCreateWizard configInputsValid is true when all required fields are filled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:59:9
 		base.toDoStates.length > 0 &&
 		base.doingStates.length > 0 &&
 		base.doneStates.length > 0;
-	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
+	return true;
 };
 
killedBy: useCreateWizard configInputsValid is false when required fields are empty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:59:9
 		base.toDoStates.length > 0 &&
 		base.doingStates.length > 0 &&
 		base.doneStates.length > 0;
-	return hasValidDataRetrieval && hasValidWorkItemTypes && hasAllStates;
+	return true && hasAllStates;
 };
 
killedBy: useCreateWizard configInputsValid is false when the query is empty
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/hooks/useCreateWizard.ts:63:20
 };
 
 // A wizard fills in what it could work out and leaves the rest to whatever the user already typed.
-const mergedWith = (
-	boardInfo: IBoardInformation,
-	current: WizardDtoBase,
-): WizardDtoBase => ({
-	...current,
-	dataRetrievalValue:
-		boardInfo.dataRetrievalValue.trim() === ""
-			? current.dataRetrievalValue
-			: boardInfo.dataRetrievalValue,
-	workItemTypes:
-		boardInfo.workItemTypes.length > 0
-			? boardInfo.workItemTypes
-			: current.workItemTypes,
-	toDoStates:
-		boardInfo.toDoStates.length > 0 ? boardInfo.toDoStates : current.toDoStates,
-	doingStates:
-		boardInfo.doingStates.length > 0
-			? boardInfo.doingStates
-			: current.doingStates,
-	doneStates:
-		boardInfo.doneStates.length > 0 ? boardInfo.doneStates : current.doneStates,
-});
+const mergedWith = () => undefined;
 
 export function useCreateWizard<TDto>({
killedBy: CreateTeamWizard Step 2: Load Data wizard complete + validation pass → jumps to Name & Create
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ObjectLiteral
src/hooks/useCreateWizard.ts:66:22
 const mergedWith = (
 	boardInfo: IBoardInformation,
 	current: WizardDtoBase,
-): WizardDtoBase => ({
-	...current,
-	dataRetrievalValue:
-		boardInfo.dataRetrievalValue.trim() === ""
-			? current.dataRetrievalValue
-			: boardInfo.dataRetrievalValue,
-	workItemTypes:
-		boardInfo.workItemTypes.length > 0
-			? boardInfo.workItemTypes
-			: current.workItemTypes,
-	toDoStates:
-		boardInfo.toDoStates.length > 0 ? boardInfo.toDoStates : current.toDoStates,
-	doingStates:
-		boardInfo.doingStates.length > 0
-			? boardInfo.doingStates
-			: current.doingStates,
-	doneStates:
-		boardInfo.doneStates.length > 0 ? boardInfo.doneStates : current.doneStates,
-});
+): WizardDtoBase => ({});
 
 export function useCreateWizard<TDto>({
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:69:3
 ): WizardDtoBase => ({
 	...current,
 	dataRetrievalValue:
-		boardInfo.dataRetrievalValue.trim() === ""
+		boardInfo.dataRetrievalValue.trim() !== ""
 			? current.dataRetrievalValue
 			: boardInfo.dataRetrievalValue,
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: expected '' to be 'SELECT * FROM WorkItems' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:69:3
 ): WizardDtoBase => ({
 	...current,
 	dataRetrievalValue:
-		boardInfo.dataRetrievalValue.trim() === ""
+		false
 			? current.dataRetrievalValue
 			: boardInfo.dataRetrievalValue,
killedBy: useCreateWizard handleWizardComplete preserves existing state for empty board info fields
statusReason: expected '' to be 'existing-query' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:73:3
 			? current.dataRetrievalValue
 			: boardInfo.dataRetrievalValue,
 	workItemTypes:
-		boardInfo.workItemTypes.length > 0
+		false
 			? boardInfo.workItemTypes
 			: current.workItemTypes,
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: expected [] to deeply equal [ 'Story', 'Bug' ]

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:73:3
 			? current.dataRetrievalValue
 			: boardInfo.dataRetrievalValue,
 	workItemTypes:
-		boardInfo.workItemTypes.length > 0
+		true
 			? boardInfo.workItemTypes
 			: current.workItemTypes,
killedBy: useCreateWizard handleWizardComplete preserves existing state for empty board info fields
statusReason: expected [] to deeply equal [ 'ExistingType' ]

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:77:3
 			? boardInfo.workItemTypes
 			: current.workItemTypes,
 	toDoStates:
-		boardInfo.toDoStates.length > 0 ? boardInfo.toDoStates : current.toDoStates,
+		boardInfo.toDoStates.length >= 0 ? boardInfo.toDoStates : current.toDoStates,
 	doingStates:
 		boardInfo.doingStates.length > 0
killedBy: useCreateWizard handleWizardComplete preserves existing state for empty board info fields
statusReason: expected [] to deeply equal [ 'New' ]

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:77:3
 			? boardInfo.workItemTypes
 			: current.workItemTypes,
 	toDoStates:
-		boardInfo.toDoStates.length > 0 ? boardInfo.toDoStates : current.toDoStates,
+		boardInfo.toDoStates.length <= 0 ? boardInfo.toDoStates : current.toDoStates,
 	doingStates:
 		boardInfo.doingStates.length > 0
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: expected [] to deeply equal [ 'New' ]

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:79:3
 	toDoStates:
 		boardInfo.toDoStates.length > 0 ? boardInfo.toDoStates : current.toDoStates,
 	doingStates:
-		boardInfo.doingStates.length > 0
+		false
 			? boardInfo.doingStates
 			: current.doingStates,
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: expected [] to deeply equal [ 'Active' ]

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:79:3
 	toDoStates:
 		boardInfo.toDoStates.length > 0 ? boardInfo.toDoStates : current.toDoStates,
 	doingStates:
-		boardInfo.doingStates.length > 0
+		boardInfo.doingStates.length >= 0
 			? boardInfo.doingStates
 			: current.doingStates,
killedBy: useCreateWizard handleWizardComplete preserves existing state for empty board info fields
statusReason: expected [] to deeply equal [ 'Active' ]

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:83:3
 			? boardInfo.doingStates
 			: current.doingStates,
 	doneStates:
-		boardInfo.doneStates.length > 0 ? boardInfo.doneStates : current.doneStates,
+		true ? boardInfo.doneStates : current.doneStates,
 });
 
killedBy: useCreateWizard handleWizardComplete preserves existing state for empty board info fields
statusReason: expected [] to deeply equal [ 'Done' ]

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:83:3
 			? boardInfo.doingStates
 			: current.doingStates,
 	doneStates:
-		boardInfo.doneStates.length > 0 ? boardInfo.doneStates : current.doneStates,
+		boardInfo.doneStates.length <= 0 ? boardInfo.doneStates : current.doneStates,
 });
 
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: expected [] to deeply equal [ 'Closed' ]

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:157:17
 			entityType,
 		);
 		setAvailableWizards(wizards);
-		setActiveStep(wizards.length > 0 ? STEP_LOAD_DATA : STEP_CONFIGURE);
+		setActiveStep(wizards.length <= 0 ? STEP_LOAD_DATA : STEP_CONFIGURE);
 	};
 
killedBy: useCreateWizard selectConnection advances to STEP_LOAD_DATA when wizards are available
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:157:17
 			entityType,
 		);
 		setAvailableWizards(wizards);
-		setActiveStep(wizards.length > 0 ? STEP_LOAD_DATA : STEP_CONFIGURE);
+		setActiveStep(false ? STEP_LOAD_DATA : STEP_CONFIGURE);
 	};
 
killedBy: useCreateWizard selectConnection advances to STEP_LOAD_DATA when wizards are available
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/hooks/useCreateWizard.ts:161:3
 	};
 
 	const currentBase = useCallback(
-		(): WizardDtoBase => ({
-			dataRetrievalValue,
-			workItemTypes,
-			toDoStates,
-			doingStates,
-			doneStates,
-			workTrackingSystemConnectionId: selectedConnection?.id ?? 0,
-		}),
+		() => undefined,
 		[
 			dataRetrievalValue,
killedBy: useCreateWizard selectConnection advances to STEP_LOAD_DATA when wizards are available
statusReason: Cannot read properties of undefined (reading 'dataRetrievalValue')

[Killed] OptionalChaining
src/hooks/useCreateWizard.ts:167:36
 			toDoStates,
 			doingStates,
 			doneStates,
-			workTrackingSystemConnectionId: selectedConnection?.id ?? 0,
+			workTrackingSystemConnectionId: selectedConnection.id ?? 0,
 		}),
 		[
killedBy: useCreateWizard handleCreate sets saving=true during save and false after
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/hooks/useCreateWizard.ts:167:36
 			toDoStates,
 			doingStates,
 			doneStates,
-			workTrackingSystemConnectionId: selectedConnection?.id ?? 0,
+			workTrackingSystemConnectionId: selectedConnection?.id && 0,
 		}),
 		[
killedBy: useCreateWizard handleCreate calls saveSettings with the assembled DTO
statusReason: expected +0 to be 7 // Object.is equality

[Killed] ArrowFunction
src/hooks/useCreateWizard.ts:180:3
 	);
 
 	const configInputsValid = useMemo(
-		() =>
-			// Stryker disable next-line ConditionalExpression: schema is null exactly when there is no
-			// connection, and hasEveryConfigInput already answers false for a null schema.
-			selectedConnection != null && hasEveryConfigInput(currentBase(), schema),
+		() => undefined,
 		[selectedConnection, schema, currentBase],
 	);
killedBy: useCreateWizard configInputsValid is false before a connection is selected
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/hooks/useCreateWizard.ts:183:4
 		() =>
 			// Stryker disable next-line ConditionalExpression: schema is null exactly when there is no
 			// connection, and hasEveryConfigInput already answers false for a null schema.
-			selectedConnection != null && hasEveryConfigInput(currentBase(), schema),
+			selectedConnection == null && hasEveryConfigInput(currentBase(), schema),
 		[selectedConnection, schema, currentBase],
 	);
killedBy: useCreateWizard configInputsValid is true when all required fields are filled
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/hooks/useCreateWizard.ts:183:4
 		() =>
 			// Stryker disable next-line ConditionalExpression: schema is null exactly when there is no
 			// connection, and hasEveryConfigInput already answers false for a null schema.
-			selectedConnection != null && hasEveryConfigInput(currentBase(), schema),
+			// Stryker disable next-line ConditionalExpression: schema is null exactly when there is no
+// connection, and hasEveryConfigInput already answers false for a null schema.
+selectedConnection != null || hasEveryConfigInput(currentBase(), schema),
 		[selectedConnection, schema, currentBase],
 	);
killedBy: useCreateWizard configInputsValid is false when required fields are empty
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useCreateWizard.ts:188:17
 	);
 
 	const runValidation = async (): Promise<boolean> => {
-		setValidating(true);
+		setValidating(false);
 		setValidationError(null);
 		setValidationTechnicalDetails(null);
killedBy: useCreateWizard handleNext marks itself validating for as long as the instance is being asked
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useCreateWizard.ts:191:7
 		setValidating(true);
 		setValidationError(null);
 		setValidationTechnicalDetails(null);
-		try {
-			const dto = buildDto(currentBase(), name);
-			const isValid = await validateSettings(dto);
-			if (!isValid) {
-				setValidationError(
-					"Validation failed. Check your configuration and try again.",
-				);
-				setValidationTechnicalDetails(null);
-			}
-			return isValid;
-		} catch (error) {
+		try {} catch (error) {
 			if (error instanceof ApiError) {
 				setValidationError(error.message);
killedBy: useCreateWizard handleNext calls validateSettings and advances to STEP_NAME_CREATE on success
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/hooks/useCreateWizard.ts:194:8
 		try {
 			const dto = buildDto(currentBase(), name);
 			const isValid = await validateSettings(dto);
-			if (!isValid) {
+			if (isValid) {
 				setValidationError(
 					"Validation failed. Check your configuration and try again.",
killedBy: useCreateWizard handleNext calls validateSettings and advances to STEP_NAME_CREATE on success
statusReason: expected 'Validation failed. Check your configu…' to be null

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:194:8
 		try {
 			const dto = buildDto(currentBase(), name);
 			const isValid = await validateSettings(dto);
-			if (!isValid) {
+			if (false) {
 				setValidationError(
 					"Validation failed. Check your configuration and try again.",
killedBy: useCreateWizard handleNext sets validationError and stays on STEP_CONFIGURE when validation fails
statusReason: .toMatch() expects to receive a string, but got object

[Killed] BlockStatement
src/hooks/useCreateWizard.ts:201:19
 				setValidationTechnicalDetails(null);
 			}
 			return isValid;
-		} catch (error) {
-			if (error instanceof ApiError) {
-				setValidationError(error.message);
-				setValidationTechnicalDetails(error.technicalDetails ?? null);
-			} else {
-				setValidationError(
-					"Validation failed. Check your configuration and try again.",
-				);
-				setValidationTechnicalDetails(null);
-			}
-			return false;
-		} finally {
+		} catch (error) {} finally {
 			setValidating(false);
 		}
killedBy: useCreateWizard handleNext sets validationError when validateSettings throws
statusReason: .toMatch() expects to receive a string, but got object

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:202:8
 			}
 			return isValid;
 		} catch (error) {
-			if (error instanceof ApiError) {
+			if (false) {
 				setValidationError(error.message);
 				setValidationTechnicalDetails(error.technicalDetails ?? null);
killedBy: CreateTeamWizard Step 3: Configure (manual) shows validation details when validation throws ApiError
statusReason: Unable to find an element with the text: No work items were found.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >

[Killed] BlockStatement
src/hooks/useCreateWizard.ts:202:35
 			}
 			return isValid;
 		} catch (error) {
-			if (error instanceof ApiError) {
-				setValidationError(error.message);
-				setValidationTechnicalDetails(error.technicalDetails ?? null);
-			} else {
+			if (error instanceof ApiError) {} else {
 				setValidationError(
 					"Validation failed. Check your configuration and try again.",
killedBy: CreateTeamWizard Step 3: Configure (manual) shows validation details when validation throws ApiError
statusReason: Unable to find an element with the text: No work items were found.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >

[Killed] BlockStatement
src/hooks/useCreateWizard.ts:205:11
 			if (error instanceof ApiError) {
 				setValidationError(error.message);
 				setValidationTechnicalDetails(error.technicalDetails ?? null);
-			} else {
-				setValidationError(
-					"Validation failed. Check your configuration and try again.",
-				);
-				setValidationTechnicalDetails(null);
-			}
+			} else {}
 			return false;
 		} finally {
killedBy: useCreateWizard handleNext sets validationError when validateSettings throws
statusReason: .toMatch() expects to receive a string, but got object

[Killed] BlockStatement
src/hooks/useCreateWizard.ts:212:13
 				setValidationTechnicalDetails(null);
 			}
 			return false;
-		} finally {
-			setValidating(false);
-		}
+		} finally {}
 	};
 
killedBy: useCreateWizard handleNext marks itself validating for as long as the instance is being asked
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useCreateWizard.ts:213:18
 			}
 			return false;
 		} finally {
-			setValidating(false);
+			setValidating(true);
 		}
 	};
killedBy: useCreateWizard handleNext marks itself validating for as long as the instance is being asked
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useCreateWizard.ts:227:17
 		setDoneStates(merged.doneStates);
 		setActiveWizard(null);
 
-		setValidating(true);
+		setValidating(false);
 		setValidationError(null);
 		setValidationTechnicalDetails(null);
killedBy: useCreateWizard handleWizardComplete marks itself validating for as long as the instance is being asked
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useCreateWizard.ts:230:7
 		setValidating(true);
 		setValidationError(null);
 		setValidationTechnicalDetails(null);
-		try {
-			const isValid = await validateSettings(buildDto(merged, name));
-
-			// #5610. The Next button on Configure is gated on the config inputs and this path was not,
-			// so a wizard that could not fill everything in landed the user on Name & Create with the
-			// gap intact — ValidateTeamSettings does not look at state mappings, so it says valid.
-			const complete = hasEveryConfigInput(merged, schema);
-			setActiveStep(isValid && complete ? STEP_NAME_CREATE : STEP_CONFIGURE);
-		} catch (error) {
+		try {} catch (error) {
 			if (error instanceof ApiError) {
 				setValidationError(error.message);
killedBy: useCreateWizard handleWizardComplete merges board info into state and validates
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:237:18
 			// so a wizard that could not fill everything in landed the user on Name & Create with the
 			// gap intact — ValidateTeamSettings does not look at state mappings, so it says valid.
 			const complete = hasEveryConfigInput(merged, schema);
-			setActiveStep(isValid && complete ? STEP_NAME_CREATE : STEP_CONFIGURE);
+			setActiveStep(false ? STEP_NAME_CREATE : STEP_CONFIGURE);
 		} catch (error) {
 			if (error instanceof ApiError) {
killedBy: useCreateWizard handleWizardComplete advances to STEP_NAME_CREATE when validation passes
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:237:18
 			// so a wizard that could not fill everything in landed the user on Name & Create with the
 			// gap intact — ValidateTeamSettings does not look at state mappings, so it says valid.
 			const complete = hasEveryConfigInput(merged, schema);
-			setActiveStep(isValid && complete ? STEP_NAME_CREATE : STEP_CONFIGURE);
+			setActiveStep(true ? STEP_NAME_CREATE : STEP_CONFIGURE);
 		} catch (error) {
 			if (error instanceof ApiError) {
killedBy: useCreateWizard handleWizardComplete stays on STEP_CONFIGURE when the wizard could not fill in every config input
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/hooks/useCreateWizard.ts:239:8
 			const complete = hasEveryConfigInput(merged, schema);
 			setActiveStep(isValid && complete ? STEP_NAME_CREATE : STEP_CONFIGURE);
 		} catch (error) {
-			if (error instanceof ApiError) {
+			if (true) {
 				setValidationError(error.message);
 				setValidationTechnicalDetails(error.technicalDetails ?? null);
killedBy: useCreateWizard handleWizardComplete falls back to STEP_CONFIGURE when validation throws
statusReason: expected 'network' to be null
