[Killed] LogicalOperator
components/Common/CreateWizards/CreateTeamWizard.tsx:71:26
 			onWizardComplete={wizard.handleWizardComplete}
 			onWizardCancel={wizard.handleWizardCancel}
 			onSetActiveStep={wizard.setActiveStep}
-			selectedConnectionId={wizard.selectedConnection?.id ?? null}
+			selectedConnectionId={wizard.selectedConnection?.id && null}
 			dataRetrievalLabel={wizard.getDataRetrievalLabel()}
 			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
killedBy: CreateTeamWizard Step 2: Load Data clicking a wizard opens the wizard dialog
statusReason: Unable to find an element by: [data-testid="mock-wizard-dialog"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >

[Killed] OptionalChaining
components/Common/CreateWizards/CreateTeamWizard.tsx:71:26
 			onWizardComplete={wizard.handleWizardComplete}
 			onWizardCancel={wizard.handleWizardCancel}
 			onSetActiveStep={wizard.setActiveStep}
-			selectedConnectionId={wizard.selectedConnection?.id ?? null}
+			selectedConnectionId={wizard.selectedConnection.id ?? null}
 			dataRetrievalLabel={wizard.getDataRetrievalLabel()}
 			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
killedBy: CreateTeamWizard Step 1: Choose Connection renders a stepper with four steps
statusReason: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
components/Common/CreateWizards/CreateTeamWizard.tsx:73:30
 			onSetActiveStep={wizard.setActiveStep}
 			selectedConnectionId={wizard.selectedConnection?.id ?? null}
 			dataRetrievalLabel={wizard.getDataRetrievalLabel()}
-			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
+			dataRetrievalPlaceholder={wizard.schema.placeholder ?? undefined}
 			dataRetrievalHelpText={wizard.schema?.helpText ?? undefined}
 			onDataRetrievalChange={wizard.setDataRetrievalValue}
killedBy: CreateTeamWizard Step 1: Choose Connection renders a stepper with four steps
statusReason: Cannot read properties of null (reading 'placeholder')

[Killed] LogicalOperator
components/Common/CreateWizards/CreateTeamWizard.tsx:73:30
 			onSetActiveStep={wizard.setActiveStep}
 			selectedConnectionId={wizard.selectedConnection?.id ?? null}
 			dataRetrievalLabel={wizard.getDataRetrievalLabel()}
-			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
+			dataRetrievalPlaceholder={wizard.schema?.placeholder && undefined}
 			dataRetrievalHelpText={wizard.schema?.helpText ?? undefined}
 			onDataRetrievalChange={wizard.setDataRetrievalValue}
killedBy: CreateTeamWizard telling a flow coach what the query field wants shows a worked example in the empty field and the guidance beneath it
statusReason: expect(element).toHaveAttribute("placeholder", "active=true^priority=1") // element.getAttribute("placeholder") === "active=true^priority=1"

Expected the element to have attribute:
  placeholder="active=true^priority=1"
Received:
  null

[Killed] LogicalOperator
components/Common/CreateWizards/CreateTeamWizard.tsx:74:27
 			selectedConnectionId={wizard.selectedConnection?.id ?? null}
 			dataRetrievalLabel={wizard.getDataRetrievalLabel()}
 			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
-			dataRetrievalHelpText={wizard.schema?.helpText ?? undefined}
+			dataRetrievalHelpText={wizard.schema?.helpText && undefined}
 			onDataRetrievalChange={wizard.setDataRetrievalValue}
 			showWorkItemTypes={wizard.schema?.isWorkItemTypesRequired !== false}
killedBy: CreateTeamWizard telling a flow coach what the query field wants shows a worked example in the empty field and the guidance beneath it
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >

[Killed] OptionalChaining
components/Common/CreateWizards/CreateTeamWizard.tsx:74:27
 			selectedConnectionId={wizard.selectedConnection?.id ?? null}
 			dataRetrievalLabel={wizard.getDataRetrievalLabel()}
 			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
-			dataRetrievalHelpText={wizard.schema?.helpText ?? undefined}
+			dataRetrievalHelpText={wizard.schema.helpText ?? undefined}
 			onDataRetrievalChange={wizard.setDataRetrievalValue}
 			showWorkItemTypes={wizard.schema?.isWorkItemTypesRequired !== false}
killedBy: CreateTeamWizard Step 1: Choose Connection renders a stepper with four steps
statusReason: Cannot read properties of null (reading 'helpText')

[Killed] OptionalChaining
components/Common/CreateWizards/CreateTeamWizard.tsx:76:23
 			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
 			dataRetrievalHelpText={wizard.schema?.helpText ?? undefined}
 			onDataRetrievalChange={wizard.setDataRetrievalValue}
-			showWorkItemTypes={wizard.schema?.isWorkItemTypesRequired !== false}
+			showWorkItemTypes={wizard.schema.isWorkItemTypesRequired !== false}
 			onAddWorkItemType={(t) =>
 				wizard.setWorkItemTypes((prev) => [...prev, t.trim()])
killedBy: CreateTeamWizard Step 1: Choose Connection renders a stepper with four steps
statusReason: Cannot read properties of null (reading 'isWorkItemTypesRequired')

[Killed] BooleanLiteral
components/Common/CreateWizards/CreateTeamWizard.tsx:76:66
 			dataRetrievalPlaceholder={wizard.schema?.placeholder ?? undefined}
 			dataRetrievalHelpText={wizard.schema?.helpText ?? undefined}
 			onDataRetrievalChange={wizard.setDataRetrievalValue}
-			showWorkItemTypes={wizard.schema?.isWorkItemTypesRequired !== false}
+			showWorkItemTypes={wizard.schema?.isWorkItemTypesRequired !== true}
 			onAddWorkItemType={(t) =>
 				wizard.setWorkItemTypes((prev) => [...prev, t.trim()])
killedBy: CreateTeamWizard Step 2: Load Data wizard complete + validation fail → lands on Configure step with data
statusReason: Unable to find an element with the text: User Story. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >
