[Killed] StringLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:23:2
 // Boards are shared, not roled, so an empty list has two causes nothing on the instance can tell
 // apart (ADR-126). Name both, assert neither.
 const NO_BOARDS =
-	"No boards to offer. Either this account is not a member of any Visual Task Board, or none of the boards it can see carries both a table and a filter.";
+	"";
 
 // The backend words its own refusals (ADR-126); only a failure that never reached it needs copy here.
killedBy: BoardWizard names both reasons a connection may have no board to offer
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /not a member of any Visual Task Board/i
Received:
  Select BoardBoardBoardCancelConfirm

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/components/DataRetrievalWizards/BoardWizard.tsx:26:19
 	"No boards to offer. Either this account is not a member of any Visual Task Board, or none of the boards it can see carries both a table and a filter.";
 
 // The backend words its own refusals (ADR-126); only a failure that never reached it needs copy here.
-const refusalOr = (err: unknown, fallback: string): string =>
-	err instanceof ApiError && err.message ? err.message : fallback;
+const refusalOr = () => undefined;
 
 const BoardWizard: React.FC<DataRetrievalWizardProps> = ({
killedBy: BoardWizard shows the reason the board list was refused
statusReason: 
Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] LogicalOperator
src/components/DataRetrievalWizards/BoardWizard.tsx:27:2
 
 // The backend words its own refusals (ADR-126); only a failure that never reached it needs copy here.
 const refusalOr = (err: unknown, fallback: string): string =>
-	err instanceof ApiError && err.message ? err.message : fallback;
+	err instanceof ApiError || err.message ? err.message : fallback;
 
 const BoardWizard: React.FC<DataRetrievalWizardProps> = ({
killedBy: BoardWizard words a failure that never reached the backend itself
statusReason: Unable to find an element with the text: Failed to load boards. Please try again.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] ConditionalExpression
src/components/DataRetrievalWizards/BoardWizard.tsx:27:2
 
 // The backend words its own refusals (ADR-126); only a failure that never reached it needs copy here.
 const refusalOr = (err: unknown, fallback: string): string =>
-	err instanceof ApiError && err.message ? err.message : fallback;
+	true ? err.message : fallback;
 
 const BoardWizard: React.FC<DataRetrievalWizardProps> = ({
killedBy: BoardWizard words a failure that never reached the backend itself
statusReason: Unable to find an element with the text: Failed to load boards. Please try again.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Survived] BooleanLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:41:50
 	const [selectedBoard, setSelectedBoard] = useState<IBoard | null>(null);
 	const [boardInformation, setBoardInformation] =
 		useState<IBoardInformation | null>(null);
-	const [loading, setLoading] = useState<boolean>(false);
+	const [loading, setLoading] = useState<boolean>(true);
 	const [fetchingBoardInfo, setFetchingBoardInfo] = useState<boolean>(false);
 	const [error, setError] = useState<string>("");

[Killed] BooleanLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:42:70
 	const [boardInformation, setBoardInformation] =
 		useState<IBoardInformation | null>(null);
 	const [loading, setLoading] = useState<boolean>(false);
-	const [fetchingBoardInfo, setFetchingBoardInfo] = useState<boolean>(false);
+	const [fetchingBoardInfo, setFetchingBoardInfo] = useState<boolean>(true);
 	const [error, setError] = useState<string>("");
 
killedBy: BoardWizard does not display board information before board selection
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="MuiTypography-root MuiTypography-body2 css-7ctihp-MuiTypography-root"
>
  Loading Board Information
</p> instead

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:45:45
 	const [fetchingBoardInfo, setFetchingBoardInfo] = useState<boolean>(false);
 	const [error, setError] = useState<string>("");
 
-	const loadBoards = useCallback(async () => {
-		setLoading(true);
-		setError("");
-
-		try {
-			const fetchedBoards = await wizardService.getBoards(
-				workTrackingSystemConnectionId,
-			);
-			setBoards(fetchedBoards);
-
-			if (fetchedBoards.length === 0) {
-				setError(NO_BOARDS);
-			}
-		} catch (err) {
-			setError(refusalOr(err, "Failed to load boards. Please try again."));
-			console.error("Error loading boards:", err);
-		} finally {
-			setLoading(false);
-		}
-	}, [wizardService, workTrackingSystemConnectionId]);
+	const loadBoards = useCallback(async () => {}, [wizardService, workTrackingSystemConnectionId]);
 
 	useEffect(() => {
killedBy: BoardWizard shows loading state while fetching boards
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] BooleanLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:46:14
 	const [error, setError] = useState<string>("");
 
 	const loadBoards = useCallback(async () => {
-		setLoading(true);
+		setLoading(false);
 		setError("");
 
killedBy: BoardWizard shows loading state while fetching boards
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Survived] StringLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:47:12
 
 	const loadBoards = useCallback(async () => {
 		setLoading(true);
-		setError("");
+		setError("Stryker was here!");
 
 		try {

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:49:7
 		setLoading(true);
 		setError("");
 
-		try {
-			const fetchedBoards = await wizardService.getBoards(
-				workTrackingSystemConnectionId,
-			);
-			setBoards(fetchedBoards);
-
-			if (fetchedBoards.length === 0) {
-				setError(NO_BOARDS);
-			}
-		} catch (err) {
+		try {} catch (err) {
 			setError(refusalOr(err, "Failed to load boards. Please try again."));
 			console.error("Error loading boards:", err);
killedBy: BoardWizard shows loading state while fetching boards
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:55:36
 			);
 			setBoards(fetchedBoards);
 
-			if (fetchedBoards.length === 0) {
-				setError(NO_BOARDS);
-			}
+			if (fetchedBoards.length === 0) {}
 		} catch (err) {
 			setError(refusalOr(err, "Failed to load boards. Please try again."));
killedBy: BoardWizard names both reasons a connection may have no board to offer
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /not a member of any Visual Task Board/i
Received:
  Select BoardBoardBoardCancelConfirm

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/DataRetrievalWizards/BoardWizard.tsx:55:8
 			);
 			setBoards(fetchedBoards);
 
-			if (fetchedBoards.length === 0) {
+			if (false) {
 				setError(NO_BOARDS);
 			}
killedBy: BoardWizard names both reasons a connection may have no board to offer
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /not a member of any Visual Task Board/i
Received:
  Select BoardBoardBoardCancelConfirm

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:58:17
 			if (fetchedBoards.length === 0) {
 				setError(NO_BOARDS);
 			}
-		} catch (err) {
-			setError(refusalOr(err, "Failed to load boards. Please try again."));
-			console.error("Error loading boards:", err);
-		} finally {
+		} catch (err) {} finally {
 			setLoading(false);
 		}
killedBy: BoardWizard shows the reason the board list was refused
statusReason: 
Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:61:13
 		} catch (err) {
 			setError(refusalOr(err, "Failed to load boards. Please try again."));
 			console.error("Error loading boards:", err);
-		} finally {
-			setLoading(false);
-		}
+		} finally {}
 	}, [wizardService, workTrackingSystemConnectionId]);
 
killedBy: BoardWizard renders the wizard when open
statusReason: Unable to find a label with the text of: Board

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:66:18
 		}
 	}, [wizardService, workTrackingSystemConnectionId]);
 
-	useEffect(() => {
-		if (open) {
-			loadBoards();
-		}
-	}, [open, loadBoards]);
+	useEffect(() => {}, [open, loadBoards]);
 
 	const fetchBoardInformation = useCallback(
killedBy: BoardWizard shows loading state while fetching boards
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:67:13
 	}, [wizardService, workTrackingSystemConnectionId]);
 
 	useEffect(() => {
-		if (open) {
-			loadBoards();
-		}
+		if (open) {}
 	}, [open, loadBoards]);
 
killedBy: BoardWizard shows loading state while fetching boards
statusReason: Unable to find an accessible element with the role "progressbar"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] ConditionalExpression
src/components/DataRetrievalWizards/BoardWizard.tsx:67:7
 	}, [wizardService, workTrackingSystemConnectionId]);
 
 	useEffect(() => {
-		if (open) {
+		if (true) {
 			loadBoards();
 		}
killedBy: BoardWizard does not render when closed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      1,

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:73:28
 	}, [open, loadBoards]);
 
 	const fetchBoardInformation = useCallback(
-		async (board: IBoard) => {
-			setFetchingBoardInfo(true);
-			setError("");
-
-			try {
-				const info = await wizardService.getBoardInformation(
-					workTrackingSystemConnectionId,
-					board.id,
-				);
-				setBoardInformation(info);
-			} catch (err) {
-				console.error("Error fetching board information:", err);
-				setBoardInformation(null);
-				setError(refusalOr(err, "Failed to read the board. Please try again."));
-			} finally {
-				setFetchingBoardInfo(false);
-			}
-		},
+		async (board: IBoard) => {},
 		[wizardService, workTrackingSystemConnectionId],
 	);
killedBy: BoardWizard enables Confirm button when a board is selected
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BooleanLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:74:25
 
 	const fetchBoardInformation = useCallback(
 		async (board: IBoard) => {
-			setFetchingBoardInfo(true);
+			setFetchingBoardInfo(false);
 			setError("");
 
killedBy: BoardWizard shows loading spinner while fetching board information
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:77:8
 			setFetchingBoardInfo(true);
 			setError("");
 
-			try {
-				const info = await wizardService.getBoardInformation(
-					workTrackingSystemConnectionId,
-					board.id,
-				);
-				setBoardInformation(info);
-			} catch (err) {
+			try {} catch (err) {
 				console.error("Error fetching board information:", err);
 				setBoardInformation(null);
killedBy: BoardWizard enables Confirm button when a board is selected
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:83:18
 					board.id,
 				);
 				setBoardInformation(info);
-			} catch (err) {
-				console.error("Error fetching board information:", err);
-				setBoardInformation(null);
-				setError(refusalOr(err, "Failed to read the board. Please try again."));
-			} finally {
+			} catch (err) {} finally {
 				setFetchingBoardInfo(false);
 			}
killedBy: BoardWizard words a board read that never reached the backend itself
statusReason: Unable to find an element with the text: Failed to read the board. Please try again.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] StringLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:86:29
 			} catch (err) {
 				console.error("Error fetching board information:", err);
 				setBoardInformation(null);
-				setError(refusalOr(err, "Failed to read the board. Please try again."));
+				setError(refusalOr(err, ""));
 			} finally {
 				setFetchingBoardInfo(false);
killedBy: BoardWizard words a board read that never reached the backend itself
statusReason: Unable to find an element with the text: Failed to read the board. Please try again.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] BlockStatement
src/components/DataRetrievalWizards/BoardWizard.tsx:87:14
 				console.error("Error fetching board information:", err);
 				setBoardInformation(null);
 				setError(refusalOr(err, "Failed to read the board. Please try again."));
-			} finally {
-				setFetchingBoardInfo(false);
-			}
+			} finally {}
 		},
 		[wizardService, workTrackingSystemConnectionId],
killedBy: BoardWizard enables Confirm button when a board is selected
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="MuiButtonBase-root Mui-disabled MuiButton-root MuiButton-contained MuiButton-sizeMedium MuiButton-colorPrimary css-74d805-MuiButtonBase-root-MuiButton-root"
  disabled=""
  tabindex="-1"
  type="button"

[Killed] BooleanLiteral
src/components/DataRetrievalWizards/BoardWizard.tsx:88:26
 				setBoardInformation(null);
 				setError(refusalOr(err, "Failed to read the board. Please try again."));
 			} finally {
-				setFetchingBoardInfo(false);
+				setFetchingBoardInfo(true);
 			}
 		},
killedBy: BoardWizard enables Confirm button when a board is selected
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="MuiButtonBase-root Mui-disabled MuiButton-root MuiButton-contained MuiButton-sizeMedium MuiButton-colorPrimary css-74d805-MuiButtonBase-root-MuiButton-root"
  disabled=""
  tabindex="-1"
  type="button"

[Killed] ArrayDeclaration
src/components/DataRetrievalWizards/BoardWizard.tsx:91:3
 				setFetchingBoardInfo(false);
 			}
 		},
-		[wizardService, workTrackingSystemConnectionId],
+		[],
 	);
 
killedBy: BoardWizard asks the connection it is now pointed at
statusReason: expected "vi.fn()" to be called with arguments: [ 42, '1' ]

Received:

  1st vi.fn() call:

  [
-   42,
