[Killed] StringLiteral
src/components/DataRetrievalWizards/DataRetrievalWizardRegistry.ts:39:7
 		component: BoardWizard,
 	},
 	{
-		id: "servicenow.board",
+		id: "",
 		name: "Select Visual Task Board",
 		applicableSystemTypes: ["ServiceNow"],
killedBy: DataRetrievalWizardRegistry picking a ServiceNow board is offered to a team
statusReason: expected [ '' ] to include 'servicenow.board'

[Killed] StringLiteral
src/components/DataRetrievalWizards/DataRetrievalWizardRegistry.ts:41:27
 	{
 		id: "servicenow.board",
 		name: "Select Visual Task Board",
-		applicableSystemTypes: ["ServiceNow"],
+		applicableSystemTypes: [""],
 		// Team only: a ServiceNow portfolio renders no query field for a board to fill in (ADR-125).
 		applicableSettingsContexts: ["team"],
killedBy: DataRetrievalWizardRegistry picking a ServiceNow board is offered to a team
statusReason: expected [] to include 'servicenow.board'
