[Killed] ObjectLiteral
src/models/Common/DataRetrievalSchemaDefaults.ts:56:14
 		isWorkItemTypesRequired: true,
 		wizardHint: "csv-team-wizard",
 	},
-	ServiceNow: {
-		key: "servicenow.query",
-		displayLabel: "ServiceNow Query (Encoded Query)",
-		inputKind: "freetext",
-		isRequired: true,
-		// Always, whatever table the connection reads (ADR-123 decision 6, amended 2026-07-31):
-		// a field hidden here is still honoured by the read.
-		isWorkItemTypesRequired: true,
-		// The Visual Task Board picker is registered in DataRetrievalWizardRegistry, not here:
-		// wizardHint is read by nothing (ADR-125, #5610).
-		wizardHint: null,
-		// Non-reference fields only: a reference field stores a sys_id, so matching it against a
-		// display label selects nothing (#5610).
-		placeholder: "active=true^priority=1",
-		helpText:
-			"To get an encoded query, filter a list in ServiceNow, right-click the filter breadcrumb, and choose Copy query",
-	},
+	ServiceNow: {},
 };
 
killedBy: CreateTeamWizard telling a flow coach what the query field wants shows a worked example in the empty field and the guidance beneath it
statusReason: Unable to find a label with the text of: ServiceNow Query (Encoded Query)

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >

[Killed] StringLiteral
src/models/Common/DataRetrievalSchemaDefaults.ts:59:14
 	ServiceNow: {
 		key: "servicenow.query",
 		displayLabel: "ServiceNow Query (Encoded Query)",
-		inputKind: "freetext",
+		inputKind: "",
 		isRequired: true,
 		// Always, whatever table the connection reads (ADR-123 decision 6, amended 2026-07-31):
killedBy: What Lighthouse asks a ServiceNow shop for when a team is pointed at ServiceNow asks for a ServiceNow query in the shop's own words
statusReason: expected '' to be 'freetext' // Object.is equality

[Killed] BooleanLiteral
src/models/Common/DataRetrievalSchemaDefaults.ts:60:15
 		key: "servicenow.query",
 		displayLabel: "ServiceNow Query (Encoded Query)",
 		inputKind: "freetext",
-		isRequired: true,
+		isRequired: false,
 		// Always, whatever table the connection reads (ADR-123 decision 6, amended 2026-07-31):
 		// a field hidden here is still honoured by the read.
killedBy: What Lighthouse asks a ServiceNow shop for when a team is pointed at ServiceNow asks for a ServiceNow query in the shop's own words
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/models/Common/DataRetrievalSchemaDefaults.ts:63:28
 		isRequired: true,
 		// Always, whatever table the connection reads (ADR-123 decision 6, amended 2026-07-31):
 		// a field hidden here is still honoured by the read.
-		isWorkItemTypesRequired: true,
+		isWorkItemTypesRequired: false,
 		// The Visual Task Board picker is registered in DataRetrievalWizardRegistry, not here:
 		// wizardHint is read by nothing (ADR-125, #5610).
killedBy: What Lighthouse asks a ServiceNow shop for when a ServiceNow team is asked what work is its own asks which kinds of work are the team's own
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/models/Common/DataRetrievalSchemaDefaults.ts:71:4
 		// display label selects nothing (#5610).
 		placeholder: "active=true^priority=1",
 		helpText:
-			"To get an encoded query, filter a list in ServiceNow, right-click the filter breadcrumb, and choose Copy query",
+			"",
 	},
 };
killedBy: CreateTeamWizard telling a flow coach what the query field wants shows a worked example in the empty field and the guidance beneath it
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-1r4ai6y"
    >
